{"sections":{"164872987662732b2c":{"type":"specialized__page_header","settings":{"spl_text":"Widely regarded as the Best hair growth vitamins for Chemotherapy related hair loss","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"animation":"none","css_class":"","custom_css":".special-head{\n    background-image: url({{ 'trubloom_review_bg.png' | asset_url }});\n    background-size: cover;\n}\n.home-slide-content p {\n    color: #727272;\n    font-size: 18px;\n}\n.home-slide-content h2 {\n    color: #ff9ac6;\n    font-size: 26px;\n}"}},"1654682937e9784b78":{"type":"specialized__video_review","settings":{"specialized__180_review":"shopify:\/\/shop_images\/meg_k_180_day_review.png","specialized__180_review_title":"SEE MEG’S JOURNEY & TRANSFORMATION","specialized__180_review_content":"<p>Taking one capsule a day and drinking tons of water sped up the growth as you can see in the after photo. I’m going to continue this challenge for 1 year! Follow my hair growth journey! I highly recommend this to anyone who has lost their hair through chemo and or wants their hair longer, stronger or thicker!<\/p>","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"animation":"none","css_class":"","custom_css":""}},"16486356205a406201":{"type":"specialized__page_top","settings":{"specialized__title":"CHEMOTHERAPY AND HAIR LOSS","specialized__top_content":"<p>We've been honored to hear from thousands of real customers who have shared with us that our Hair Vitamins have helped them through their hair loss struggles.<br\/><br\/>People from around the world who've undergone Chemotherapy treatment in particular, have been kind enough to submit reviews and results highlighting their positive experiences with ST. TROPICA. We want to pay it forward by sharing with anyone & everyone who also may be undergoing Chemotherapy treatment and experiencing side effects such as hair loss.<br\/><br\/>Many of us may not know the side effects caused by Chemotherapy, or may have concerns over the possible symptoms you may experience if you're beginning Chemotherapy treatment; or may just be glad to find a resource focused specifically on Chemotherapy and it's most commonly related side effects. So let's dive into it.<\/p>","show__spe__review":true,"specialized__review_title":"hair growth vitamins that actually work!","specialized__review_name":"Susette A","specialized__review_img":"shopify:\/\/shop_images\/Susette_A.png","specialized__review_content":"These vitamins WORK! I started the 60 day challenge after finishing chemo, and my hair is coming in strong and fast. Not just on my head, but my brows are now practically filled in and my lashes are well on their way too. Thankful for these amazing, natural hair growth vitamins that actually work.","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"review__side":"order-0","animation":"none","css_class":"","custom_css":""}},"16557875706cbbdb2e":{"type":"specialized__survey_section","settings":{"affiliate_code":"ylhR9ufvDKJVe","width":"wide","padding_top":60,"padding_bottom":10,"padding_left":0,"padding_right":0,"review__side":"order-0","animation":"none","css_class":"","custom_css":""}},"1648640448df60772a":{"type":"specialized__what_is","settings":{"specialized__what_icon1":"shopify:\/\/shop_images\/Chemotherapy1.png","specialized__what_title":"WHAT IS CHEMOTHERAPY?","specialized__what_content":"<p>One of the main side effects experienced by those undergoing chemotherapy treatments is hair loss. While it is a common side effect, it can be a very difficult one to face and is often noted as the side effect feared most when beginning chemotherapy.<\/p><p>We understand that chemotherapy is a difficult process and that hair loss can cause additional stress and worry. We recommend sharing your worries and concerns with your health care team to prepare yourself for the possibility of hair loss and other symptoms.<\/p>","show__sym":true,"specialized__what_icon2":"shopify:\/\/shop_images\/Chemotherapy2.png","specialized__sym_title":"What are the side effects of chemotherapy?","specialized__sym_content":"<p>While different types of chemotherapy may have their own specific side effects, the most common side effects experienced by those undergoing chemotherapy treatments are:<\/p>\n<div class=\"readMore\">\n<ul class=\"ul-disc\">\n<li>Hair loss<\/li>\n<li>Anemia<\/li>\n<li>Appetite changes<\/li>\n<li>Fatigue and exhaustion<\/li>\n<\/ul>\n<\/div>\n<div class=\"row\">\n<div class=\"col-12\">\n<div class=\"accordion\" id=\"accordionExample\">\n<div class=\"accordion-item\">\n<h2 class=\"accordion-header\" id=\"chemoH1\">\n<button class=\"accordion-button collapsed\" type=\"button\" data-bs-toggle=\"collapse\" data-bs-target=\"#chemo1\" aria-expanded=\"\" aria-controls=\"chemo1\">\nSEE MORE SIDE EFFECTS OF CHEMOTHERAPY\n<\/button>\n<\/h2>\n<div id=\"chemo1\" class=\"accordion-collapse collapse\" aria-labelledby=\"chemoH1\" data-bs-parent=\"#accordionExample\">\n<div class=\"accordion-body\">\n<ul class=\"ul-disc\">\n<li>Nausea and vomiting<\/li>\n<li>Headaches<\/li>\n<li>Stomach Pain<\/li>\n<li>Numbness or tingling in the hands and feet<\/li>\n<li>Bruising<\/li>\n<li>Brain fogginess and difficulty concentrating (sometimes referred to as \"Chemo Brain\")<\/li>\n<li>Mood changes<\/li>\n<li>Weight changes<\/li>\n<li>Constipation or diarrhea<\/li>\n<\/ul>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n<\/div>","specialized__how_title":"HOW CAN ST. TROPICA HAIR VITAMINS HELP?","specialized__how_content":"<p>We are excited to share that we are constantly receiving incredibly positive feedback, in the form of 5 star photo reviews, from many of our valued customers who have undergone Chemotherapy; and who are experiencing tremendous results by using our one-of-a-kind Tru Bloom Hair Vitamins. All of the photos and reviews seen here are 100% genuine and authentic, and they are unedited, and unsolicited. In short, they are the real deal.<\/p><p>Tru Bloom Hair Growth Vitamins by ST. TROPICA are a different kind of Hair Vitamin. They include 100% or more of the DV (Daily Value) of all the essential hair nutrients, PLUS our Proprietary, highly researched, plant & fruit based HAIR SUPERFOOD formula. We have hand-selected only the best ingredients to create the world's best Hair Vitamins. Our 12 essential hair health ingredients (Vitamins, Protein & Minerals) + 7 exclusive Hair Superfoods help maximize Hair Growth, Strength and Thickness from the inside-out. They are also 100% Drug Free, and Allergen Free.<\/p><p>What’s more is that they come with an exclusive 100 DAY MONEY BACK GUARANTEE: Simply take our 60 Day Hair Challenge, and get Longer, Stronger Hair in 60 days flat, or your money back - where will we give you a full refund if you’re not delighted with your results. It's the Ultimate daily Hair Vitamin for extraordinary results, and we’ve made it a no-brainer by including our Ultimate Money-Back Guarantee, ensuring your total satisfaction.<\/p>","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"animation":"none","css_class":"","custom_css":""}},"1648645038b9435b55":{"type":"specialized__review_slide","blocks":{"1ac27d12-47db-493c-9bec-c6c691085b6e":{"type":"60day-challenge","settings":{"review__Count1":"true","ch_review_img":"shopify:\/\/shop_images\/Meg_K.png","title":"I highly recommend","heading":"Meg K","ch_review_content":"Taking one capsule a day and drinking tons of water sped up the growth as you can see in the after photo. I’m going to continue this challenge for 1 year! Follow my hair growth journey! I highly recommend this to anyone who has lost their hair through chemo and or wants their hair longer, stronger or thicker!","review__Count2":"true","ch_review_img2":"shopify:\/\/shop_images\/Kayla_R.png","title2":"This product is incredible!","heading2":"Kayla R","ch_review_content2":"I was a chemo patient and lost all of my hair. Once I finished chemo I started taking the hair vitamins and my hair has grown quite a bit and gotten so much thicker! Thicker than it was before my chemo!","review__Count3":"true","ch_review_img3":"shopify:\/\/shop_images\/Tara_B.png","title3":"Thank you!!","heading3":"Tara B","ch_review_content3":"My 60 day challenge after chemo!! Thank you!!! So excited to have hair again after chemo.","review__Count4":"true","ch_review_img4":"shopify:\/\/shop_images\/Megan_T.png","title4":"Hair growth after Chemotherapy","heading4":"Megan T","ch_review_content4":"My hair has grown back so quickly and thicker than before after chemotherapy. I am excited to see continued results!!"}},"564042e7-b68b-477d-8e67-82aa140b3c50":{"type":"60day-challenge","settings":{"review__Count1":"false","title":"","heading":"","ch_review_content":"","review__Count2":"false","title2":"","heading2":"","ch_review_content2":"","review__Count3":"true","ch_review_img3":"shopify:\/\/shop_images\/Gina_Josephs.png","title3":"It’s miraculous!!","heading3":"Gina J","ch_review_content3":"I took all types of vitamins to help my hair grow faster after I lost all my hair to chemo. The only vitamins that worked fantastically and made my hair grow three times faster was St Tropica! It’s miraculous!!","review__Count4":"true","ch_review_img4":"shopify:\/\/shop_images\/Leah_Jakubowski.png","title4":"I will never stop purchasing","heading4":"Leah J","ch_review_content4":"In 2018 I unfortunately went through a course of Chemotherapy. Though it was low dose and and I didn't lose all my hair, my hair did stop growing and became very damaged. I have been struggling to love my hair since. St. Tropica has brought my hair back to life. It has more shine and body than it ever has. I will never stop purchasing this life changing, simple to take suppliment!"}},"81e74978-8652-46bd-bae3-4660b6ddf5a7":{"type":"60day-challenge","settings":{"review__Count1":"true","ch_review_img":"shopify:\/\/shop_images\/Erin_R.png","title":"I'm So happy","heading":"Erin R","ch_review_content":"I started taking these vitamins after undergoing chemotherapy. I had been tracking my hair growth month to month and saw that my hair had only grown 1\/4 the month prior to starting St. Tropica. Feeling discouraged, I knew I needed to make a change. After taking these pills, I saw my hair growth jump to 3\/4 of an inch a month!! Going through a process of hair regrowth can feel like watching grass grow. However, with these pills I have definitely seen a significant change. These are going to be my go to vitamin as I continue my hair growth journey. I'm So happy with my results!","review__Count2":"true","ch_review_img2":"shopify:\/\/shop_images\/Peggy_K.png","title2":"Fabulous results!","heading2":"Peggy K","ch_review_content2":"Even if I did not have growth, the condition, strength, and over-all health of my hair makes this product worth every penny! However, I have growth, and thickening too!!! I could not be happier! Thank you for giving me back my hair!!! Now if only I could get my eyebrows to come back :) Please let me know if you have a product for that!!! I als use the oil treatments!! Ordering for a third time! First pic taken May 15, second and third taken July 27","review__Count3":"true","ch_review_img3":"shopify:\/\/shop_images\/Sheryl.png","title3":"I am a cancer survivor","heading3":"Sheryl","ch_review_content3":"The customer service with St. Tropica has been phenomenal. I am a cancer survivor, along with pushing 50 in November, and have struggled with hair loss enhanced by aging. I have taken the vitamins for 56 days, and didn't thing I had seen results until taking photos. My hair still seems to be shedding a lot, but it definitely is longer (I even cut a little of the thin ends off) and getting Thicker. Looking forward to seeing what next 60 days hold! Before photo is on the right.","review__Count4":"true","ch_review_img4":"shopify:\/\/shop_images\/Jennifer_B.png","title4":"my hair has grown 2 1\/2 inches","heading4":"Jennifer B","ch_review_content4":"I am 49 years old as of next week, I had ovarian cancer Twice and pre-cervical cancer as well. The doctors had to remove my left ovary and both tubes for years ago I am two years ago I had to remove my right ovary along with the other female parts, I no longer have any hormones therefore my hair has went downhill along with my nails in my body in general. I have tried so many vitamins so many shampoos and nothing worked until I purchased these vitamins. I’m on my second month of taking these and have another order of two more months coming before when I would shower handfuls of hair will be coming out in the drain now one strand of hair if even that Comes out when I shower along with my nails are finally growing. I think the ones that invented this and now my hair has grown almost 2 1\/2 inches within a month and a half."}},"5ef14c0b-e411-4afa-a85d-c641e77fd091":{"type":"60day-challenge","settings":{"review__Count1":"true","ch_review_img":"shopify:\/\/shop_images\/Dana_S.png","title":"I love it!","heading":"Dana S","ch_review_content":"I really did the challenge as I thought a way I will see hair growth!I used a bunch of other growthcapsules and nothing worked. This is the real deal! Glad to took the chance and bought your product! Covid-19 has my hair growth not colored too! Highlights coming soon. Salons opened last week, but they are booked way in advance. Oh! I am also going through radiation and cancer treatments so my immune system is low. My hair still grew!!! Woot! Woot!","review__Count2":"true","ch_review_img2":"shopify:\/\/shop_images\/Lucy_D.png","title2":"Great! I think these really work!","heading2":"Lucy D","ch_review_content2":"I had thinning hair due to chemo. After two months taking these vitamins I've definitely noticed a big difference. It feels great to see my hair coming back!","review__Count3":"true","ch_review_img3":"shopify:\/\/shop_images\/Adrienne_S.png","title3":"regained my confidence","heading3":"Adrienne S","ch_review_content3":"Can’t say enough good things about this product. I am a cancer survivor and St Tropica has helped me regain my confidence in my appearance after just 60 days!!","review__Count4":"true","ch_review_img4":"shopify:\/\/shop_images\/Michelle_A.png","title4":"I'm very happy","heading4":"Michelle A","ch_review_content4":"I'm very happy with how my hair has grown! I'm a cancer survivor that under went chemo. I'm very happy with how fast my hair grew, as I'm trying to grow it out long again."}},"3e188679-f4c9-44ae-bc83-416626259b93":{"type":"60day-challenge","settings":{"review__Count1":"true","ch_review_img":"shopify:\/\/shop_images\/Lynette_K.png","title":"my hair is nice and thick","heading":"Lynette K","ch_review_content":"I went through chemo this past year and my hair was slowly growing back but it wasn't as thick as I should have been and thin in places. Within the first few week you could tell a difference. Hair was definitely thicker. Now that I have finished the 2 months my hair is nice and thick and longer. I even bought some for my mom.","review__Count2":"true","ch_review_img2":"shopify:\/\/shop_images\/Nancy_W.png","title2":"I am a chemotherapy patient","heading2":"Nancy W","ch_review_content2":"This have been the best thing I have ever tried. I have tried all kinds of things spending all this money until now best thing I have ever done thank you for your product best thing ever","review__Count3":"true","ch_review_img3":"shopify:\/\/shop_images\/Susie_E.png","title3":"after 60 days I am amazed!","heading3":"Susie E","ch_review_content3":"I was very skeptical but desperate. My hair was so thin even 6 years after chemo. Then I got COVID and even more came out. Bought wigs which looked awful. Saw this add and after 60 days I am amazed! Different color hair and definitely more of it.","review__Count4":"true","ch_review_img4":"shopify:\/\/shop_images\/Tara_F.png","title4":"my hair to grow back from chemo","heading4":"Tara F","ch_review_content4":"I have been taking St Tropica for approximately 2 months. I was skeptical since I was told it will take a while for my hair to grow back from chemo. I have nothing but praise for this product. Thank you"}},"5277100a-17aa-49d8-a33a-56555d04b3cd":{"type":"60day-challenge","settings":{"review__Count1":"true","ch_review_img":"shopify:\/\/shop_images\/Gayle_S.png","title":"I recommend your product. Highly!!","heading":"Gayle S","ch_review_content":"I recently came through chemotherapy. I used the cold-cap therapy, but still lost a large amount of hair. After reading the ingredients of your Tru Bloom Hair Growth Vitamins, I decided to give them a try in hopes of restoring my hair. I'm happy with the results in just two months. I recommend your product. Highly!! Thank you.","review__Count2":"true","ch_review_img2":"shopify:\/\/shop_images\/Margie_T.png","title2":"I fell like it has been improving","heading2":"Margie T","ch_review_content2":"I'm stage 4 breast cancer patient with ongoing treatments since Dec. 2014. Since treatments I have lost all my hair. It started growing back when I finished with radiation and the harshest chemo but has been very thin. I fell like it has been improving since I started the St. TROPICA CAPSULES.","review__Count3":"true","ch_review_img3":"shopify:\/\/shop_images\/Anna_S.png","title3":"I’m impressed","heading3":"Anna S","ch_review_content3":"I have to admit - I was a skeptic- but I have taken these for 60 days and HOLY COW my hair grew! I am impressed! My hair was a “stacked Bob” upon day one of taking the pills - no where near my neck! NOW it’s almost touching my back and I need a trim (just to shape my hair nicer but I’m continuing to grow it) At one point I was bald from chemo! Never grew my hair out after chemo until this last year. It’s been a VERYYYYY SLOWWW process - UNTIL ST. TROPICA STEPPED IN! I can now gather my hair in a little pony tail and\/or two little pig tails in the back. When I was at day one, there was NO WAY I could do anything with my hair! It’s hard to tell on the side view Picts but I promise it’s grown a lot! Day one: my hair was JUST starting to hit my jaw line - now it’s passed my jaw line and almost grazing my trapezius muscle!! I’m impressed and def want to continue taking these!! I didn’t measure but I’m pretty certain my hair grew about 2-2.5” at very least, in 60 days! NEVER SINCE CHEMO has my hair grown this fast and been so healthy. CRAZY!! I even think my eyebrows got a little thicker!! 🙂🙂🙂 Time for a trim and some color 😁😁 THANK YOU ST. TROPICA!!","review__Count4":"true","ch_review_img4":"shopify:\/\/shop_images\/Deborah_J.png","title4":"It is truly unbelievable","heading4":"Deborah J","ch_review_content4":"I did the 60 day challenge and sent my before and after photos but have not received my free 30 day supply I went ahead and ordered another 60 day supply because these vitamins are the best thing I’ve ever tried and I’ll probably keep ordering them the rest of my life I had chemo from breast cancer and lost so much hair even after it grew back it was extremely thin It is truly unbelievable Thank you."}}},"block_order":["1ac27d12-47db-493c-9bec-c6c691085b6e","564042e7-b68b-477d-8e67-82aa140b3c50","81e74978-8652-46bd-bae3-4660b6ddf5a7","5ef14c0b-e411-4afa-a85d-c641e77fd091","3e188679-f4c9-44ae-bc83-416626259b93","5277100a-17aa-49d8-a33a-56555d04b3cd"],"settings":{"specialized__review_title":"REAL PEOPLE WITH REAL RESULTS","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"animation":"none","css_class":"","css_id":"","custom_css":""}},"164864287453c7f8d9":{"type":"index__featured-product","blocks":{"164864287420959887-0":{"type":"title","settings":{}},"164864287420959887-1":{"type":"price","settings":{"display_savings":true}},"164864287420959887-3":{"type":"form","settings":{"show_payment_button":true}}},"block_order":["164864287420959887-0","164864287420959887-1","164864287420959887-3"],"settings":{"affiliate_code":"ylhR9ufvDKJVe","featured_product":"st-tropica-hair-vitamins-hair-challenge-2-month-supply","product_images_position":"left","set_product_height":false,"product_height":500,"video_looping":false,"gallery_arrows":true,"enable_zoom":true,"enable_product_lightbox":true,"slideshow_speed":0,"slideshow_transition":"slide","display_thumbnails":true,"thumbnail_position":"left-thumbnails","enable_thumbnail_slider":true,"width":"wide","padding_top":60,"padding_bottom":0,"animation":"none","css_class":"","custom_css":".product-gallery__main, .product-gallery__thumbnails.is-slide-nav--true {\n    opacity: 1;\n}"}},"164864161709cc9c7d":{"type":"specialized__page_faqs","blocks":{"0203fa69-89fe-4723-80c5-d472660d4308":{"type":"specialized__faqs","settings":{"heading":"WHY DOES CHEMOTHERAPY CAUSE HAIR LOSS?","specialized__faqs_ans":"<p>Chemotherapy drugs attack fast growing cancer cells and while they are effective in attacking these cells, they also tend to attack other fast growing cells in the body. This means that cells that grow quickly and consistently, like hair cells, end up also being attacked by the chemotherapy drugs.<\/p> <p>Unfortunately, at this time, chemotherapy drugs are not sophisticated enough to be able to differentiate the healthy fast growing cells from the unhealthy ones and so all the cells that grow rapidly within the body are affected by this drug. This is why hair loss is experienced during chemotherapy treatments.<\/p> <p>Chemotherapy is often associated with hair loss on the head, however hair loss may be experienced all over the body. Some people do report they lose their eyebrows, armpit hair, and more. This can depend on the type of chemotherapy drug being used as well as the dosage.<\/p> <p>It is important to speak to your medical team about the type of chemotherapy drug you will be taking so that you can best gauge what to expect for overall symptoms and hair loss.<\/p> <p>The important thing to remember is that most often hair loss due to chemotherapy is temporary and you will likely find your hair growth resumes 3-6 months after your treatment plan is completed.<\/p>","faqs__expand":"true"}},"bd5f9d02-e661-4ba8-95b8-9660880879f3":{"type":"specialized__faqs","settings":{"heading":"WHEN WILL I BEGIN TO SEE HAIR LOSS FROM CHEMOTHERAPY TREATMENTS?","specialized__faqs_ans":"<p>Typically, those undergoing chemotherapy treatments will find their hair loss begins after 3-4 weeks. The hair loss may be gradual or may come in clumps depending on the type of chemotherapy drug and dosage a person is on.<\/p>\n<p>You may notice hair loss specifically on your pillow after sleeping, in the shower when washing your hair, and on your brush when brushing or combing your hair.<\/p>\n<p>You may experience hair loss through your entire treatment and it may continue for a few weeks after your treatment plan is completed.<\/p>","faqs__expand":"false"}},"717d41c1-49ff-484d-8a98-ce1e72c4f8c3":{"type":"specialized__faqs","settings":{"heading":"HOW LONG WILL IT TAKE TO GROW HAIR BACK?","specialized__faqs_ans":"<p>Hair will begin to grow back several weeks after the treatment is completed. Initially you may find that your hair texture is slightly different but this typically is just temporary.<\/p>\n<p>One of the changes that is often found initially is that the new hair growth is grey however this is often temporary and hair color typically returns to normal as the cell that control pigmentation recovers.<\/p>\n<p>Occasionally, the new growth may have a new texture or color permanently though. You may find your once curly hair is now straighter, or vice versa.<\/p>","faqs__expand":"false"}},"29810152-af06-4254-af7f-8d9a993421a0":{"type":"specialized__faqs","settings":{"heading":"IS HAIR LOSS FROM CHEMOTHERAPY PREVENTABLE?","specialized__faqs_ans":"<p>Unfortunately, there is no set preventable treatment option for hair loss caused by chemotherapy. However, there are care methods you can implement to encourage hair growth and prevent some hair loss, these methods include:<\/p>\n<p><b>BE GENTLE WITH YOUR HAIR<\/b><\/p>\n<p>Avoid using heat tools or styling your hair in tight hairstyles such as braids, ponytails, and buns. These hair treatments can tug on the hair root and cause hair loss.<\/p>\n<p><b>USE COOLING SCALP CAPS<\/b><\/p>\n<p>Cooling caps have been shown to have some success with preventing some hair loss as they cool the scalp and slow blood flow to the area. This means that the chemotherapy drugs will not flow to the scalp as easily and therefore should not have as strong of an affect on the scalp.<\/p>","faqs__expand":"false"}},"c5b7bdf9-35b5-47e5-85e2-1d6a3297d534":{"type":"specialized__faqs","settings":{"heading":"AFTER MY CHEMOTHERAPY TREATMENT IS COMPLETE, HOW CAN I ENCOURAGE HAIR GROWTH?","specialized__faqs_ans":"<p>Once you have completed your chemotherapy treatment plan, you can begin to implement other lifestyle changes to help grow your hair back. Here are a few lifestyle changes you could incorporate:<\/p>\n<p><b>BE GENTLE WITH YOUR HAIR<\/b><\/p>\n<p>Once you're done with your chemotherapy treatments, continue being gentle and careful with your hair. Continue avoiding heat tools, damaging hair treatments, and hairstyles that tug on the root of your hair. The kinds of treatments and hairstyles can pull or damage the hair which can cause hair loss or hair breakage.<\/p>\n<p><b>REDUCE LIFESTYLE STRESSORS<\/b><\/p>\n<p>Stress can impact the hair growth cycle. For this reason, it's important to reduce stress sources in your life and incorporate techniques and strategies that help you relax. For example, we recommend doing meditation or yoga to help manage stress. In addition, it's important to allow your body to have enough sleep and rest so it may function at its best.<\/p>\n<p><b>USE HOT OIL TREATMENTS<\/b><\/p>\n<p>We recommend using the <a href=\"\/products\/st-tropica-beach-goddess-hot-oil-hair-mask\" data-uw-rm-brl=\"false\">ST.TROPICA Beach Goddess Hot Oil Hair Treatment<\/a> once a week or once every two weeks to help nourish the scalp, encourage hair growth, and strengthen your hair.<\/p>\n<p>To enhance your treatment, you can gently massage the hot oil treatment onto the scalp. This will stimulate blood flow to the scalp which encourages new hair growth.<\/p>\n<p><b>TAKE A HAIR GROWTH VITAMIN<\/b><\/p>\n<p>Hair growth vitamins help support new hair growth and faster hair growth. They contain everything that the body needs to grow healthier hair. We recommend taking 1 <a href=\"\/products\/st-tropica-hair-vitamins-hair-challenge-2-month-supply\" data-uw-rm-brl=\"false\">Tru Bloom Hair Growth Vitamin<\/a> a day to encourage your hair to grow.<\/p>","faqs__expand":"false"}},"b6659f6b-38de-43ce-9488-513271ff629c":{"type":"specialized__faqs","settings":{"heading":"CAN HAIR VITAMINS HELP GROW MY HAIR AFTER CHEMOTHERAPY TREATMENTS?","specialized__faqs_ans":"<p>Yes! Supplementing with the right Vitamins can absolutely help.<\/p>\n<p>Our celebrated <a href=\"https:\/\/www.sttropica.com\/collections\/st-tropica-collection\/products\/st-tropica-hair-vitamins-hair-challenge-2-month-supply\" target=\"_blank\" title=\"Tru Bloom Hair Growth Vitamins\" rel=\"noopener noreferrer\">ST. TROPICA Hair Vitamins<\/a> have already helped many people suffering from Chemotherapy related hair loss. Once again, all of the photos and reviews seen here are from our very own customers. They are 100% genuine and authentic, unedited, and unsolicited. They are from REAL people, with REAL results.<\/p>\n<p><a href=\"https:\/\/www.sttropica.com\/collections\/st-tropica-collection\/products\/st-tropica-hair-vitamins-hair-challenge-2-month-supply\" target=\"_blank\" title=\"Tru Bloom Hair Growth Vitamins\" rel=\"noopener noreferrer\">ST. TROPICA Hair Growth Vitamins<\/a> are a different kind of Hair Vitamin. They include 100% or more of the DV (Daily Value) of all the essential hair nutrients, PLUS our Proprietary, highly researched, plant &amp; fruit based HAIR SUPERFOOD formula. We have hand-selected only the best ingredients to create the world's best Hair Vitamins. Our 12 essential hair health ingredients (Vitamins, Protein &amp; Minerals) + 7 exclusive Hair Superfoods help maximize Hair Growth, Strength, and Thickness from the inside out. <\/p>\n<p>The Tru Bloom Hair Growth Vitamins are also 100% Drug-Free and Allergen Free. This means that they free of all 8 allergens for Nutritional Supplements, which are wheat, soy, peanuts, dairy, tree nuts, crustaceans, fish, and eggs!<\/p>\n<p>What’s more is that they come with our exclusive 100 DAY MONEY BACK GUARANTEE: Simply take our 60 Day Hair Challenge, and get Longer, Stronger Hair in 60 days flat, or your money back - where will we give you a full refund if you’re not delighted with your results. It's the Ultimate daily Hair Vitamin for extraordinary results, and we’ve made it a no-brainer by including our Ultimate Money-Back Guarantee, ensuring your total satisfaction.<\/p>","faqs__expand":"false"}}},"block_order":["0203fa69-89fe-4723-80c5-d472660d4308","bd5f9d02-e661-4ba8-95b8-9660880879f3","717d41c1-49ff-484d-8a98-ce1e72c4f8c3","29810152-af06-4254-af7f-8d9a993421a0","c5b7bdf9-35b5-47e5-85e2-1d6a3297d534","b6659f6b-38de-43ce-9488-513271ff629c"],"settings":{"affiliate_code":"ylhR9ufvDKJVe","specialized__faqs_title":"CHEMOTHERAPY FAQ","show__spe__review":true,"specialized__review_title":"Fabulous!!!","specialized__review_name":"Tiffany T","specialized__review_img":"shopify:\/\/shop_images\/Tiffany_T.png","specialized__review_content":"It was great!! I started taking this when my hair started growing back after chemo and it worked wonderfully!! I’m about to order more!!","width":"wide","padding_top":60,"padding_bottom":20,"padding_left":0,"padding_right":0,"review__side":"order-0","animation":"none","css_class":"","css_id":"review2","custom_css":".trubloom_review_bg{\n    background-image: url(https:\/\/cdn.shopify.com\/s\/files\/1\/0818\/8965\/t\/96\/assets\/trubloom_review_bg_1.png?v=1648728108);\n    background-size: cover;\n}\n.trubloom_review_bg .purchase-details__buttons .action_button.action_button--secondary {\n    border: 1px solid #ff9ac6;\n    color: #ffffff;\n    background: #ff9ac6;\n}"}},"1649999217f5c8b396":{"type":"custom-liquid","settings":{"custom_liquid":"<div id=\"stamped-main-widget\" class=\"mx-0 mb-0\" data-keyword=\"chemo\"><\/div>\n<a href=\"https:\/\/www.sttropica.com\/products\/st-tropica-hair-vitamins-hair-challenge-2-month-supply?ref=ylhR9ufvDKJVe\" class=\"button mx-auto\">Order Now<\/a>\n<style>\ndiv.stamped-container[data-widget-style], div[data-widget-style] div.stamped-container {\n    margin: 0px auto!important;\n}\n<\/style>"}}},"order":["164872987662732b2c","1654682937e9784b78","16486356205a406201","16557875706cbbdb2e","1648640448df60772a","1648645038b9435b55","164864287453c7f8d9","164864161709cc9c7d","1649999217f5c8b396"]}