{"sections":{"164872987662732b2c":{"type":"specialized__page_header","settings":{"spl_text":"WIDELY REGARDED AS THE BEST HAIR GROWTH VITAMINS For ALOPECIA","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"animation":"none","css_class":"","custom_css":".special-head{\n    background-image: url({{ 'trubloom_review_bg.png' | asset_url }});\n    background-size: cover;\n}\n.home-slide-content p {\n    color: #727272;\n    font-size: 18px;\n}\n.home-slide-content h2 {\n    color: #ff9ac6;\n    font-size: 26px;\n}"}},"16486356205a406201":{"type":"specialized__page_top","settings":{"specialized__title":"ALOPECIA AND HAIR LOSS","specialized__top_content":"<p>We've been honored to hear from thousands of real customers that our Hair Vitamins have helped them through their hair loss struggles.<br\/><br\/>People from around the world who've suffered from Alopecia in particular, have been kind enough to submit reviews and results highlighting their positive experiences with ST. TROPICA. And we want to pay it forward by sharing with anyone & everyone who also may be dealing with Alopecia.<br\/><br\/>Many of us may not know what Alopecia is, and may have concerns over being undiagnosed; or just happy to find a resource focused specifically on Alopecia and hair loss. So let's dive into it.<\/p>","specialized__review_title":"Helped my Alopecia Areata","specialized__review_name":"Shamael A","specialized__review_img":"shopify:\/\/shop_images\/Shamael_A.png","specialized__review_content":"I purchased my St. Tropica vitamins after discovering a bald spot that led you the diagnosis of Alopecia Areata. Of course I was devastated but determined to grow my hair. These vitamins did the trick. After 2 months of use along with TLC, my hair started to sprout. I am so grateful for these amazing vitamins and will be ordering more.","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"review__side":"order-0","animation":"none","css_class":"","custom_css":""}},"165595945233e6b2ce":{"type":"specialized__survey_section","settings":{"affiliate_code":"Alopecia","width":"wide","padding_top":70,"padding_bottom":20,"padding_left":0,"padding_right":0,"review__side":"order-0","animation":"none","css_class":"","custom_css":""}},"1648640448df60772a":{"type":"specialized__what_is","settings":{"specialized__what_icon1":"shopify:\/\/shop_images\/Alopecia1_ccbff632-a5fc-48aa-978c-27698e8a97be.png","specialized__what_title":"WHAT IS  ALOPECIA AREATA?","specialized__what_content":"<p>Alopecia Areata is a condition that is known to cause hair loss and thinning. It typically begins to form in small patches around the scalp.<br\/><br\/>These small patches are often not noticeable, however if the condition develops further and the patches connect then the balding areas will become more apparent.<\/p>","show__sym":true,"specialized__what_icon2":"shopify:\/\/shop_images\/Alopecia2.png","specialized__sym_title":"ALOPECIA SYMPTOMS","specialized__sym_content":"<ul class=\"ul-disc\">\n<li>Thinning on the top of the head<\/li>\n<li>Noticing excessive hair shedding<\/li>\n<li>Bald spots on head<\/li>\n<li>Brittle and thin nails<\/li>\n<\/ul>","specialized__how_title":"HOW CAN ST. TROPICA HAIR VITAMINS HELP?","specialized__how_content":"<p>We are excited to share that we are constantly receiving incredibly positive feedback, in the form of 5 star photo reviews, from many of our valued customers who are struggling with Alopecia symptoms; and who are experiencing tremendous results by using our one-of-a-kind Tru Bloom Hair Vitamins. All of the photos and reviews seen here are 100% genuine and authentic, and they are unedited, and unsolicited. In short, they are the real deal.<br\/><br\/>Tru Bloom Hair Growth Vitamins by ST. TROPICA are a different kind of Hair Vitamin. They include 100% or more of the DV (Daily Value) of all the essential hair nutrients, PLUS our Proprietary, highly researched, plant & fruit based HAIR SUPERFOOD formula. We have hand-selected only the best ingredients to create the world's best Hair Vitamins. Our 12 essential hair health ingredients (Vitamins, Protein & Minerals) + 7 exclusive Hair Superfoods help maximize Hair Growth, Strength and Thickness from the inside-out. They are also 100% Drug Free, and Allergen Free.<br\/><br\/>What’s more is that they come with an exclusive 100 DAY MONEY BACK GUARANTEE: Simply take our 60 Day Hair Challenge, and get Longer, Stronger Hair in 60 days flat, or your money back - where will we give you a full refund if you’re not delighted with your results. It's the Ultimate daily Hair Vitamin for extraordinary results, and we’ve made it a no-brainer by including our Ultimate Money-Back Guarantee, ensuring your total satisfaction.<\/p>","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"animation":"none","css_class":"","custom_css":""}},"1648645038b9435b55":{"type":"specialized__review_slide","blocks":{"f5117302-4bff-4ebb-a173-9f3c17b5d1e5":{"type":"60day-challenge","settings":{"review__Count1":"true","ch_review_img":"shopify:\/\/shop_images\/Irene_H.png","title":"grown my overall hair length","heading":"Irene H","ch_review_content":"Amazing!! I have suffered with alopecia areata for the past 25 years and I recently started thinning at my front hair line and taking this for the past 60 days has not only grown my overall hair length but also has thickened in the areas that truly needed the help. Thank you St TROPICA!","review__Count2":"true","ch_review_img2":"shopify:\/\/shop_images\/wf.png","title2":"90 days in…","heading2":"W F","ch_review_content2":"I continue to see and feel\nImprovement in my hair fullness and density. I have (diagnosed) frontal alopecia, so to preserve and add hair growth is stellar!!!!","review__Count3":"true","ch_review_img3":"shopify:\/\/shop_images\/Maritza.png","title3":"No more bald spots","heading3":"Maritza","ch_review_content3":"Im really skeptical when buying products on line. I decided to give St.Tropica a try. I suffered from alopecia. Now I’m really happy to see my results. No more bald spot. I’m definitely going to continue using this product. I would definitely recommend it. You won’t regret!!!","review__Count4":"true","ch_review_img4":"shopify:\/\/shop_images\/Lesle.png","title4":"AMAZED with the results","heading4":"Lesle P","ch_review_content4":"I wanted to share that my 15 year old daughter and I decided to try your product “together” after she was diagnosed with alopecia which came out of nowhere. She was seen by several physicians with no solutions. I saw your ads on social media and decided to try it. We are AMAZED with the results and will be making another purchase soon. I’m attaching a picture of her progress with her alopecia. My hair has also grown but my joy and happiness with this product is seeing how my daughter is so much happier. My results are just as amazing. ️ (My daughter’s before and after. Before is top. And we we have approximately 10 more days left before we finish our first bottles."}},"f5117302-4bff-4ebb-a173-9f3c19b5c1e9":{"type":"60day-challenge","settings":{"review__Count1":"false","title":"","heading":"","ch_review_content":"","review__Count2":"true","ch_review_img2":"shopify:\/\/shop_images\/image_1_1_5bae37fc-1c41-42a2-8787-69ef2efbdc22.png","title2":"I SUFFER FROM A FORM OF ALOPECIA","heading2":"Ali B","ch_review_content2":"100% recommend! I suffer from a form of Alopecia where my hair has not grown since I was 15 years old not even a little, it also has always felt to the touch kind of unhealthy. My hair necessarily did not grow a whole lot but it did grow and this was the first thing to make my hair grow in years of trying! It feels absolutely amazing, it is voluminous, soft, full and healthy!","review__Count3":"true","ch_review_img3":"shopify:\/\/shop_images\/Cat_B.png","title3":"My hair grew about an inch","heading3":"Cat B","ch_review_content3":"What impressed me the most about these pills was the amount of baby hairs I had seen coming in. I suffer from alopecia areata and I had many bald spots. My hair grew about an inch and a half but again what was more impressing was the hair growth coming from the temple region as well as where I had the bald spots. I have fine hair so I’ll take any hair growth that I can get and these did that for me. Now I have to see what I can do to tame all my baby hairs lol.","review__Count4":"false","title4":"","heading4":"","ch_review_content4":""}},"bf37c433-1efb-43ec-86f0-121589f5b806":{"type":"60day-challenge","settings":{"review__Count1":"true","ch_review_img":"shopify:\/\/shop_images\/Tammy_J.png","title":"lot of hair growing and filling","heading":"Tammy J","ch_review_content":"I purchased the St Tropica hair growth vitamins as I wanted to see if they would help counteract my hair loss. I had a lot of hair loss about 15 years ago and have had an alopecia areota spot for 30 years. I've tried many products for both issues including having a dermatologist do many tests and cortisol shots. All to no result. Since taking these vitamins I have had a very large increase in the volume of my hair. I can feel the added hairs when I run my fingers through my hair. Before the vitamins my alopecia spot had the typical thin, blond hairs that do not cover the surface of the scalp. Now, after 30 years, I actually have fine dark brown hairs growing and beginning to fill in the spot. I also have a lot of hair growing and filling in my hairline. It looks like I have a bunch of broken strands, but it is an amazing amount of new hairs growing where there has been none for at least 10 years. Friends are noticing that my hair is beginning to look like it did before so much of it fell out 15 years ago. Amazing product that I will continue to use and recommend to friends and strangers who have also lost hair.","review__Count2":"true","ch_review_img2":"shopify:\/\/shop_images\/Betty_I.png","title2":"Success Story!","heading2":"Betty I","ch_review_content2":"Hereditary Female Hair Loss - Success Story! So glad I took the challenge... & I have no plans on stopping now! I have personally not had a ton of length growth but I have a million baby hairs coming in & my thinnest area has really improved! No hype! Be consistent - it’s worth it!!! I love the product!!! Highly recommend. I’ve done the special Shampoos & Rogaine for years - this is like a miracle for me. I’ve been dupped by products on IG & this is not a scam!","review__Count3":"true","ch_review_img3":"shopify:\/\/shop_images\/Helen_W.png","title3":"the general health of my hair","heading3":"Helen W","ch_review_content3":"Overall experience has been very good. My hair feels terrific and fries fast and is super healthy. I have androgenetic alopecia and I don't think it's done much for that but I will continue talking because I think it does help with the general health of my hair.","review__Count4":"true","ch_review_img4":"shopify:\/\/shop_images\/Randy_71500285-4b72-4d19-add8-604134a4f658.png","title4":"noticed a difference on day 14","heading4":"Randy H","ch_review_content4":"I love that these are only 1 pill, once a day. Very easy to take. I have androgenetic alopecia which is embarrassing. I am not showing the top of my head because I don't believe these made a difference there at all. And my hair is still falling the same amount. It may take more than 2 months for those to grow back in, if they are going to. But as for length, yes. I actually noticed a difference on day 14. Sent a picture to my sister to see if she thought so too and she did. Over all I think these pills are great and I will continue taking them for atleast 2 more months. If I notice any new hair growth on top then I will write another review. They also sent me the hair mask which I didnt use until today and I wasn't a fan. I dont really like coconut oil, and any oil on my hair makes it super greasy even after washing it 3 times. So I will pass on that but the vitamins get a thumbs up!"}},"b6c78718-5281-4e83-a789-174bf272dbdb":{"type":"60day-challenge","settings":{"review__Count1":"true","ch_review_img":"shopify:\/\/shop_images\/Susie_81f57d62-0c8d-422a-b985-62f4831ab9d4.png","title":"I’m battling Alopecia areta.","heading":"Susie C","ch_review_content":"I’m still thankful that I only have one bald spot on my right side. Maybe this vitamin is helping after all. I’m battling Alopecia areta.","review__Count2":"true","ch_review_img2":"shopify:\/\/shop_images\/Nancy-R_70728e34-e07d-49aa-a6b7-96c44ff35f29.png","title2":"stay and get thick again!","heading2":"Nancy R","ch_review_content2":"I have taken St. Tropica for a few months now and all my bald spots are completely gone! I had bad alopecia from extreme stress and I was desperate to find something, anything to help get rid of my bald spots. After several months of taking St.Tropica my bald spots are completely gone. The hair texture coming from the bald spots is finer than my regular hair texture therefore I will continue St. Tropica in hopes that my full head of hair will stay and get thick again! Thank you so very much!","review__Count3":"true","ch_review_img3":"shopify:\/\/shop_images\/Nancy-L_cbdee32b-98d1-4cda-b737-50f9ddb799c3.png","title3":"I’ve recommended this to my family","heading3":"Nancy L","ch_review_content3":"My experience was great, this definitely works, I’ve seen growth and healthier hair like never before. I’ve recommended this to my family who suffers from alopecia or just for healthier hair. Thank you St.Tropica","review__Count4":"true","ch_review_img4":"shopify:\/\/shop_images\/Joette_5d5a181d-7c47-47bd-8344-664baa2faa05.png","title4":"my hair is thicker than before","heading4":"Joette B","ch_review_content4":"I am very glad that I decided to try these pills because I was suffering from alopecia I had ball spots I took these pills for five months and I now I have no balls but my hair is thicker than it has ever been in my edges are growing out of control"}},"d8a5c7d1-8ba7-45f2-95be-baf7ae3c754e":{"type":"60day-challenge","settings":{"review__Count1":"true","ch_review_img":"shopify:\/\/shop_images\/Cathy.png","title":"preventing more hair loss","heading":"Cathy B","ch_review_content":"I did the challenge with my mom. I am 40 y\/o and she is 66 y\/o. Unfortunately, like her I’m experiencing a male pattern hair loss. We were excited to try St. Tropica. After 2 months of taking it, there was no noticeable thickness, but I guess it’s preventing more hair loss. I don’t see much hair on the comb when I brush my hair. I have also noticed that our toenails look better, so it is doing something. We will continue taking it to see if there will be more noticeable results with long term use. Thank you.","review__Count2":"true","ch_review_img2":"shopify:\/\/shop_images\/Raya_L.png","title2":"I will continue to use","heading2":"Raya L","ch_review_content2":"I suffer from alopecia, so I was looking for something to possibly help with bald patches and thinning hair. So I decided to do the 60 day challenge!! I must say that this has exceeded my expectations! I will continue to use this product!!!!","review__Count3":"true","ch_review_img3":"shopify:\/\/shop_images\/Gina_Stephenson_1196c71c-d1d3-40ed-be60-68f21d63beda.png","title3":"MY HAIR IS GROWING AND BECOMING HEALTHIER!","heading3":"Gina S","ch_review_content3":"I am definitely impressed by this supplement! I have struggled recently with Alopecia, and I have seen a difference in my hair since using it. My hair is growing and becoming healthier!","review__Count4":"true","ch_review_img4":"shopify:\/\/shop_images\/Sherry_Chaples.png","title4":"get some new growth","heading4":"Sherry C","ch_review_content4":"I have androgenic Alopecia. Having hair grow back is very difficult if not impossible. With St. Tropica I have been able to get some new growth."}}},"block_order":["f5117302-4bff-4ebb-a173-9f3c17b5d1e5","f5117302-4bff-4ebb-a173-9f3c19b5c1e9","bf37c433-1efb-43ec-86f0-121589f5b806","b6c78718-5281-4e83-a789-174bf272dbdb","d8a5c7d1-8ba7-45f2-95be-baf7ae3c754e"],"settings":{"specialized__review_title":"REAL PEOPLE WITH REAL RESULTS","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"animation":"none","css_class":"","css_id":"","custom_css":""}},"164864287453c7f8d9":{"type":"index__featured-product","blocks":{"164864287420959887-0":{"type":"title","settings":{}},"164864287420959887-1":{"type":"price","settings":{"display_savings":true}},"164864287420959887-3":{"type":"form","settings":{"show_payment_button":true}}},"block_order":["164864287420959887-0","164864287420959887-1","164864287420959887-3"],"settings":{"affiliate_code":"Alopecia","featured_product":"st-tropica-hair-vitamins-hair-challenge-2-month-supply","product_images_position":"left","set_product_height":false,"product_height":500,"video_looping":false,"gallery_arrows":true,"enable_zoom":true,"enable_product_lightbox":true,"slideshow_speed":0,"slideshow_transition":"slide","display_thumbnails":true,"thumbnail_position":"left-thumbnails","enable_thumbnail_slider":true,"width":"wide","padding_top":60,"padding_bottom":0,"animation":"none","css_class":"","custom_css":".product-gallery__main, .product-gallery__thumbnails.is-slide-nav--true {\n    opacity: 1;\n}"}},"164864161709cc9c7d":{"type":"specialized__page_faqs","blocks":{"ca66ed0c-3d8b-4355-82b4-9bd8bff308ba":{"type":"specialized__faqs","settings":{"heading":"WHERE CAN HAIR LOSS OCCUR WITH ALOPECIA AREATA?","specialized__faqs_ans":"While it most often is noticed on the scalp, it can also thin the hair on the eyebrows, eyelashes, and other parts of the body.","faqs__expand":"true"}},"bc777fe7-1203-4eaa-a8e2-fab03ba1238d":{"type":"specialized__faqs","settings":{"heading":"WHAT CAUSES ALOPECIA AREATA?","specialized__faqs_ans":"<p>Alopecia Areata occurs when the immune system attacks\/damaged the hair follicles causing hair loss.<\/p>\n\n<p>Most often, this is an idiopathic autoimmune disease which means modern medicine does not know the exact cause of it. However, Alopecia can be hereditary, due to aging, a side-effect of certain drugs and medications, due to pulling or damaging hair styles and treatments, or a result of radiation on the head.<\/p>","faqs__expand":"false"}},"885d8578-14dc-493c-9823-466358130167":{"type":"specialized__faqs","settings":{"heading":"WHAT ARE THE SYMPTOMS OF ALOPECIA?","specialized__faqs_ans":"<ul class=\"ul-disc\"> <li>Thinning on the top of the head<\/li> <li>Noticing excessive hair shedding<\/li> <li>Bald spots on head<\/li> <li>Brittle and thin nails<\/li>\n<\/ul>","faqs__expand":"false"}},"b67a8edb-9766-48d9-8552-f9e71840ec5d":{"type":"specialized__faqs","settings":{"heading":"CONDITIONS OCCASIONALLY ASSOCIATED WITH ALEOPCIA AREATA:","specialized__faqs_ans":"<ul class=\"ul-disc\"> <li>Lupus<\/li> <li>Hypothyroidism<\/li> <li>Rheumatoid Arthritis<\/li> <li>Ulcerative Colitis<\/li>\n<\/ul>","faqs__expand":"false"}},"bcdbba1e-225b-49a4-b1aa-ff182125e57b":{"type":"specialized__faqs","settings":{"heading":"WHAT IS ALOPECIA UNIVERSALIS?","specialized__faqs_ans":"Alcopecia universalis (also known as Alopecia totalis) is a very advanced form of Alopecia Areata that results in complete hair loss on the head and body.","faqs__expand":"false"}},"e5e45ce4-b632-464b-8b19-f37e9a2ebbd0":{"type":"specialized__faqs","settings":{"heading":"WHAT IS TRACTION ALOPECIA?","specialized__faqs_ans":"Traction Alopecia occurs when the hair thins in a particular spot do to continuous pulling or traction on the hair follicle. This can occur when a person repeatedly styles their hair in tight ponytails, buns, braids, or has damaging hair extensions applied to their scalp.","faqs__expand":"false"}},"215ae8c8-da0f-4368-8a0b-7cedbbce5f9f":{"type":"specialized__faqs","settings":{"heading":"WHAT IS ALOPECIA ANDROGENETIC? (ALSO CALLED ANDROGENIC ALOPECIA)","specialized__faqs_ans":"<p>Androgenetic Alopecia is different from Alopecia Areata because Androgenetic Alopecia is caused by a sensitivity to dihydro-testosterone rather than it being caused by an autoimmune response like Alopecia Areata.<\/p>\n\n<p>Like Alopecia Areata, Androgenetic Alopecia is common in both men and women. However for men this is often labelled \"male pattern baldness\". This is because men often experience Androgenetic Alopecia in a notable \"M\" shape, as women experience overall hair thinning.<\/p>\n\n<p>In men, Androgenetic Alopecia often leads to partial or complete baldness, while in women total baldness is much more rare.<\/p>","faqs__expand":"false"}},"9da4fe35-9f4e-4aa7-af5d-37e415eff03a":{"type":"specialized__faqs","settings":{"heading":"ARE TREATMENTS AVAILABLE FOR THOSE DIAGNOSED WITH ALOPECIA?","specialized__faqs_ans":"Yes, there are treatment options available for those diagnosed with Alopecia. There are injections as well as topical ointments that can be used to treat the hair loss experienced with Alopecia. To learn more about how to treat your Alopecia symptoms, visit your doctor.","faqs__expand":"false"}},"eaa6c280-1d72-4fa0-863a-7e2955701b02":{"type":"specialized__faqs","settings":{"heading":"CAN VITAMINS HELP WITH ALOPECIA HAIR LOSS?","specialized__faqs_ans":"<p>Yes! Supplementing with the <b>right<\/b> Vitamins can absolutely help.<\/p>\n\n<p>Our celebrated <b>ST. TROPICA Hair Vitamins<\/b> have already helped many people suffering from Alopecia &amp; hair loss.  Once again, all of the photos and reviews seen here are from our very own customers.  They 100% genuine and authentic, unedited, and unsolicited.  They are from REAL people, with REAL results!<\/p>\n\n<p>ST. TROPICA Hair Growth Vitamins are a different kind of Hair Vitamin. They include 100% or more of the DV (Daily Value) of all the essential hair nutrients, PLUS our Proprietary, highly researched, plant &amp; fruit based <b>HAIR SUPERFOOD<\/b> formula. We have hand-selected only the best ingredients to create the world's best Hair Vitamins. Our 12 essential hair health ingredients (Vitamins, Protein &amp; Minerals) + 7 exclusive Hair Superfoods help maximize Hair Growth, Strength and Thickness from the inside-out.  They are also 100% Drug Free, and Allergen Free.<\/p>\n\n<p>What’s more is that come with our exclusive <b>100 DAY MONEY BACK GUARANTEE<\/b>: Simply take our 60 Day Hair Challenge, and get Longer, Stronger Hair in 60 days flat, or your money back - where will we give you a full refund if you’re not delighted with your results. It's the Ultimate daily Hair Vitamin for extraordinary results, and we’ve made it a no-brainer by including our Ultimate Money-Back Guarantee, ensuring your total satisfaction.<\/p>","faqs__expand":"false"}}},"block_order":["ca66ed0c-3d8b-4355-82b4-9bd8bff308ba","bc777fe7-1203-4eaa-a8e2-fab03ba1238d","885d8578-14dc-493c-9823-466358130167","b67a8edb-9766-48d9-8552-f9e71840ec5d","bcdbba1e-225b-49a4-b1aa-ff182125e57b","e5e45ce4-b632-464b-8b19-f37e9a2ebbd0","215ae8c8-da0f-4368-8a0b-7cedbbce5f9f","9da4fe35-9f4e-4aa7-af5d-37e415eff03a","eaa6c280-1d72-4fa0-863a-7e2955701b02"],"settings":{"affiliate_code":"Alopecia","specialized__faqs_title":"ALOPECIA FAQ","specialized__review_title":"60 days it grew 2 inches","specialized__review_name":"Yubelkis V","specialized__review_img":"shopify:\/\/shop_images\/Yubelkis_Valerio_b40057af-0abb-4e95-848b-eccb594224e4.png","specialized__review_content":"Alopecia Areata after trying different hair growth vitamins and homemade hair growth treatments. Nothing worked until I started using St. Tropica. I started seeing results within a couple of weeks and by the end of the 60 days I was amazed at how much hair had grown and how thicker it was. From day one to day 60 it grew 2 inches.","width":"wide","padding_top":60,"padding_bottom":20,"padding_left":0,"padding_right":0,"review__side":"order-0","animation":"none","css_class":"","css_id":"review2","custom_css":".trubloom_review_bg{\n    background-image: url(https:\/\/cdn.shopify.com\/s\/files\/1\/0818\/8965\/t\/100\/assets\/trubloom_review_bg_1.png?v=1648728108);\n    background-size: cover;\n}\n.trubloom_review_bg .purchase-details__buttons .action_button.action_button--secondary {\n    border: 1px solid #ff9ac6;\n    color: #ffffff;\n    background: #ff9ac6;\n}"}},"164999877830d52c8d":{"type":"custom-liquid","settings":{"custom_liquid":"<div id=\"stamped-main-widget\" class=\"mx-0 mb-0\" data-keyword=\"Alopecia\"><\/div>\n<a href=\"\/products\/st-tropica-hair-vitamins-hair-challenge-2-month-supply\" class=\"button mx-auto\">Order Now<\/a>\n<style>\ndiv.stamped-container[data-widget-style], div[data-widget-style] div.stamped-container {\n    margin: 0px auto!important;\n}\n<\/style>"}}},"order":["164872987662732b2c","16486356205a406201","165595945233e6b2ce","1648640448df60772a","1648645038b9435b55","164864287453c7f8d9","164864161709cc9c7d","164999877830d52c8d"]}