{"sections":{"164872987662732b2c":{"type":"specialized__page_header","settings":{"spl_text":"Widely regarded as the Best hair growth vitamins for POST-SURGICAL Related Hair Loss","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"animation":"none","css_class":"","custom_css":".special-head{\n    background-image: url({{ 'trubloom_review_bg.png' | asset_url }});\n    background-size: cover;\n}\n.home-slide-content p {\n    color: #727272;\n    font-size: 18px;\n}\n.home-slide-content h2 {\n    color: #ff9ac6;\n    font-size: 26px;\n}"}},"16486356205a406201":{"type":"specialized__page_top","settings":{"specialized__title":"POST-SURGICAL HAIR LOSS","specialized__top_content":"<p>We've been honored to hear from thousands of real customers that our Hair Vitamins have helped them through their hair loss struggles.<\/p><p>People from around the world who've suffered from Post-surgical in particular, have been kind enough to submit reviews and results highlighting their positive experiences with ST. TROPICA. And we want to pay it forward by sharing with anyone & everyone who also may be dealing with Post-surgical.<\/p><p>Many of us may not know what Post-surgical is, and may have concerns over being undiagnosed; or just excited to find a resource focused specifically on Post-surgical and hair loss. So let's dive into it.<\/p>","show__spe__review":true,"specialized__review_title":"Great product!","specialized__review_name":"Christine G","specialized__review_img":"shopify:\/\/shop_images\/Christine_G.png","specialized__review_content":"I experience hair loss after several surgeries. Of course, I wanted to quickly and successfully grow my hair back. I tried several products and didn't have much luck. So, I thought I would try just one more, and St. Tropica did the trick. My hair is growing back and very shortly, probably another 3 or 4 months, I can lose the hair piece I have been wearing and can show off my natural. My hair is thicker now and I have new growth coming in all over the place. I strongly recommend that people like me try this product. You won't be disappointed.","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"review__side":"order-0","animation":"none","css_class":"","custom_css":""}},"1655963186249522a7":{"type":"specialized__survey_section","settings":{"affiliate_code":"postsurgical","width":"wide","padding_top":70,"padding_bottom":20,"padding_left":0,"padding_right":0,"review__side":"order-0","animation":"none","css_class":"","custom_css":""}},"1648640448df60772a":{"type":"specialized__what_is","settings":{"specialized__what_icon1":"shopify:\/\/shop_images\/Chemotherapy1.png","specialized__what_title":"WHY DO SURGICAL PROCEDURES RESULT IN HAIR LOSS?","specialized__what_content":"<p>Post-surgical hair loss is a result of the body going through a traumatic event, this type of hair loss is also known as Telogen Effluvium. This \"shock hair loss\" is characterized by an increased amount of hair shedding due to the bodily stress of both the surgery and anaesthesia.This type of hair loss is most common after major surgeries, though it can occur after minor ones as well.<\/p>","show__sym":false,"specialized__sym_title":"","specialized__sym_content":"","specialized__how_title":"HOW CAN ST. TROPICA HAIR VITAMINS HELP?","specialized__how_content":"<p>Yes! Supplementing with the right Vitamins can absolutely help.<\/p><p>Our celebrated ST. TROPICA Hair Vitamins have already helped many people suffering from Post-surgical hair loss. Once again, all of the photos and reviews seen here are from our very own customers. They 100% genuine and authentic, unedited, and unsolicited. They are from REAL people, with REAL results!<\/p><p>ST. TROPICA Hair Growth Vitamins are a different kind of Hair Vitamin. They include 100% or more of the DV (Daily Value) of all the essential hair nutrients, PLUS our Proprietary, highly researched, plant & fruit based HAIR SUPERFOOD formula. We have hand-selected only the best ingredients to create the world's best Hair Vitamins. Our 12 essential hair health ingredients (Vitamins, Protein & Minerals) + 7 exclusive Hair Superfoods help maximize Hair Growth, Strength and Thickness from the inside-out. They are also 100% Drug Free, and Allergen Free.<\/p><p>What’s more is that come with our exclusive 100 DAY MONEY BACK GUARANTEE: Simply take our 60 Day Hair Challenge, and get Longer, Stronger Hair in 60 days flat, or your money back - where will we give you a full refund if you’re not delighted with your results. It's the Ultimate daily Hair Vitamin for extraordinary results, and we’ve made it a no-brainer by including our Ultimate Money-Back Guarantee, ensuring your total satisfaction.<\/p>","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"animation":"none","css_class":"","custom_css":""}},"1648645038b9435b55":{"type":"specialized__review_slide","blocks":{"a179d9c3-5fb8-42ce-8971-9f2376051d00":{"type":"60day-challenge","settings":{"review__Count1":"false","title":"","heading":"","ch_review_content":"","review__Count2":"true","ch_review_img2":"shopify:\/\/shop_images\/Amber_F.png","title2":"I would highly recommend","heading2":"Amber F","ch_review_content2":"I’m having Excellent results. I’m a believer. I’m ordering a second supply. After major surgery and extreme hair loss I’m now a believer. I cut my hair off middle of May due to major shedding. I’m now seeing quick results in less than 2 months. I would highly recommend.","review__Count3":"true","ch_review_img3":"shopify:\/\/shop_images\/Caprice_W.png","title3":"thicker and longer hair!","heading3":"Caprice W","ch_review_content3":"I had open heart surgery in December of 2019. One of the not so fun side effects is hair loss. As my body adjusted to new “heart parts” there were a lot of things that came up. One of those things was hair falling out . I was prepared for this as I had the support from other patients that had been through the same thing. However, I had an advantage of knowing about the hair vitamins. I pass on info about St. Tropica all the time so my fellow heart surgery warriors have the same advantage of thicker and longer hair!","review__Count4":"true","ch_review_img4":"shopify:\/\/shop_images\/Robin_S.png","title4":"I'm highly amazed","heading4":"Robin S","ch_review_content4":"I had to have an emergency Stomach Surgery a year ago due to a tumor on my stomach lining so they had to cut over half of my Stomach out making it difficult for me to eat much & consume enough nutrients in my body. One of the biggest side effects is Loosing your hair due to lack of nutrients. I always had Long & very Thick hair but month after month after month after my surgery Gobs & Gobs (a hairbrush full) of Hair would constantly fall out. Everytime I brushed my hair Tons would fall out as well as everytime I washed my hair in the shower tons would fall out. It was always very devastating for me. My thick hair had become very Thin on top of my head plus feeling like I was going to become hairless soon as Gobs kept falling out. I finally gave in & ordered the 60 day Supply of St. Tropica as I felt like It definitely was worth a try. After the First Week I noticed my hair feeling much softer & as the weeks went on with using St. Tropica less & less of my hair fell out (which was very surprising & exciting) to where hardly any hair fell out when I brushed it & washed it. Also I could & can feel the hair on top of my head growing in much THICKER from how thin it had become. I'm so Thankful in trying this product as I was skeptical before I ordered but I'm highly amazed with the successful outcome for sure."}},"2aac819e-77c5-4603-b09d-2199fd49ef8f":{"type":"60day-challenge","settings":{"review__Count1":"true","ch_review_img":"shopify:\/\/shop_images\/Cherise_M.png","title":"This stuff is amazing!","heading":"Cherise M","ch_review_content":"I had a major surgery and hospital stay and was malnourished... my hair fell out so I had to cut it and have been trying to grow it out the past 5 years... it's been SO slow! Until now! It's growing! I even went beach blonde and still....It's noticeably and undeniably growing! This stuff is amazing! It works! Try it and see for yourself!","review__Count2":"true","ch_review_img2":"shopify:\/\/shop_images\/Cheryl_B1.png","title2":"I definitely would recommend","heading2":"Cheryl B","ch_review_content2":"My overall experience was great, having your hair shaved for surgery was devastating, especially after discovering it was not growing back as you anticipated. I definitely would recommend these vitamins to everyone.❤","review__Count3":"true","ch_review_img3":"shopify:\/\/shop_images\/Wendy_W.png","title3":"it really works","heading3":"Wendy W","ch_review_content3":"I have been having hair loss for over 15 years due to anesthesia from a surgery. Now I can see and feel a difference in my hair. I am a testimony that it really works.","review__Count4":"false","title4":"","heading4":"","ch_review_content4":""}}},"block_order":["a179d9c3-5fb8-42ce-8971-9f2376051d00","2aac819e-77c5-4603-b09d-2199fd49ef8f"],"settings":{"specialized__review_title":"REAL PEOPLE WITH REAL RESULTS","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"animation":"none","css_class":"","css_id":"","custom_css":""}},"164864287453c7f8d9":{"type":"index__featured-product","blocks":{"164864287420959887-0":{"type":"title","settings":{}},"164864287420959887-1":{"type":"price","settings":{"display_savings":true}},"164864287420959887-3":{"type":"form","settings":{"show_payment_button":true}}},"block_order":["164864287420959887-0","164864287420959887-1","164864287420959887-3"],"settings":{"affiliate_code":"postsurgical","featured_product":"st-tropica-hair-vitamins-hair-challenge-2-month-supply","product_images_position":"left","set_product_height":false,"product_height":500,"video_looping":false,"gallery_arrows":true,"enable_zoom":true,"enable_product_lightbox":true,"slideshow_speed":0,"slideshow_transition":"slide","display_thumbnails":true,"thumbnail_position":"left-thumbnails","enable_thumbnail_slider":true,"width":"wide","padding_top":60,"padding_bottom":0,"animation":"none","css_class":"","custom_css":".product-gallery__main, .product-gallery__thumbnails.is-slide-nav--true {\n    opacity: 1;\n}"}},"164864161709cc9c7d":{"type":"specialized__page_faqs","blocks":{"6367c82e-98bb-4709-a054-8ea845be3fd0":{"type":"specialized__faqs","settings":{"heading":"WHEN WILL I NOTICE POST-SURGICAL HAIR LOSS?","specialized__faqs_ans":"<p>Typically, the hair loss from a surgery begins about 4-8 weeks after the operation and can continue shedding for 3-6 months. After that time, your hair will resume its normal hair growth cycle.<\/p>\n<p>Each day, the average person loses approximately 100 strands of hair. With Telogen Effluvium or post-surgical hair loss, you may notice significantly more hair shedding. Rather than losing 100 hairs, you may lose up to 300 strands.<\/p>","faqs__expand":"true"}},"f7116f63-282e-4161-ac9c-83384530b040":{"type":"specialized__faqs","settings":{"heading":"HOW DOES HAIR LOSS FROM SURGICAL PROCEDURES GET DIAGNOSED?","specialized__faqs_ans":"<p>To diagnose post-surgical hair loss you must visit your doctor and have them review your symptoms.<\/p>","faqs__expand":"false"}},"7d03c72f-13b1-4155-a6d3-51ee70b21086":{"type":"specialized__faqs","settings":{"heading":"WILL I LOSE ALL OF MY HAIR AND IS THIS HAIR LOSS PERMANENT?","specialized__faqs_ans":"<p>No, you will not lose all of your hair. In some cases the shedding may be severe but after a time, your hair will resume its normal hair growth cycle and the hair will begin to fill in and grow again.<\/p>","faqs__expand":"false"}},"b7ddbcc7-ab02-45dd-9f3a-5f3271f8162b":{"type":"specialized__faqs","settings":{"heading":"ARE TREATMENTS AVAILABLE FOR THIS TYPE OF HAIR LOSS?","specialized__faqs_ans":"<p>Yes, there are treatments available which you can discuss with your doctor. Your doctor may suggest hormone replacement therapy to help reduce your hair loss, and they will likely want to review and address any nutritional deficiencies you may have.<\/p>\n<p>If you do have nutritional deficiencies then you may need to begin taking a supplement. Supplements have also been shown to help those suffering from hair loss caused by Telogen Effluvium and nutritional  deficiencies.<\/p>","faqs__expand":"false"}},"45c5b7db-46aa-4087-93c1-c157b19afe16":{"type":"specialized__faqs","settings":{"heading":"WHAT ELSE CAN YOU DO TO REVERSE Post-surgical HAIR LOSS?","specialized__faqs_ans":"<ul class=\"ul-disc\"> <li>Use gentle hair care<\/li> <li>Avoid using heat tools and use heatless styling methods instead<\/li> <li>Avoid styling methods that tug or pull on the root of your hair<\/li> <li>Take vitamins that are specifically formulated for hair growth<\/li> <li>Incorporate exercises that will help manage your stress (yoga, pilates, and meditation are all great options)<\/li> <li>Eat a diet rich in protein as well as vitamin A, E, B7, C, D, Iron, and Zinc.<\/li>\n<\/ul>","faqs__expand":"false"}},"4d2b5a5c-9b0c-469e-93d6-d9c9edb4e51f":{"type":"specialized__faqs","settings":{"heading":"CAN VITAMINS HELP WITH HAIR LOSS FROM Post-surgical DISEASE?","specialized__faqs_ans":"<p>Yes! Supplementing with the right Vitamins can absolutely help.<\/p>\n<p>Our celebrated <a href=\"https:\/\/www.sttropica.com\/collections\/st-tropica-collection\/products\/st-tropica-hair-vitamins-hair-challenge-2-month-supply\" target=\"_blank\" title=\"Tru Bloom Hair Growth Vitamins\" rel=\"noopener noreferrer\">ST. TROPICA Hair Vitamins<\/a> have already helped many people suffering from Post-surgical related hair loss. Once again, all of the photos and reviews seen here are from our very own customers. They are 100% genuine and authentic, unedited, and unsolicited. They are from REAL people, with REAL results.<\/p>\n<p><a href=\"https:\/\/www.sttropica.com\/collections\/st-tropica-collection\/products\/st-tropica-hair-vitamins-hair-challenge-2-month-supply\" target=\"_blank\" title=\"Tru Bloom Hair Growth Vitamins\" rel=\"noopener noreferrer\">ST. TROPICA Hair Growth Vitamins<\/a> are a different kind of Hair Vitamin. They include 100% or more of the DV (Daily Value) of all the essential hair nutrients, PLUS our Proprietary, highly researched, plant &amp; fruit based HAIR SUPERFOOD formula. We have hand-selected only the best ingredients to create the world's best Hair Vitamins. Our 12 essential hair health ingredients (Vitamins, Protein &amp; Minerals) + 7 exclusive Hair Superfoods help maximize Hair Growth, Strength, and Thickness from the inside out. <\/p>\n<p>The Tru Bloom Hair Growth Vitamins are also 100% Drug-Free and Allergen Free. This means that they free of all 8 allergens for Nutritional Supplements, which are wheat, soy, peanuts, dairy, tree nuts, crustaceans, fish, and eggs!<\/p>\n<p>What’s more is that they come with our exclusive 100 DAY MONEY BACK GUARANTEE: Simply take our 60 Day Hair Challenge, and get Longer, Stronger Hair in 60 days flat, or your money back - where will we give you a full refund if you’re not delighted with your results. It's the Ultimate daily Hair Vitamin for extraordinary results, and we’ve made it a no-brainer by including our Ultimate Money-Back Guarantee, ensuring your total satisfaction.<\/p>","faqs__expand":"false"}}},"block_order":["6367c82e-98bb-4709-a054-8ea845be3fd0","f7116f63-282e-4161-ac9c-83384530b040","7d03c72f-13b1-4155-a6d3-51ee70b21086","b7ddbcc7-ab02-45dd-9f3a-5f3271f8162b","45c5b7db-46aa-4087-93c1-c157b19afe16","4d2b5a5c-9b0c-469e-93d6-d9c9edb4e51f"],"settings":{"affiliate_code":"postsurgical","specialized__faqs_title":"POST-SURGICAL FAQ","show__spe__review":true,"specialized__review_title":"Nothing has work like this pills!","specialized__review_name":"Brenda G","specialized__review_img":"shopify:\/\/shop_images\/Brenda_G.png","specialized__review_content":"I'm very very excited with this pills after 2 years of having surgery. My doctor say I was going to lose a lot of my hair But after taking these pills for this 60 days I can tell you is the first time in two years that I see this long my hair very very excited for me.Believe me. I have been trying everything everything on Market on websites and television anything good for hair. Nothing has work like this pills really really work?","width":"wide","padding_top":60,"padding_bottom":20,"padding_left":0,"padding_right":0,"review__side":"order-0","animation":"none","css_class":"","css_id":"review2","custom_css":".trubloom_review_bg{\n    background-image: url(https:\/\/cdn.shopify.com\/s\/files\/1\/0818\/8965\/t\/96\/assets\/trubloom_review_bg_1.png?v=1648728108);\n    background-size: cover;\n}\n.trubloom_review_bg .purchase-details__buttons .action_button.action_button--secondary {\n    border: 1px solid #ff9ac6;\n    color: #ffffff;\n    background: #ff9ac6;\n}"}},"1650000248956d73e0":{"type":"custom-liquid","settings":{"custom_liquid":"<div id=\"stamped-main-widget\" class=\"mx-0 mb-0\" data-keyword=\"surgery\"><\/div>\n<a href=\"\/products\/st-tropica-hair-vitamins-hair-challenge-2-month-supply\" class=\"button mx-auto\">Order Now<\/a>\n<style>\ndiv.stamped-container[data-widget-style], div[data-widget-style] div.stamped-container {\n    margin: 0px auto!important;\n}\n<\/style>"}}},"order":["164872987662732b2c","16486356205a406201","1655963186249522a7","1648640448df60772a","1648645038b9435b55","164864287453c7f8d9","164864161709cc9c7d","1650000248956d73e0"]}