{"sections":{"164872987662732b2c":{"type":"specialized__page_header","settings":{"spl_text":"Widely regarded as the Best hair growth vitamins for lupus related hair loss","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"animation":"none","css_class":"","custom_css":".special-head{\n    background-image: url({{ 'trubloom_review_bg.png' | asset_url }});\n    background-size: cover;\n}\n.home-slide-content p {\n    color: #727272;\n    font-size: 18px;\n}\n.home-slide-content h2 {\n    color: #ff9ac6;\n    font-size: 26px;\n}"}},"16486356205a406201":{"type":"specialized__page_top","settings":{"specialized__title":"LUPUS AND HAIR LOSS","specialized__top_content":"<p>We've been honored to hear from thousands of real customers that our Hair Vitamins have helped them through their hair loss struggles.<\/p><p>People from around the world who've suffered from Lupus in particular, have been kind enough to submit reviews and results highlighting their positive experiences with ST. TROPICA. And we want to pay it forward by sharing with anyone & everyone who also may be dealing with Lupus.<\/p><p>Many of us may not know what Lupus is, and may have concerns over being undiagnosed; or just excited to find a resource focused specifically on Lupus and hair loss. So let's dive into it.<\/p>","show__spe__review":true,"specialized__review_title":"It works and we love it!","specialized__review_name":"Malikka H","specialized__review_img":"shopify:\/\/shop_images\/Malikka_H.png","specialized__review_content":"My finance was diagnosed with Lupus 2 years ago. 1 year ago, he stated to lose his hair in patches and shaved it all off because it would not grow in specific areas. After doing my research I found St. Tropica and convinced him to try it out. After 60 days, his hair is growing in all the places it wouldn't again! We're both excited to keep using St. Tropica! 5 Stars!","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"review__side":"order-0","animation":"none","css_class":"","custom_css":""}},"1655961866b98dfaed":{"type":"specialized__survey_section","settings":{"affiliate_code":"lupus","width":"wide","padding_top":70,"padding_bottom":20,"padding_left":0,"padding_right":0,"review__side":"order-0","animation":"none","css_class":"","custom_css":""}},"1648640448df60772a":{"type":"specialized__what_is","settings":{"specialized__what_icon1":"shopify:\/\/shop_images\/Lupus1.png","specialized__what_title":"WHAT IS LUPUS?","specialized__what_content":"<p>Lupus is an autoimmune disease. Autoimmune diseases occur when the body's immune system attacks your own bodies organs, tissues, etc. With Lupus, your immune system attacks various parts of the body and can cause inflammation in your kidneys, joints, skin, hair, heart, lungs, and more.<\/p>","show__sym":false,"specialized__sym_title":"","specialized__sym_content":"","specialized__how_title":"HOW CAN ST. TROPICA HAIR VITAMINS HELP?","specialized__how_content":"<p>We are excited to share that we are constantly receiving incredibly positive feedback, in the form of 5 star photo reviews, from many of our valued customers who are struggling with Lupus related hair loss; and who are experiencing tremendous results by using our one-of-a-kind Tru Bloom Hair Vitamins. All of the photos and reviews seen here are 100% genuine and authentic, and they are unedited, and unsolicited. In short, they are the real deal.<\/p><p>Tru Bloom Hair Growth Vitamins by ST. TROPICA are a different kind of Hair Vitamin. They include 100% or more of the DV (Daily Value) of all the essential hair nutrients, PLUS our Proprietary, highly researched, plant & fruit based HAIR SUPERFOOD formula. We have hand-selected only the best ingredients to create the world's best Hair Vitamins. Our 12 essential hair health ingredients (Vitamins, Protein & Minerals) + 7 exclusive Hair Superfoods help maximize Hair Growth, Strength and Thickness from the inside-out. They are also 100% Drug Free, and Allergen Free.<\/p><p>What’s more is that they come with an exclusive 100 DAY MONEY BACK GUARANTEE: Simply take our 60 Day Hair Challenge, and get Longer, Stronger Hair in 60 days flat, or your money back - where will we give you a full refund if you’re not delighted with your results. It's the Ultimate daily Hair Vitamin for extraordinary results, and we’ve made it a no-brainer by including our Ultimate Money-Back Guarantee, ensuring your total satisfaction.<\/p>","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"animation":"none","css_class":"","custom_css":""}},"1648645038b9435b55":{"type":"specialized__review_slide","blocks":{"17e684d1-7532-45f5-b96a-62f329ade0b7":{"type":"60day-challenge","settings":{"review__Count1":"true","ch_review_img":"shopify:\/\/shop_images\/Michelle_T.png","title":"better results than anything","heading":"Michelle T","ch_review_content":"I have severe hair loss due to lupus. These vitamins have given better results than anything I've tried. I can't wait to see how my hair looks in a few more months!","review__Count2":"true","ch_review_img2":"shopify:\/\/shop_images\/Joletta_J.png","title2":"this product to help more","heading2":"Joletta J","ch_review_content2":"From someone who has lupus and suffers from hair loss I see somewhat of a difference but hoping to keep continuing this product to help more and more","review__Count3":"true","ch_review_img3":"shopify:\/\/shop_images\/Joy_M.png","title3":"I highly recommend it","heading3":"Joy M","ch_review_content3":"Between the Lupus and all the medications I have to take, it has taken quite a toll on my hair. I had so much hair fall out that my hair had become so thin and had balding spots in front of hair. After using St. Tropica for 60 days the fallout has diminished greatly and the two spots in the front area have filled in. This product is awesome and I highly recommend it. I am gonna recommend to my mom and sister. Thank you St. Tropica.","review__Count4":"true","ch_review_img4":"shopify:\/\/shop_images\/Dezaray_Caraballo.png","title4":"LUPUS WARRIOR - BEST HAIR VITAMINS!","heading4":"Dezaray C","ch_review_content4":"I have Lupus and have suffered with hair thinning and my hair falling out A LOT over the years. I have never found a vitamin to help with this and I have tried everything. Including vitamins, treatments, shampoo's etc. Within the first 30 days my hair has stopped falling out!!!!!!! Aside from the normal hair shedding that is natural, nothing else falls out! I am also growing NEW hair, PLUS my hair has grown 2.5 inches in 60 days and is thicker than it has ever been! I cannot tell you how much this has changed my life. I was so embarrassed to have my hair falling out every where I went and leaving so much hair in the bed with my boyfriend :( Now, I get compliments all the time on my hair and my confidence is higher than ever! I rarely leave reviews but I absolutely needed to for these miracle pills. Oh for clarity, my hair is super long to the middle of my back so it's important to have it be strong, shiny and healthy. BONUS? My nails are stronger than they have ever been and growing so FAST! Thanks again for a wonderful product, i will be a customer for life!"}},"cbcbed37-1a0b-49ad-be9d-812edc7135af":{"type":"60day-challenge","settings":{"review__Count1":"true","ch_review_img":"shopify:\/\/shop_images\/Cathey_Mckinney.png","title":"I absolutely love these vitamins!","heading":"Cathey M","ch_review_content":"I have Lupus and it took most of my hair. Taking these helped fill in my bald spots and my hair has grown a lot! I’ll continue taking these! The results are amazing!!!","review__Count2":"true","ch_review_img2":"shopify:\/\/shop_images\/Talina_Anthony.png","title2":"I’ve been so impressed","heading2":"Talina A","ch_review_content2":"I’ve been so impressed with St Tropica! I have Lupus and lose my hair from it. I have so much new hair growth in the last 60 days it’s been crazy!!","review__Count3":"true","ch_review_img3":"shopify:\/\/shop_images\/Katherine_Jones_9353c9a5-b8af-4e91-8121-82911dcd5955.png","title3":"my curls are starting to form","heading3":"Katherine J","ch_review_content3":"I was diagnosed with Lupus very young and have suffered from hair loss since I can remember. Last year it got so bad that I was left with almost nothing. My hair was growing so slowly and I was desperate to make it stop falling out. In two months my hair is healthier, my curls are starting to form, and everyone has been asking me what I’m doing to make my hair grow so fast.","review__Count4":"false","title4":"","heading4":"","ch_review_content4":""}},"d02333db-8769-4272-9b12-682326c4b959":{"type":"60day-challenge","settings":{"review__Count1":"false","title":"","heading":"","ch_review_content":"","review__Count2":"true","ch_review_img2":"shopify:\/\/shop_images\/Samantha_A.png","title2":"my hair definitely grew up on top","heading2":"Samantha A","ch_review_content2":"although it looks like there isn't much of a difference my hair definitely grew up on top I have the stray hairs to prove it. I feel like I would need more than 2 months to decide if this supplement is beneficial because I have lupus and celiacs so the way I absorb vitamins isn't the same as the next person however so far so good 👍","review__Count3":"true","ch_review_img3":"shopify:\/\/shop_images\/Dezaray-Caraballo_a8cc3cf9-5162-4c99-b459-76184ab7edc5.png","title3":"incredible vitamins!","heading3":"Dezaray C","ch_review_content3":"I just finished my 3rd 60 day Challenge and I cannot say more good things about these incredible vitamins! This picture on the left was 2 months ago the day I got my hair cut. I had already used these vitamins for 4 months and my hair was so much thicker, longer, healthier and had new hair growing in my thin spots! Now 60 days after that pic is my hair on the right! It has grown 2 inches already and my \"baby hairs\" that frame my face are as long and almost as thick as my regular bangs!! As a woman who has Lupus, my hair has always paid a price. Thin, falling out, shedding like crazy, hard to grow, brittle, dry, and dull. Since starting St. Tropica hair vitamins, my hair has done a complete 180 and it has literally changed my life! My hair is growing so fast, it is thicker, shiny, and so much healthier! The thinning around my face is barely noticeable anymore any i receive compliments on my hair now ALL THE TIME! I do want to let people know that you may experience a little \"plateau\" period with your hair growth. I did around my 3rd month. This is completely normal so DO NOT STOP TAKING THESE!! The vitamins are for so much more than just added length! And, after that little plateau in growing, my hair is back to growing like a weed after I got my hair trimmed! I will be a customer for life, and rave about these to everyone I meet! My husband actually just started taking these (well stealing mine lol) 2 weeks ago after he has seen what they have done for my hair, and I'm excited to see what they do for him! This company has the BEST product in the industry hands down, and their customer service is 5 stars as well! I am truly thankful and apprciative to St. Tropica!","review__Count4":"true","ch_review_img4":"shopify:\/\/shop_images\/Emily_V.png","title4":"stated growing new scalp hair","heading4":"Emily V","ch_review_content4":"The overall length is amazing and I also stated growing new scalp hair. My scalp was thinning due to having lupus and now I’m seeing it grow back!!!"}}},"block_order":["17e684d1-7532-45f5-b96a-62f329ade0b7","cbcbed37-1a0b-49ad-be9d-812edc7135af","d02333db-8769-4272-9b12-682326c4b959"],"settings":{"specialized__review_title":"REAL PEOPLE WITH REAL RESULTS","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"animation":"none","css_class":"","css_id":"","custom_css":""}},"164864287453c7f8d9":{"type":"index__featured-product","blocks":{"164864287420959887-0":{"type":"title","settings":{}},"164864287420959887-1":{"type":"price","settings":{"display_savings":true}},"164864287420959887-3":{"type":"form","settings":{"show_payment_button":true}}},"block_order":["164864287420959887-0","164864287420959887-1","164864287420959887-3"],"settings":{"affiliate_code":"lupus","featured_product":"st-tropica-hair-vitamins-hair-challenge-2-month-supply","product_images_position":"left","set_product_height":false,"product_height":500,"video_looping":false,"gallery_arrows":true,"enable_zoom":true,"enable_product_lightbox":true,"slideshow_speed":0,"slideshow_transition":"slide","display_thumbnails":true,"thumbnail_position":"left-thumbnails","enable_thumbnail_slider":true,"width":"wide","padding_top":60,"padding_bottom":0,"animation":"none","css_class":"","custom_css":".product-gallery__main, .product-gallery__thumbnails.is-slide-nav--true {\n    opacity: 1;\n}"}},"164864161709cc9c7d":{"type":"specialized__page_faqs","blocks":{"033354a5-63ca-441c-b653-7c01370ef8c1":{"type":"specialized__faqs","settings":{"heading":"WHAT IS LUPUS ERYTHEMATOSUS SYSTEMIC?","specialized__faqs_ans":"<p>Lupus Erythematosus Systemic (SLE) is the most common type of Lupus. Other types of Lupus include:<\/p>\n<ul class=\"ul-disc\"> <li>Cutaneous Lupus: This form of Lupus only affects the skin<\/li> <li>Drug-induced Lupus: This form of Lupus is caused by certain types of prescription medications.<\/li> <li>Neonatal Lupus: This is a form of Lupus that affects infants born from women who have Lupus. This condition is very rare.<\/li>\n<\/ul>","faqs__expand":"true"}},"eefdb585-0c61-48e9-a413-5d6ae10e12f6":{"type":"specialized__faqs","settings":{"heading":"WHEN IS LUPUS MOST LIKELY TO DEVELOP?","specialized__faqs_ans":"<p>Lupus tends to develop between the age of 15 to 45 years old.<\/p>\n<p><b>LUPUS SYMPTOMS:<\/b><\/p>\n<ul class=\"ul-disc\"> <li>Fatigue<\/li> <li>Hair Loss<\/li> <li>Fever<\/li> <li>Joint pain, stiffness and swelling<\/li> <li>Chest pain<\/li> <li>Headaches and\/or brain fog<\/li> <li>Butterfly-shaped rash over the cheeks and bridge of the nose<\/li> <li>Rashes on the body<\/li> <li>Photosensitivity<\/li> <li>Fingers and toes that turn white or blue when cold<\/li> <li>Shortness of breath<\/li>\n<\/ul>","faqs__expand":"false"}},"568f73b5-095c-452f-abb4-8233540adba7":{"type":"specialized__faqs","settings":{"heading":"WHAT CAUSES LUPUS?","specialized__faqs_ans":"<p>Most often, the cause of Lupus is unknown making it an idiopathic disease.<\/p><p>However, those with a familial history of Lupus are more likely to develop it and occasionally Lupus can be triggered by environmental factors.<\/p><p>Some potential triggers of Lupus include sunlight, infections, and medications (such as blood pressure medications and antibiotics).<\/p>","faqs__expand":"false"}},"814c0488-3a1d-4183-a719-49be4ee5d026":{"type":"specialized__faqs","settings":{"heading":"HOW DOES LUPUS AFFECT HAIR GROWTH?","specialized__faqs_ans":"<p>Because Lupus tends to have inflammation of the skin and most commonly attacks the skin on the face and scalp, it does often impact hair growth and hair loss.<\/p>\n<p>Prior to treatment, those with Lupus will often find that their hairline, eyebrows, and eyelashes will thin.<\/p>","faqs__expand":"false"}},"d555d6e3-caae-4b82-b617-4a9b29eb7bcd":{"type":"specialized__faqs","settings":{"heading":"IS HAIR LOSS FROM LUPUS PERMANENT?","specialized__faqs_ans":"<p class=\"\">Most often, hair loss from Lupus is not permanent and hair will re-grow once your Lupus is treated. However, there are rare cases of permanent hair loss when lesions appear on the scalp and cause scarring.<\/p>","faqs__expand":"false"}},"1567b0d9-ced6-40ef-a524-b512a39ef9c9":{"type":"specialized__faqs","settings":{"heading":"ARE THERE TREATMENTS FOR LUPUS HAIR LOSS?","specialized__faqs_ans":"<p class=\"\">Yes, provided you do not have scar tissue, there are treatments available to help grow your hair back. Some of these treatments may need to be discussed with your doctor.<\/p>\n<p>Once your Lupus has been treated by a doctor, you should avoid autoimmune response triggers, such as sunlight, to avoid inflammation which could target the face and scalp.<\/p>","faqs__expand":"false"}},"559d4ebe-62bd-40b3-830d-a91733deae70":{"type":"specialized__faqs","settings":{"heading":"WHAT ELSE CAN I DO TO PREVENT HAIR LOSS WITH LUPUS?","specialized__faqs_ans":"<p>While the first step is always to treat the condition, after that you can do a number of things to help encourage and nurture your hair growth. Here are a few examples of things you could incorporate into your hair care routine:<\/p>\n<ul class=\"ul-disc\"> <li>Avoid environmental triggers for Lupus<\/li> <li>Use a satin pillow case<\/li> <li>Use hot oil treatments and\/or hair masks<\/li> <li>Limit the use of heat tools on your hair<\/li> <li>Avoid hairstyles that pull on the root of your hair<\/li> <li>Take supplements that support hair growth<\/li>\n<\/ul>","faqs__expand":"false"}},"130e231b-6cdc-4bd6-9722-e0baeb5390c8":{"type":"specialized__faqs","settings":{"heading":"CAN VITAMINS HELP WITH LUPUS HAIR LOSS?","specialized__faqs_ans":"<p>Yes! Supplementing with the right Vitamins can absolutely help.<\/p>\n<p>Our celebrated <a href=\"https:\/\/www.sttropica.com\/collections\/st-tropica-collection\/products\/st-tropica-hair-vitamins-hair-challenge-2-month-supply\" target=\"_blank\" title=\"Tru Bloom Hair Growth Vitamins\" rel=\"noopener noreferrer\">ST. TROPICA Hair Vitamins<\/a> have already helped many people suffering from Lupus related hair loss. Once again, all of the photos and reviews seen here are from our very own customers. They are 100% genuine and authentic, unedited, and unsolicited. They are from REAL people, with REAL results.<\/p>\n<p><a href=\"https:\/\/www.sttropica.com\/collections\/st-tropica-collection\/products\/st-tropica-hair-vitamins-hair-challenge-2-month-supply\" target=\"_blank\" title=\"Tru Bloom Hair Growth Vitamins\" rel=\"noopener noreferrer\">ST. TROPICA Hair Growth Vitamins<\/a> are a different kind of Hair Vitamin. They include 100% or more of the DV (Daily Value) of all the essential hair nutrients, PLUS our Proprietary, highly researched, plant &amp; fruit based HAIR SUPERFOOD formula. We have hand-selected only the best ingredients to create the world's best Hair Vitamins. Our 12 essential hair health ingredients (Vitamins, Protein &amp; Minerals) + 7 exclusive Hair Superfoods help maximize Hair Growth, Strength, and Thickness from the inside out. <\/p>\n<p>The Tru Bloom Hair Growth Vitamins are also 100% Drug-Free and Allergen Free. This means that they free of all 8 allergens for Nutritional Supplements, which are wheat, soy, peanuts, dairy, tree nuts, crustaceans, fish, and eggs!<\/p>\n<p>What’s more is that they come with our exclusive 100 DAY MONEY BACK GUARANTEE: Simply take our 60 Day Hair Challenge, and get Longer, Stronger Hair in 60 days flat, or your money back - where will we give you a full refund if you’re not delighted with your results. It's the Ultimate daily Hair Vitamin for extraordinary results, and we’ve made it a no-brainer by including our Ultimate Money-Back Guarantee, ensuring your total satisfaction.<\/p>","faqs__expand":"false"}}},"block_order":["033354a5-63ca-441c-b653-7c01370ef8c1","eefdb585-0c61-48e9-a413-5d6ae10e12f6","568f73b5-095c-452f-abb4-8233540adba7","814c0488-3a1d-4183-a719-49be4ee5d026","d555d6e3-caae-4b82-b617-4a9b29eb7bcd","1567b0d9-ced6-40ef-a524-b512a39ef9c9","559d4ebe-62bd-40b3-830d-a91733deae70","130e231b-6cdc-4bd6-9722-e0baeb5390c8"],"settings":{"affiliate_code":"lupus","specialized__faqs_title":"LUPUS FAQ","show__spe__review":true,"specialized__review_title":"I am more than satisfied!","specialized__review_name":"Cretia R","specialized__review_img":"shopify:\/\/shop_images\/Cretia_Roberson.png","specialized__review_content":"These vitamins are Absolutely amazing! My story is I had a horrible Lupus flare in 2014 and lost the majority of my hairline. It looked as if I were a male with receiving baldness. I have only had fine hairs in those areas since that year. Off and on it would grow but only a minimal amount. I took a chance on your 60 day challenge because it was a money back guarantee. The results are in and the pictures are below. I have already purchased another bottle but I'm sending in my pictures for my free one! I have already referred you to 2 additional people! On March 13th, I got my hair shaved\/ tapered in the back and cut above my ears. Now it is totally grown out. I am more than satisfied!","width":"wide","padding_top":60,"padding_bottom":20,"padding_left":0,"padding_right":0,"review__side":"order-0","animation":"none","css_class":"","css_id":"review2","custom_css":".trubloom_review_bg{\n    background-image: url(https:\/\/cdn.shopify.com\/s\/files\/1\/0818\/8965\/t\/96\/assets\/trubloom_review_bg_1.png?v=1648728108);\n    background-size: cover;\n}\n.trubloom_review_bg .purchase-details__buttons .action_button.action_button--secondary {\n    border: 1px solid #ff9ac6;\n    color: #ffffff;\n    background: #ff9ac6;\n}"}},"16499998454f6ec4cf":{"type":"custom-liquid","settings":{"custom_liquid":"<div id=\"stamped-main-widget\" class=\"mx-0 mb-0\" data-keyword=\"lupus\"><\/div>\n<a href=\"\/products\/st-tropica-hair-vitamins-hair-challenge-2-month-supply\" class=\"button mx-auto\">Order Now<\/a>\n<style>\ndiv.stamped-container[data-widget-style], div[data-widget-style] div.stamped-container {\n    margin: 0px auto!important;\n}\n<\/style>"}}},"order":["164872987662732b2c","16486356205a406201","1655961866b98dfaed","1648640448df60772a","1648645038b9435b55","164864287453c7f8d9","164864161709cc9c7d","16499998454f6ec4cf"]}