{"sections":{"164872987662732b2c":{"type":"specialized__page_header","settings":{"spl_text":"Widely regarded as the Best hair growth vitamins for CUSHING SYNDROME Related Hair Loss","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"animation":"none","css_class":"","custom_css":".special-head{\n    background-image: url({{ 'trubloom_review_bg.png' | asset_url }});\n    background-size: cover;\n}\n.home-slide-content p {\n    color: #727272;\n    font-size: 18px;\n}\n.home-slide-content h2 {\n    color: #ff9ac6;\n    font-size: 26px;\n}"}},"16486356205a406201":{"type":"specialized__page_top","settings":{"specialized__title":"CUSHING SYNDROME AND CUSHING DISEASE HAIR LOSS","specialized__top_content":"<p>We've been honored to hear from thousands of real customers that our Hair Vitamins have helped them through their hair loss struggles.<\/p><p>People from around the world who've suffered from Cushing Syndrome & Cushing Disease in particular, have been kind enough to submit reviews and results highlighting their positive experiences with ST. TROPICA. And we want to pay it forward by sharing with anyone & everyone who also may be dealing with Cushing Syndrome & Cushing Disease.<\/p><p>Many of us may not know what Cushing Syndrome & Cushing Disease is, and may have concerns over being undiagnosed; or just excited to find a resource focused specifically on Cushing Syndrome & Cushing Disease and hair loss. So let's dive into it.<\/p>","show__spe__review":true,"specialized__review_title":"Cushing’s Disease","specialized__review_name":"Carla S","specialized__review_img":"shopify:\/\/shop_images\/Carla_Sizelove.png","specialized__review_content":"I found St. Tropica in one of the lowest points of my life. My body was thrown into Cushing’s Disease after several rounds of steroid injections. Mentally and physically the hardest thing I had ever experienced, and of the symptoms was hair loss. I tried 2 other brands of hair vitamins and several brands of hair growth shampoos, with nothing gained other than deeper into my depression, Then, St Tropica, popped up and I thought, here I go again. Within 3 days, my husband thought I was crazy, but my hair felt softer. I took before pics only for myself, but then I finally got a much needed hair color and trim. My hair dresser could not believe the difference in my hair, and she cut a little more than 2 inches. When I had finished my bottle I took another picture just for myself, even still, with the hair trim, I could see a difference. My hair was right about back to the same length as when I started, and the texture was a huge difference, it even “looked” softer, smoother. So, my hope is that my review can help another person find a solution, I wish I had found you sooner. Thank you so much for all you do, Carla","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"review__side":"order-0","animation":"none","css_class":"","custom_css":""}},"1655961732054f7003":{"type":"specialized__survey_section","settings":{"affiliate_code":"cushingdisease","width":"wide","padding_top":70,"padding_bottom":20,"padding_left":0,"padding_right":0,"review__side":"order-0","animation":"none","css_class":"","custom_css":""}},"1648640448df60772a":{"type":"specialized__what_is","settings":{"specialized__what_icon1":"shopify:\/\/shop_images\/CUSHING1.png","specialized__what_title":"WHAT IS CUSHING SYNDROME?","specialized__what_content":"<p>Cushing Syndrome (also known as Cushing's Syndrome and Hypercortisolism) is caused by an influx of cortisol that comes from something either inside or outside of the body.<\/p><p>This means the excessive cortisol could be caused by a pituitary or adrenal tumour, or by corticosteroid medications. Cushing Syndrome can also occur when the body produces too much cortisol on its own.<\/p>","show__sym":false,"specialized__sym_title":"","specialized__sym_content":"","specialized__how_title":"HOW CAN ST. TROPICA HAIR VITAMINS HELP?","specialized__how_content":"<p>We are excited to share that we are constantly receiving incredibly positive feedback, in the form of 5 star photo reviews, from many of our valued customers who are struggling with Cushing Disease related hair loss; and who are experiencing tremendous results by using our one-of-a-kind Tru Bloom Hair Vitamins. All of the photos and reviews seen here are 100% genuine and authentic, and they are unedited, and unsolicited. In short, they are the real deal.<\/p><p>Tru Bloom Hair Growth Vitamins by ST. TROPICA are a different kind of Hair Vitamin. They include 100% or more of the DV (Daily Value) of all the essential hair nutrients, PLUS our Proprietary, highly researched, plant & fruit based HAIR SUPERFOOD formula. We have hand-selected only the best ingredients to create the world's best Hair Vitamins. Our 12 essential hair health ingredients (Vitamins, Protein & Minerals) + 7 exclusive Hair Superfoods help maximize Hair Growth, Strength and Thickness from the inside-out. They are also 100% Drug Free, and Allergen Free.<\/p><p>What’s more is that they come with an exclusive 100 DAY MONEY BACK GUARANTEE: Simply take our 60 Day Hair Challenge, and get Longer, Stronger Hair in 60 days flat, or your money back - where will we give you a full refund if you’re not delighted with your results. It's the Ultimate daily Hair Vitamin for extraordinary results, and we’ve made it a no-brainer by including our Ultimate Money-Back Guarantee, ensuring your total satisfaction.<\/p>","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"animation":"none","css_class":"","custom_css":""}},"164864287453c7f8d9":{"type":"index__featured-product","blocks":{"164864287420959887-0":{"type":"title","settings":{}},"164864287420959887-1":{"type":"price","settings":{"display_savings":true}},"164864287420959887-3":{"type":"form","settings":{"show_payment_button":true}}},"block_order":["164864287420959887-0","164864287420959887-1","164864287420959887-3"],"settings":{"affiliate_code":"cushingdisease","featured_product":"st-tropica-hair-vitamins-hair-challenge-2-month-supply","product_images_position":"left","set_product_height":false,"product_height":500,"video_looping":false,"gallery_arrows":true,"enable_zoom":true,"enable_product_lightbox":true,"slideshow_speed":0,"slideshow_transition":"slide","display_thumbnails":true,"thumbnail_position":"left-thumbnails","enable_thumbnail_slider":true,"width":"wide","padding_top":60,"padding_bottom":0,"animation":"none","css_class":"","custom_css":".product-gallery__main, .product-gallery__thumbnails.is-slide-nav--true {\n    opacity: 1;\n}"}},"164864161709cc9c7d":{"type":"specialized__page_faqs","blocks":{"45dbf4bb-967a-4052-b1bd-ba48c083cc81":{"type":"specialized__faqs","settings":{"heading":"WHAT CAUSES CUSHING SYNDROME?","specialized__faqs_ans":"<p>There are a few causes of Cushing Syndrome which include:<\/p>\n<ul class=\"ul-disc\"> <li>Use of cortisol medications (known as iatrogenic Cushing’s syndrome)<\/li> <li>Pituitary tumours (Cushing’s disease)<\/li> <li>Adrenal gland tumours (ectopic Cushing’s syndrome)<\/li> <li>Familial Cushing Syndrome (Genetic causes of Cushing Syndrome are rare, however some people have a genetic predisposition to develop tumours in the endocrine glands)<\/li>\n<\/ul>","faqs__expand":"true"}},"44dd8d1c-eb38-43e1-956c-43863001ee7a":{"type":"specialized__faqs","settings":{"heading":"WHAT IS CUSHING DISEASE?","specialized__faqs_ans":"<p>Cushing Disease is a specific form of Cushing Syndrome and is the result of the body producing too much cortisol. Cortisol is a hormone that is related to the body's stress response and its secretion is controlled by the hypothalamus, the pituitary gland, and the adrenal gland.<\/p>\n<p>Cushing Disease is considered a rare pituitary disorder. It effects 10 to 15 people per million each year and is most commonly found in adults between the ages of 20-50 years old and 70% of cases are women. This type of Cushing Syndrome is caused by a pituitary tumour that produces too much much cortisol.<\/p>\n<p>Without treatment, symptoms will get worse as this disease is considered progressive. However, with treatment, symptoms can be managed, elevated to an extent, and those with Cushing Disease (or Cushing's Disease) can lead healthy and active lives.<\/p>","faqs__expand":"false"}},"82a7fe14-cadc-47dd-a9d1-3be395b9336b":{"type":"specialized__faqs","settings":{"heading":"WHAT CAUSES CUSHING DISEASE?","specialized__faqs_ans":"<p>Cushing Disease is caused by a pituitary tumour. These tumours are typically benign but they can make the pituitary gland produce too much adrenocorticotropic hormone (ACTH) which causes the adrenal glands to produce too much cortisol.<\/p>","faqs__expand":"false"}},"6dd2d3cd-f9b4-4ab0-a9b7-1fcf06e3ff37":{"type":"specialized__faqs","settings":{"heading":"WHAT ARE THE SYMPTOMS OF CUSHING DISEASE\/SYNDROME?","specialized__faqs_ans":"<ul class=\"ul-disc\"> <li>A round and\/or red face<\/li> <li>A hump on back of neck<\/li> <li>Purple stretch marks<\/li> <li>Irregular periods (in women)<\/li> <li>Erectile disfunction (in men)<\/li> <li>Acne<\/li> <li>Excessive facial hair<\/li> <li>Female balding\/ hair thinning<\/li> <li>Bruising easily<\/li> <li>Weight gain, especially around the abdomen<\/li> <li>High blood pressure<\/li> <li>High blood sugar<\/li> <li>Diabetes<\/li> <li>Muscle weakness<\/li> <li>Vision problems<\/li> <li>Headaches<\/li> <li>Osteoporosis<\/li> <li>Extreme fatigue or trouble sleeping<\/li> <li>Depression<\/li> <li>Memory loss or fog<\/li>\n<\/ul>","faqs__expand":"false"}},"38e88a3a-8b31-43e9-b230-4d0bfb54e074":{"type":"specialized__faqs","settings":{"heading":"HOW DO YOU GET DIAGNOSED WITH CUSHING DISEASE\/SYNDROME?","specialized__faqs_ans":"<p>Getting diagnosed with Cushing Disease or Syndrome can be difficult as a number of symptoms are similar to those experienced with other conditions. Many people do go through challenges and misdiagnosis before being diagnosed with Cushing Disease or Syndrome.<\/p>\n<p>In addition, there is not one definitive test to diagnose Cushing Disease\/Syndrome which means you may have to go through numerous screenings.<\/p>\n<p>Many doctors will begin by testing your hormone levels through blood tests, urine tests, and saliva tests. If a pituitary or adrenal tumour is suspected then you may also need to have a MRI and\/or abdominal CT scan done.<\/p>","faqs__expand":"false"}},"961e5c5f-5e60-4d43-9846-b91d746d6d79":{"type":"specialized__faqs","settings":{"heading":"HOW DO YOU GET DIAGNOSED WITH CUSHING DISEASE\/SYNDROME?","specialized__faqs_ans":"<p>There is not one particular set treatment plan for all forms of Cushing Disease and Syndrome. You must review all your options with your doctor.<\/p>\n<p>Typically, the initial treatment for Cushing Disease is often surgery to remove the pituitary tumour. This surgery is performed by going up through the nose to remove the tumour. It is a minimally invasive surgery known as transsphenoidal surgery.<\/p>\n<p>Sometimes, surgery is either not possible or does not completely solve the cortisol level issues. In this case, you may need to go on medication to further control the cortisol levels, or discuss other surgical options.<\/p>\n<p>Occasionally, removing both adrenal glands is also done in order to control excessive cortisol levels. This is only done if cortisol levels fail to improve following pituitary tumour removal or lack of response to medication.<\/p>\n<p>If you have a particularly aggressive form of Cushing Disease than you may need to undergo radiation therapy to control the hormone levels.<\/p>","faqs__expand":"false"}},"82990b0b-1871-4ced-bc9e-69f6a84df440":{"type":"specialized__faqs","settings":{"heading":"ARE THERE WAYS TO ALLEVIATE SYMPTOMS OF CUSHING DISEASE\/SYNDROME?","specialized__faqs_ans":"<p>Yes, while ensuring you are following all medical advice and treatment plans from your doctor, you can also implement a number of lifestyle changes to support your health. These include:<\/p>\n<ul class=\"ul-disc\"> <li>Eat a healthy, balanced, and nutritious diet<\/li> <li>Stay physically active using gentle exercises (avoid stressful exercises as these could contribute to higher cortisol levels) such as: <ul class=\"ul-disc\"> <li>Water aerobics<\/li> <li>Yoga<\/li> <li>Walking<\/li>\n<\/ul>\n<\/li> <li>Address your stress, anxiety, and depression with psychologists or counsellors.<\/li> <li>Maintain a healthy and regular sleep schedule<\/li> <li>Identify nutritional deficiencies and take vitamin supplements to correct them.<\/li>\n<\/ul>","faqs__expand":"false"}},"be154c11-4332-4937-b195-218edb091773":{"type":"specialized__faqs","settings":{"heading":"CAN CUSHING DISEASE\/SYNDROME CAUSE HAIR LOSS?","specialized__faqs_ans":"<p>Yes, one of the symptoms you may experience when you have Cushing Disease or Cushing Syndrome is hair loss.<\/p>\n<p>Increased production of cortisol can cause a number of symptoms such as skin changes (bruising, acne, etc), a round or red face, weight gain, and hair loss or thinning.<\/p>\n<p>Hair thinning typically occurs on the the body but it can also affect the hair on ones' head as well.<\/p>","faqs__expand":"false"}},"adaaaf5b-cfbe-4b1f-8f9d-bb8ec33902ec":{"type":"specialized__faqs","settings":{"heading":"HOW TO CARE FOR YOUR HAIR WHEN YOU HAVE CUSHING DISEASE\/SYNDROME?","specialized__faqs_ans":"<p>There are a number of ways one can care for their hair once they have been diagnosed with Cushing Disease or Cushing Syndrome. Here are our top hair care tips:<\/p>\n<p><b>BE GENTLE WITH YOUR HAIR.<\/b>\n\t<br role=\"presentation\" data-uw-rm-sr=\"\">Avoid using heat tools, bleaching products, or tight hair styles that tug on the root of the hair.<\/p>\n<p><b>USE SCALP AND HAIR TREATMENTS.<\/b>\n\t<br role=\"presentation\" data-uw-rm-sr=\"\">We recommend using a hot oil treatment, like our <a class=\"pink-a\" href=\"\/products\/st-tropica-beach-goddess-hot-oil-hair-mask\" data-uw-rm-brl=\"false\">Beach Goddess Hot Oil Mask<\/a>, once every two weeks to help moisturize and nourish your scalp and hair. This will help keep your hair healthy and also encourage healthier hair growth.<\/p>\n<p><b>USE A SATIN PILLOWCASE.<\/b>\n\t<br role=\"presentation\" data-uw-rm-sr=\"\">Many pillowcases on the market are actually quite rough and damaging to your hair. Instead, swap your pillowcase out for something smoother and softer, like a satin pillowcase. A satin pillowcase will allow your hair to slid gently over the fabric as you turn in your sleep unlike a cotton pillowcase which would tug on your hair.<\/p>\n<p><b>TAKE HAIR GROWTH SUPPLEMENTS.<\/b>\n\t<br role=\"presentation\" data-uw-rm-sr=\"\">Hair supplements, like our <a class=\"pink-a\" href=\"\/pages\/60-day-hair-challenge-results\" data-uw-rm-brl=\"false\">60 Day hair Challenge<\/a>, can be very effective in helping support new hair growth and healthier hair growth.<\/p>","faqs__expand":"false"}},"98e0c305-2e73-422f-9f95-aec27adc4201":{"type":"specialized__faqs","settings":{"heading":"Can Vitamins Help with Cushing Syndrome & Cushing Disease Hair Loss?","specialized__faqs_ans":"<p>Yes! Supplementing with the right Vitamins can absolutely help.<\/p>\n<p>Our celebrated <a href=\"https:\/\/www.sttropica.com\/collections\/st-tropica-collection\/products\/st-tropica-hair-vitamins-hair-challenge-2-month-supply\" target=\"_blank\" title=\"Tru Bloom Hair Growth Vitamins\" rel=\"noopener noreferrer\">ST. TROPICA Hair Vitamins<\/a> have already helped many people suffering from Cushing Syndrome &amp; Cushing related hair loss. Once again, all of the photos and reviews seen here are from our very own customers. They are 100% genuine and authentic, unedited, and unsolicited. They are from REAL people, with REAL results.<\/p>\n<p><a href=\"https:\/\/www.sttropica.com\/collections\/st-tropica-collection\/products\/st-tropica-hair-vitamins-hair-challenge-2-month-supply\" target=\"_blank\" title=\"Tru Bloom Hair Growth Vitamins\" rel=\"noopener noreferrer\">ST. TROPICA Hair Growth Vitamins<\/a> are a different kind of Hair Vitamin. They include 100% or more of the DV (Daily Value) of all the essential hair nutrients, PLUS our Proprietary, highly researched, plant &amp; fruit based HAIR SUPERFOOD formula. We have hand-selected only the best ingredients to create the world's best Hair Vitamins. Our 12 essential hair health ingredients (Vitamins, Protein &amp; Minerals) + 7 exclusive Hair Superfoods help maximize Hair Growth, Strength, and Thickness from the inside out. <\/p>\n<p>The Tru Bloom Hair Growth Vitamins are also 100% Drug-Free and Allergen Free. This means that they free of all 8 allergens for Nutritional Supplements, which are wheat, soy, peanuts, dairy, tree nuts, crustaceans, fish, and eggs!<\/p>\n<p>What’s more is that they come with our exclusive 100 DAY MONEY BACK GUARANTEE: Simply take our 60 Day Hair Challenge, and get Longer, Stronger Hair in 60 days flat, or your money back - where will we give you a full refund if you’re not delighted with your results. It's the Ultimate daily Hair Vitamin for extraordinary results, and we’ve made it a no-brainer by including our Ultimate Money-Back Guarantee, ensuring your total satisfaction.<\/p>","faqs__expand":"false"}}},"block_order":["45dbf4bb-967a-4052-b1bd-ba48c083cc81","44dd8d1c-eb38-43e1-956c-43863001ee7a","82a7fe14-cadc-47dd-a9d1-3be395b9336b","6dd2d3cd-f9b4-4ab0-a9b7-1fcf06e3ff37","38e88a3a-8b31-43e9-b230-4d0bfb54e074","961e5c5f-5e60-4d43-9846-b91d746d6d79","82990b0b-1871-4ced-bc9e-69f6a84df440","be154c11-4332-4937-b195-218edb091773","adaaaf5b-cfbe-4b1f-8f9d-bb8ec33902ec","98e0c305-2e73-422f-9f95-aec27adc4201"],"settings":{"affiliate_code":"cushingdisease","specialized__faqs_title":"CUSHING SYNDROME FAQ","show__spe__review":true,"specialized__review_title":"Recovery from steroids","specialized__review_name":"Joy p","specialized__review_img":"shopify:\/\/shop_images\/Joy_p.png","specialized__review_content":"I found St. Tropica in one of the lowest points of my life. After several rounds of steroid shots for pain I developed Cushing’s syndrome resulting in TE. Devastated as I was a hair model and completely stressed is an understatement. I stumbled upon St. Tropica on fb, read the reviews and did my research. I was willing to give it a try. After 60 days, my hair was thicker, longer and stronger. I love these vitamins. It didn’t cure my TE but helped restore and regrow the hair loss quickly. Ty so much!!!","width":"wide","padding_top":60,"padding_bottom":20,"padding_left":0,"padding_right":0,"review__side":"order-0","animation":"none","css_class":"","css_id":"review2","custom_css":".trubloom_review_bg{\n    background-image: url(https:\/\/cdn.shopify.com\/s\/files\/1\/0818\/8965\/t\/96\/assets\/trubloom_review_bg_1.png?v=1648728108);\n    background-size: cover;\n}\n.trubloom_review_bg .purchase-details__buttons .action_button.action_button--secondary {\n    border: 1px solid #ff9ac6;\n    color: #ffffff;\n    background: #ff9ac6;\n}"}},"1649999563e1e63f16":{"type":"custom-liquid","settings":{"custom_liquid":"<div id=\"stamped-main-widget\" class=\"mx-0 mb-0\" data-keyword=\"cushing\"><\/div>\n<a href=\"\/products\/st-tropica-hair-vitamins-hair-challenge-2-month-supply\" class=\"button mx-auto\">Order Now<\/a>\n<style>\ndiv.stamped-container[data-widget-style], div[data-widget-style] div.stamped-container {\n    margin: 0px auto!important;\n}\n<\/style>","width":"standard","column__side":"order-0","padding_top":20,"padding_bottom":20,"padding_left":0,"padding_right":0,"animation":"none","css_class":"","custom_css":""}}},"order":["164872987662732b2c","16486356205a406201","1655961732054f7003","1648640448df60772a","164864287453c7f8d9","164864161709cc9c7d","1649999563e1e63f16"]}