{"sections":{"164872987662732b2c":{"type":"specialized__page_header","settings":{"spl_text":"Widely regarded as the Best hair growth vitamins for Covid-19 related hair loss","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"animation":"none","css_class":"","custom_css":".special-head{\n    background-image: url({{ 'trubloom_review_bg.png' | asset_url }});\n    background-size: cover;\n}\n.home-slide-content p {\n    color: #727272;\n    font-size: 18px;\n}\n.home-slide-content h2 {\n    color: #ff9ac6;\n    font-size: 26px;\n}"}},"16486356205a406201":{"type":"specialized__page_top","settings":{"specialized__title":"COVID-19 HAIR LOSS","specialized__top_content":"<p>This last year and half, our world has faced unprecedented times. In spite of that, we've felt extremely lucky to have had our supportive and wonderful ST.TROPICA community. What surprised us over the months was the amount of feedback we received from our truly amazing customers about how our Tru Bloom Vitamins helped them after facing hair-loss due to COVID-19.<\/p><p>With hair loss being one of the lesser known side-effects of COVID-19, we were amazed to find that customers all over the USA and Canada who had experienced hair loss from COVID-19 had noticed improved hair growth after taking the ST.TROPICA Hair Challenge.<\/p>","show__spe__review":true,"specialized__review_title":"Hair is filling in :)","specialized__review_name":"Heather W","specialized__review_img":"shopify:\/\/shop_images\/Heather_W.png","specialized__review_content":"November 1, 2021 I was beside myself from losing clumps after clumps of my thick full beautiful hair.  This was the aftermath from having a bad case of COVID.  My friend told me about these vitamins and I couldn’t be more grateful.  After taking these vitamins for 2 months I can begin to see a difference.  At the roots I no longer have patches of baldness.  I have faith if I continue to take these vitamins I will be back to having normal looking hair. Thank you St. Tropica!","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"review__side":"order-0","animation":"none","css_class":"","custom_css":""}},"165596168792c17c6b":{"type":"specialized__survey_section","settings":{"affiliate_code":"covid","width":"wide","padding_top":70,"padding_bottom":20,"padding_left":0,"padding_right":0,"review__side":"order-0","animation":"none","css_class":"","custom_css":""}},"1648640448df60772a":{"type":"specialized__what_is","settings":{"specialized__what_icon1":"shopify:\/\/shop_images\/covid1.png","specialized__what_title":"What is COVID-19?","specialized__what_content":"<p>The WHO states that COVID-19 can spread several different ways. Typically the virus spreads through droplets produced by an infected person. These droplets, which can range in size from being larger droplets to aerosols, spread COVID-19 when the individual coughs, sneezes, or exhales around others.<\/p><p>The virus is currently thought to be able to spread and travel approximately 1 metre from the infected person in well ventilated areas, though it can travel further than 1 metre in poorly ventilated areas. Infection occurs when a person inhales COVID-19 droplets or the droplets come in contact with the eyes, nose, or mouth.<\/p>","show__sym":false,"specialized__sym_title":"","specialized__sym_content":"","specialized__how_title":"CAN SUPPLEMENTS HELP WITH COVID-19 RELATED HAIR LOSS:","specialized__how_content":"<p>Yes! Supplementing with the right Vitamins can absolutely help. Our celebrated ST. TROPICA Hair Vitamins have already helped many people suffering from COVID-19 related hair loss. Once again, all of the photos and reviews seen here are from our very own customers. They are 100% genuine and authentic, unedited, and unsolicited. They are from REAL people, with REAL results!<\/p><p>ST. TROPICA Hair Growth Vitamins are a different kind of Hair Vitamin. They include 100% or more of the DV (Daily Value) of all the essential hair nutrients, PLUS our Proprietary, highly researched, plant & fruit based HAIR SUPERFOOD formula. We have hand-selected only the best ingredients to create the world's best Hair Vitamins. Our 12 essential hair health ingredients (Vitamins, Protein & Minerals) + 7 exclusive Hair Superfoods help maximize Hair Growth, Strength and Thickness from the inside-out. They are also 100% Drug Free, and Allergen Free.<\/p><p>What’s more is that come with our exclusive 100 DAY MONEY BACK GUARANTEE: Simply take our 60 Day Hair Challenge, and get Longer, Stronger Hair in 60 days flat, or your money back - where will we give you a full refund if you’re not delighted with your results. It's the Ultimate daily Hair Vitamin for extraordinary results, and we’ve made it a no-brainer by including our Ultimate Money-Back Guarantee, ensuring your total satisfaction<\/p>","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"animation":"none","css_class":"","custom_css":""}},"165184107872df69ae":{"type":"specialized__review_slide","blocks":{"7e758282-4d91-457d-bce5-bcfa34f71ea7":{"type":"60day-challenge","settings":{"review__Count1":"true","ch_review_img":"shopify:\/\/shop_images\/Patty_W.png","title":"This product is absolutely amazing","heading":"Patty W","ch_review_content":"I definitely give it 5 star my hair never was thin and falling out until I got Covid this product is absolutely amazing my hair is finally coming back thanks to this product! I would highly recommend this for anyone that is having this issue with there hair before I started using this product there was so much hair in my hands after washing it now there is hardly any in my hands I’m so thankful for St. Tropica!!","review__Count2":"true","ch_review_img2":"shopify:\/\/shop_images\/Kylie_K.png","title2":"I’ll never use anything else!","heading2":"Kylie K","ch_review_content2":"I had Covid at the beginning of the year which caused my hair to fall out by hundreds of pairs a day. Since taking these vitamins my hair fall has stopped and I have had 2 inches of hair growth. My hair quality has improved and I can’t think St Tropica enough for having these Vitamins available. Buy your 60 day supply today and don’t wait. I will provide photos of day one and day 60. The black mark is a pleat in my lab coat for reference of my hair growth. I will continue using these vitamins until I can’t any longer.","review__Count3":"true","ch_review_img3":"shopify:\/\/shop_images\/Blanca_R.png","title3":"Thanks for a wonderful product","heading3":"Blanca R","ch_review_content3":"I bought this vitamins because after I had Covid 19 my hair was falling off. I started this vitamins and before a month my hair stopped falling off. I am so happy and guarantee them . Thanks for a wonderful product.","review__Count4":"true","ch_review_img4":"shopify:\/\/shop_images\/Andrea_M.png","title4":"Best hair vitamins","heading4":"Andrea M","ch_review_content4":"After getting COVID I started to lose my hair at the 3 month marker of being better which is something I found out was common among other people who had gotten it. I didn't know where to turn to till I read the reviews on here. These vitamins are AMAZING, at first I was skeptical but once I started seeing my roots come out and continue to grow I knew I had found the right vitamins to help me get my hair back. The hair that is growing in is filling in any thinning spots I had before and it's coming in thicker than before. As you can see in the pics my part is less visible now and I have gotten a lot of hair growth in the last 60 days. I definitely recommend these vitamins and will be getting more."}},"f5b8a510-52bf-4f02-b1ac-b107369947ca":{"type":"60day-challenge","settings":{"review__Count1":"true","ch_review_img":"shopify:\/\/shop_images\/Claudia_D.png","title":"Excelente","heading":"Claudia D","ch_review_content":"Me dio covid y perdí parte de mi cabello . Ahora con las pastillas he recuperado gran parte de él. Deseo continuar con el tratamiento por unos meses más.","review__Count2":"true","ch_review_img2":"shopify:\/\/shop_images\/Kathy_A.png","title2":"Definitely Helped!","heading2":"Kathy A","ch_review_content2":"Lost tons of hair after recovering from COVID.  These definitely helped!  I still cut to even out due to stringy ends.  I'll take a new photo for start of next round.","review__Count3":"true","ch_review_img3":"shopify:\/\/shop_images\/Mary_B.png","title3":"Thank you.","heading3":"Mary B","ch_review_content3":"I am totally impressed with your product. I am finishing my 3rd month taking this product. Since COVID I have been transitioning to grey hair and I have noticed my hair growing thicker.","review__Count4":"true","ch_review_img4":"shopify:\/\/shop_images\/Nancy_W_d418edb0-0f66-4d37-b172-ba0d572ee6d1.png","title4":"Great Results","heading4":"Nancy W","ch_review_content4":"I was very skeptical but desperate. My hair was so thin even 6 years after chemo. Then I got COVID and even more came out. Bought wigs which looked awful. Saw this add and after 60 days I am amazed! Different color hair and definitely more of it."}}},"block_order":["7e758282-4d91-457d-bce5-bcfa34f71ea7","f5b8a510-52bf-4f02-b1ac-b107369947ca"],"settings":{"specialized__review_title":"","width":"wide","padding_top":20,"padding_bottom":20,"padding_left":0,"padding_right":0,"animation":"none","css_class":"","css_id":"","custom_css":""}},"164864287453c7f8d9":{"type":"index__featured-product","blocks":{"164864287420959887-0":{"type":"title","settings":{}},"164864287420959887-1":{"type":"price","settings":{"display_savings":true}},"164864287420959887-3":{"type":"form","settings":{"show_payment_button":true}}},"block_order":["164864287420959887-0","164864287420959887-1","164864287420959887-3"],"settings":{"affiliate_code":"covid","featured_product":"st-tropica-hair-vitamins-hair-challenge-2-month-supply","product_images_position":"left","set_product_height":false,"product_height":500,"video_looping":false,"gallery_arrows":true,"enable_zoom":true,"enable_product_lightbox":true,"slideshow_speed":0,"slideshow_transition":"slide","display_thumbnails":true,"thumbnail_position":"left-thumbnails","enable_thumbnail_slider":true,"width":"wide","padding_top":60,"padding_bottom":0,"animation":"none","css_class":"","custom_css":".product-gallery__main, .product-gallery__thumbnails.is-slide-nav--true {\n    opacity: 1;\n}"}},"164864161709cc9c7d":{"type":"specialized__page_faqs","blocks":{"76df5224-332e-48a8-b864-2bd3575c8fe2":{"type":"specialized__faqs","settings":{"heading":"What are the symptoms of COVID-19?","specialized__faqs_ans":"<p>COVID-19 symptoms can vary in severity, however it is important to self-isolate even when facing more mild symptoms. The most common initial symptoms often include fever, dry cough, &amp; lethargy\/tiredness.<\/p>\n<b>Other symptoms you may experience are:<\/b>\n<ul class=\"ul-disc\"> <li>headache<\/li> <li>loss of taste or smell<\/li> <li>aches and pains<\/li> <li>sore throat<\/li> <li>conjunctivitis<\/li> <li>diarrhoea<\/li> <li>a rash on skin, or discolouration of fingers or toes<\/li> <li>chest pain (serious symptom)<\/li> <li>loss of speech (serious symptom)<\/li> <li>loss of movement  (serious symptom)<\/li> <li>difficulty breathing (serious symptom)<\/li>\n<\/ul>","faqs__expand":"true"}},"127a006c-5bf0-4a49-8025-deaadfb1b59b":{"type":"specialized__faqs","settings":{"heading":"What should you do if you think you may have contracted COVID-19:","specialized__faqs_ans":"<p>Isolate yourself at home for 14 days to avoid spreading it to others. Contact your local public health authority to find out how to schedule your COVID-19 test.<\/p>","faqs__expand":"false"}},"29429d35-632a-478c-bb32-d275dd0b06cd":{"type":"specialized__faqs","settings":{"heading":"What should you do if you test positive for COVID-19:","specialized__faqs_ans":"<p>Self isolate and avoid direct contact with others. If you feel your symptoms develop and become more serious, contact your health provider so they may recommend the next steps. You may be directed to go to the hospital for further assistance.<\/p>","faqs__expand":"false"}},"5d83fcee-4882-4af5-b72a-5e3e7b47766a":{"type":"specialized__faqs","settings":{"heading":"Does COVID19 cause hair loss?","specialized__faqs_ans":"<p>While there has not been a direct link identified with COVID-19 and hair loss, many health experts have shared that they believe hair loss can be a side-effect caused by stress caused from the virus, specifically from COVID-19 fevers. This kind of hair loss is most commonly known as Telogen Effluvium. Telogen Effluvium (also known as T.E) is a stress related condition. It typically occurs after a stressful life event or illness. Telogen Effluvium typically occurs 2-3 months after a stressful event and can cause a quick onset of hair loss which can be alarming. It can last up to 6-9 months, after which point your hair should resume its normal growth.<\/p>","faqs__expand":"false"}},"d9d078fd-563a-4812-a7c9-10ee2cd22ca0":{"type":"specialized__faqs","settings":{"heading":"Are there treatments for COVID-19 related Telogen Effluvium?","specialized__faqs_ans":"<p>Yes, there are treatment options available, though first you'll want to confirm that your T.E is related to COVID-19 and not an underlying condition or vitamin deficiency. <br role=\"presentation\" data-uw-rm-sr=\"\">\nMany people are also turning to hair supplements to help support their hair growth. These supplements may also help address vitamin deficiencies contributing to your hair loss.<\/p>","faqs__expand":"false"}},"bcf87351-443c-4de1-be53-b09e0843238a":{"type":"specialized__faqs","settings":{"heading":"What else you can do to help support your hair re-growth:","specialized__faqs_ans":"<ul class=\"ul-disc\"> <li>Use gentle hair care products that support healthier hair growth and a balanced scalp<\/li> <li>Apply hot oil treatments weekly to stimulate new hair growth<\/li> <li>Avoid using heat tools, and use heatless styling methods instead<\/li> <li>Avoid hairstyles that tug or pull on the root of your hair<\/li> <li>Take vitamins that are specifically formulated for hair growth<\/li> <li>Incorporate exercises that will help manage your stress (yoga, pilates, and meditation are all great options)<\/li> <li>Eat a diet rich in protein as well as vitamin A, E, B7, C, D, Iron, and Zinc.<\/li>\n<\/ul>","faqs__expand":"false"}},"a33604a7-46ad-4d3f-a5af-9c6ba8d8977a":{"type":"specialized__faqs","settings":{"heading":"Can Supplements Help with COVID-19 Related Hair Loss:","specialized__faqs_ans":"<p>Yes! Supplementing with the right Vitamins can absolutely help.<\/p>\n<p>Our celebrated <a href=\"https:\/\/www.sttropica.com\/collections\/st-tropica-collection\/products\/st-tropica-hair-vitamins-hair-challenge-2-month-supply\" target=\"_blank\" title=\"Tru Bloom Hair Growth Vitamins\" rel=\"noopener noreferrer\">ST. TROPICA Hair Vitamins<\/a> have already helped many people suffering from COVID-19 related hair loss. Once again, all of the photos and reviews seen here are from our very own customers. They are 100% genuine and authentic, unedited, and unsolicited. They are from REAL people, with REAL results.<\/p>\n<p><a href=\"https:\/\/www.sttropica.com\/collections\/st-tropica-collection\/products\/st-tropica-hair-vitamins-hair-challenge-2-month-supply\" target=\"_blank\" title=\"Tru Bloom Hair Growth Vitamins\" rel=\"noopener noreferrer\">ST. TROPICA Hair Growth Vitamins<\/a> are a different kind of Hair Vitamin. They include 100% or more of the DV (Daily Value) of all the essential hair nutrients, PLUS our Proprietary, highly researched, plant &amp; fruit based HAIR SUPERFOOD formula. We have hand-selected only the best ingredients to create the world's best Hair Vitamins. Our 12 essential hair health ingredients (Vitamins, Protein &amp; Minerals) + 7 exclusive Hair Superfoods help maximize Hair Growth, Strength, and Thickness from the inside out. <\/p>\n<p>The Tru Bloom Hair Growth Vitamins are also 100% Drug-Free and Allergen Free. This means that they free of all 8 allergens for Nutritional Supplements, which are wheat, soy, peanuts, dairy, tree nuts, crustaceans, fish, and eggs!<\/p>\n<p>What’s more is that they come with our exclusive 100 DAY MONEY BACK GUARANTEE: Simply take our 60 Day Hair Challenge, and get Longer, Stronger Hair in 60 days flat, or your money back - where will we give you a full refund if you’re not delighted with your results. It's the Ultimate daily Hair Vitamin for extraordinary results, and we’ve made it a no-brainer by including our Ultimate Money-Back Guarantee, ensuring your total satisfaction.<\/p>","faqs__expand":"false"}}},"block_order":["76df5224-332e-48a8-b864-2bd3575c8fe2","127a006c-5bf0-4a49-8025-deaadfb1b59b","29429d35-632a-478c-bb32-d275dd0b06cd","5d83fcee-4882-4af5-b72a-5e3e7b47766a","d9d078fd-563a-4812-a7c9-10ee2cd22ca0","bcf87351-443c-4de1-be53-b09e0843238a","a33604a7-46ad-4d3f-a5af-9c6ba8d8977a"],"settings":{"affiliate_code":"covid","specialized__faqs_title":"COVID-19 FAQ","show__spe__review":true,"specialized__review_title":"Covid hair loss","specialized__review_name":"Christina W","specialized__review_img":"shopify:\/\/shop_images\/Christina_W.png","specialized__review_content":"I lost over 60% of my hair due to Covid. I was devastated and began to use your hair vitamins in January. About two weeks later I began to see changes and now two months later hair is filling in and I am beyond happy. Thank you!!!! You have a long time customer!!","width":"wide","padding_top":60,"padding_bottom":20,"padding_left":0,"padding_right":0,"review__side":"order-0","animation":"none","css_class":"","css_id":"review2","custom_css":".trubloom_review_bg{\n    background-image: url(https:\/\/cdn.shopify.com\/s\/files\/1\/0818\/8965\/t\/96\/assets\/trubloom_review_bg_1.png?v=1648728108);\n    background-size: cover;\n}\n.trubloom_review_bg .purchase-details__buttons .action_button.action_button--secondary {\n    border: 1px solid #ff9ac6;\n    color: #ffffff;\n    background: #ff9ac6;\n}"}},"1649999316bd7506f4":{"type":"custom-liquid","settings":{"custom_liquid":"<div id=\"stamped-main-widget\" class=\"mx-0 mb-0\" data-keyword=\"covid\"><\/div>\n<a href=\"\/products\/st-tropica-hair-vitamins-hair-challenge-2-month-supply\" class=\"button mx-auto\">Order Now<\/a>\n<style>\ndiv.stamped-container[data-widget-style], div[data-widget-style] div.stamped-container {\n    margin: 0px auto!important;\n}\n<\/style>"}}},"order":["164872987662732b2c","16486356205a406201","165596168792c17c6b","1648640448df60772a","165184107872df69ae","164864287453c7f8d9","164864161709cc9c7d","1649999316bd7506f4"]}