{"sections":{"164872987662732b2c":{"type":"specialized__page_header","settings":{"spl_text":"Widely regarded as the Best hair growth vitamins for diabetes related hair loss","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"animation":"none","css_class":"","custom_css":".special-head{\n    background-image: url({{ 'trubloom_review_bg.png' | asset_url }});\n    background-size: cover;\n}\n.home-slide-content p {\n    color: #727272;\n    font-size: 18px;\n}\n.home-slide-content h2 {\n    color: #ff9ac6;\n    font-size: 26px;\n}"}},"16486356205a406201":{"type":"specialized__page_top","settings":{"specialized__title":"DIABETES AND HAIR LOSS","specialized__top_content":"<p>We've been honored to hear from thousands of real customers that our Hair Vitamins have helped them through their hair loss struggles.<\/p><p>People from around the world who've suffered from Diabetes in particular, have been kind enough to submit reviews and results highlighting their positive experiences with ST. TROPICA. And we want to pay it forward by sharing with anyone & everyone who also may be dealing with Diabetes.<\/p><p>Many of us may not know what Diabetes is, and may have concerns over being undiagnosed; or just excited to find a resource focused specifically on Diabetes and hair loss. So let's dive into it.<\/p>","show__spe__review":true,"specialized__review_title":"OMG, this product is amazing","specialized__review_name":"Nina P","specialized__review_img":"shopify:\/\/shop_images\/Nina_Patel.png","specialized__review_content":"OMG, this product is amazing, my hair fell out a few years ago, due to stress and being pre diabetic, well that is what i put it down to. I tried biotine, hair and nail vitamin, but nothing worked. I am amazed by the results, my hair looks thicker and in really good condition, almost feeld like sythetic dolls hair but in a good way. By the way i have hardly any split ends and my hair hardley falls out. i am onto my second bottle and will continue to take these vitamins. Its worth the investments.","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"review__side":"order-0","animation":"none","css_class":"","custom_css":""}},"1655961790a571e76d":{"type":"specialized__survey_section","settings":{"affiliate_code":"diabetes","width":"wide","padding_top":70,"padding_bottom":20,"padding_left":0,"padding_right":0,"review__side":"order-0","animation":"none","css_class":"","custom_css":""}},"1648640448df60772a":{"type":"specialized__what_is","settings":{"specialized__what_icon1":"shopify:\/\/shop_images\/Diabetes1.png","specialized__what_title":"WHAT IS DIABETES?","specialized__what_content":"<p>Diabetes is a type of disease which affects how your body uses blood sugar (glucose). Glucose is the main type of sugar found in the blood. It is important because it is what is used as energy by the cells that make up your muscles and tissues as well as your brains main source of energy.<\/p>","show__sym":false,"specialized__sym_title":"","specialized__sym_content":"","specialized__how_title":"HOW CAN ST. TROPICA HAIR VITAMINS HELP?","specialized__how_content":"<p>We are excited to share that we are constantly receiving incredibly positive feedback, in the form of 5 star photo reviews, from many of our valued customers who are struggling with Diabetes related hair loss; and who are experiencing tremendous results by using our one-of-a-kind Tru Bloom Hair Vitamins. All of the photos and reviews seen here are 100% genuine and authentic, and they are unedited, and unsolicited. In short, they are the real deal.<\/p><p>Tru Bloom Hair Growth Vitamins by ST. TROPICA are a different kind of Hair Vitamin. They include 100% or more of the DV (Daily Value) of all the essential hair nutrients, PLUS our Proprietary, highly researched, plant & fruit based HAIR SUPERFOOD formula. We have hand-selected only the best ingredients to create the world's best Hair Vitamins. Our 12 essential hair health ingredients (Vitamins, Protein & Minerals) + 7 exclusive Hair Superfoods help maximize Hair Growth, Strength and Thickness from the inside-out. They are also 100% Drug Free, and Allergen Free.<\/p><p>What’s more is that they come with an exclusive 100 DAY MONEY BACK GUARANTEE: Simply take our 60 Day Hair Challenge, and get Longer, Stronger Hair in 60 days flat, or your money back - where will we give you a full refund if you’re not delighted with your results. It's the Ultimate daily Hair Vitamin for extraordinary results, and we’ve made it a no-brainer by including our Ultimate Money-Back Guarantee, ensuring your total satisfaction.<\/p>","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"animation":"none","css_class":"","custom_css":""}},"164864287453c7f8d9":{"type":"index__featured-product","blocks":{"164864287420959887-0":{"type":"title","settings":{}},"164864287420959887-1":{"type":"price","settings":{"display_savings":true}},"164864287420959887-3":{"type":"form","settings":{"show_payment_button":true}}},"block_order":["164864287420959887-0","164864287420959887-1","164864287420959887-3"],"settings":{"affiliate_code":"diabetes","featured_product":"st-tropica-hair-vitamins-hair-challenge-2-month-supply","product_images_position":"left","set_product_height":false,"product_height":500,"video_looping":false,"gallery_arrows":false,"enable_zoom":false,"enable_product_lightbox":true,"slideshow_speed":0,"slideshow_transition":"slide","display_thumbnails":true,"thumbnail_position":"left-thumbnails","enable_thumbnail_slider":true,"width":"wide","padding_top":60,"padding_bottom":0,"animation":"none","css_class":"","custom_css":".product-gallery__main, .product-gallery__thumbnails.is-slide-nav--true {\n    opacity: 1;\n}\n.price-ui--loading, .price-ui-badge--loading {\n    opacity: 1;\n}"}},"164864161709cc9c7d":{"type":"specialized__page_faqs","blocks":{"2e06c499-a457-4906-b1c9-fddb9df7d32a":{"type":"specialized__faqs","settings":{"heading":"WHAT CAUSES DIABETES?","specialized__faqs_ans":"<p>The cause of Diabetes is dependent on the type of Diabetes a person has. There are three types of Diabetes which include type 1 Diabetes, type 2 Diabetes, and Gestational Diabetes. All of these forms of Diabetes cause too much sugar in the blood and can lead to serious health issues.<\/p>","faqs__expand":"true"}},"09c49273-7a9a-4545-a258-4f4a4c25812f":{"type":"specialized__faqs","settings":{"heading":"WHAT IS TYPE 1 DIABETES?","specialized__faqs_ans":"<p>Type 1 Diabetes is an autoimmune disease. It occurs when the pancreas produces too little insulin. Insulin is a hormone produced by the pancreas and it is responsible for allowing sugar (glucose) to enter cells in the body to product energy.<\/p>\n<p>The exact cause of type 1 Diabetes is unknown. Though it is thought to be caused by the immune system wrongly attacking the cells in the pancreas. These cells (which are called beta cells) make insulin but when the body destroys them, glucose can no longer be regulated by the body.<\/p>\n<p>There are some Type 1 Diabetes cases that are not caused by an autoimmune response and instead caused by:<\/p>\n<ul class=\"ul-disc\"> <li>Genetics<\/li> <li>Environmental Factors<\/li>\n<\/ul>\n<p>Type 1 Diabetes can occur at any age, however it most commonly occurs in children and adolescents. It is diagnosed most commonly between ages 10 and 16.<\/p>","faqs__expand":"false"}},"4d218776-5284-4632-a294-2021ce771024":{"type":"specialized__faqs","settings":{"heading":"WHAT ARE THE SYMPTOMS OF TYPE 1 DIABETES?","specialized__faqs_ans":"<ul class=\"ul-disc\"> <li>Increased thirst and dry mouth<\/li> <li>Weight loss<\/li> <li>Frequent urination<\/li> <li>Fatigue and tiredness<\/li> <li>Weakness<\/li> <li>Irritability or mood swings<\/li> <li>Persistent hunger<\/li> <li>Blurred vision<\/li> <li>Wetting the bed<\/li>\n<\/ul>","faqs__expand":"false"}},"706f19cc-7006-4f49-9e6d-b3e0a89bcfcf":{"type":"specialized__faqs","settings":{"heading":"IS TYPE 1 DIABETES CURABLE?","specialized__faqs_ans":"<p>No, there is no cure for Type 1 Diabetes. Instead, it must be monitored and treated daily with insulin injections.<\/p>","faqs__expand":"false"}},"866ce29e-1dcf-4e1f-9e48-7ec34198df58":{"type":"specialized__faqs","settings":{"heading":"WHAT IS TYPE 2 DIABETES?","specialized__faqs_ans":"<p>Type 2 Diabetes is the most common kind of Diabetes as it actually accounts for approx. 90% of all cases. With Type 2 Diabetes, the insulin that the pancreas is producing is either not enough to maintain glucose levels or it is being resisted by the body. Type 2 Diabetes is most commonly diagnosed in adults and is typically diagnosed at 45 years old.<\/p>\n<p>There are a few different causes of Type 2 Diabetes which include:<\/p>\n<ul class=\"ul-disc\"> <li>Genetics<\/li> <li>Environmental factors<\/li> <li>Being overweight and inactive<\/li>\n<\/ul>","faqs__expand":"false"}},"a7143a91-7e81-4caf-93bb-9b82669fd895":{"type":"specialized__faqs","settings":{"heading":"WHAT ARE THE SYMPTOMS OF TYPE 2 DIABETES?","specialized__faqs_ans":"<ul class=\"ul-disc\"> <li>Persistent hunger<\/li> <li>Weight loss<\/li> <li>Fatigue<\/li> <li>Blurred vision<\/li> <li>Slow-healing sores<\/li> <li>Frequent infections<\/li> <li>Darkened skin (most often on the armpits and neck)<\/li> <li>Increased thirst<\/li> <li>Frequent urination<\/li>\n<\/ul>","faqs__expand":"false"}},"31ba5d6d-c4d4-485f-bac2-87955f469d02":{"type":"specialized__faqs","settings":{"heading":"IS TYPE 2 DIABETES CURABLE?","specialized__faqs_ans":"<p>No, Type 2 Diabetes is not curable - though it has been shown to be reversible. Through healthy diet changes, exercise, and weight-loss, some have found they have been able to reach and maintain normal blood sugar levels without medication. While this does not mean that you're cured, it is a great way to take care of your diabetes and ensure it does not get worse.<\/p>\n<p>It is important to know that Type 2 Diabetes is an ongoing disease that requires a thoughtful treatment plan that includes a healthy lifestyle. If diet and exercise are not enough to manage a persons blood sugar, then they may also need to include medications or insulin therapy into their treatment plan.<\/p>","faqs__expand":"false"}},"5d361d99-3167-4fea-8253-7d93f4d4636b":{"type":"specialized__faqs","settings":{"heading":"WHAT IS GESTATIONAL DIABETES?","specialized__faqs_ans":"<p>Gestational Diabetes is diagnosed during pregnancy and like other types of diabetes, it affects how your body uses glucose. Gestational Diabetes causes a number of symptoms, but mainly it causes high blood sugar which can affect both your pregnancy as well as your baby's health.<\/p>\n<p>Approximately 2-5% of pregnant women develop Gestational Diabetes, and this number increases to 7-9% of mothers who have markers of other risk factors such as family history, weight, inactivity, PCOS, and age.<\/p>\n<p>While the exact cause of Gestational Diabetes is unknown, it is thought that excess weight prior to becoming pregnant could be a leading cause. Many hormones change in the body during pregnancy and this can make it more challenging for the body to process blood sugar. This could make your blood sugar levels rise and cause Gestational Diabetes.<\/p>\n<p>New mothers will be tested for Gestational Diabetes typically between the 24th and 28th week of pregnancy.<\/p>\n<p>If Gestational Diabetes goes untreated, it can cause a number of complications which include:<\/p>\n<ul class=\"ul-disc\">\n\t<li>Excessive birth weight<\/li>\n\t<li>Premature birth<\/li>\n\t<li>Low Blood Sugar (Hypoglycemia) in both the mother and baby<\/li>\n\t<li>Respiratory distress syndrome<\/li>\n\t<li>Stillbirth<\/li>\n\t<li>High blood pressure and preeclampsia (in the mother)<\/li>\n\t<li>Less likely to have a natural birth and may need to have a C-section<\/li>\n\t<li>More likely to have Gestational Diabetes in future pregnancies<\/li>\n\t<li>More likely to develop Type 2 Diabetes<\/li>\n<\/ul>","faqs__expand":"false"}},"9b1f0941-e638-4e70-ac3b-552da1a59693":{"type":"specialized__faqs","settings":{"heading":"WHAT ARE THE SYMPTOMS OF GESTATIONAL DIABETES?","specialized__faqs_ans":"<ul class=\"ul-disc\"> <li>Increased thirst<\/li> <li>Frequent urination<\/li> <li>Sugar in urine<\/li> <li>Fatigue<\/li> <li>Nausea<\/li> <li>Frequent infections (vaginal, bladder, and skin)<\/li> <li>Blurred vision<\/li>\n<\/ul>","faqs__expand":"false"}},"57d13043-91b2-4fa6-bbe1-c142edb96446":{"type":"specialized__faqs","settings":{"heading":"IS GESTATIONAL DIABETES CURABLE?","specialized__faqs_ans":"<p>Like Type 2 Diabetes, Gestational Diabetes requires a healthy treatment plan in order to get symptoms under control. This will often be done through a healthy diet and exercise plan, but sometimes oral medications or insulin injections could be required.<\/p>","faqs__expand":"false"}},"abb79dc8-85e7-4147-974b-731365f0788c":{"type":"specialized__faqs","settings":{"heading":"IS DIABETES PREVENTABLE?","specialized__faqs_ans":"<p>As of today, Type 1 Diabetes is not preventable however researchers are looking to understand what truly causes Type 1 Diabetes, what triggers it, and how we can prevent it in the future.<\/p>\n<p>However, Type 2 Diabetes and Gestational Diabetes often are preventable. Maintaining a healthy lifestyle, diet, and exercise routine is often enough to prevent Type 2 Diabetes and Gestational Diabetes.<\/p>\n<p>In particular, Gestational Diabetes can be prevented by starting your pregnancy at a healthy weight and following the weight recommendations from your doctor throughout your pregnancy.<\/p>","faqs__expand":"false"}},"e0525fa4-eda4-4d7b-b16b-ecb2e0753f87":{"type":"specialized__faqs","settings":{"heading":"CAN DIABETES CAUSE BALDING?","specialized__faqs_ans":"<p>Yes, for those who have Type 1 Diabetes or Type 2 Diabetes, hair loss or hair thinning may be symptom they experience over time.<\/p>\n<p>Diabetes can disrupt the hair growth process and can slow down the natural growth cycle for your hair. This means you may find you lose more hair than usual or that your hair simply doesn't get as long as it once did.<\/p>\n<p>While those with Diabetes may lose their hair due to their condition, it can also be a side-effect of stress which is why its very important to incorporate some kind of de-stressing routine into your Diabetes treatment plan.<\/p>\n<p>Here are a few lifestyle changes you can make to support your hair health:<\/p>\n<ul class=\"ul-disc\"> <li>Use a satin pillow case<\/li> <li>Use hot oil treatments and\/or hair masks<\/li> <li>Limit the use of heat tools on your hair<\/li> <li>Avoid hairstyles that pull on the root of your hair<\/li> <li>Take supplements that support hair growth<\/li>\n<\/ul>","faqs__expand":"false"}},"2b17f548-d618-48ca-97b4-61437bb4d8cc":{"type":"specialized__faqs","settings":{"heading":"CAN VITAMINS HELP WITH DIABETES HAIR LOSS?","specialized__faqs_ans":"<p>Yes! Supplementing with the right Vitamins can absolutely help.<\/p>\n<p>Our celebrated <a href=\"https:\/\/www.sttropica.com\/collections\/st-tropica-collection\/products\/st-tropica-hair-vitamins-hair-challenge-2-month-supply\" target=\"_blank\" title=\"Tru Bloom Hair Growth Vitamins\" rel=\"noopener noreferrer\">ST. TROPICA Hair Vitamins<\/a> have already helped many people suffering from Diabetes related hair loss. Once again, all of the photos and reviews seen here are from our very own customers. They are 100% genuine and authentic, unedited, and unsolicited. They are from REAL people, with REAL results.<\/p>\n<p><a href=\"https:\/\/www.sttropica.com\/collections\/st-tropica-collection\/products\/st-tropica-hair-vitamins-hair-challenge-2-month-supply\" target=\"_blank\" title=\"Tru Bloom Hair Growth Vitamins\" rel=\"noopener noreferrer\">ST. TROPICA Hair Growth Vitamins<\/a> are a different kind of Hair Vitamin. They include 100% or more of the DV (Daily Value) of all the essential hair nutrients, PLUS our Proprietary, highly researched, plant &amp; fruit based HAIR SUPERFOOD formula. We have hand-selected only the best ingredients to create the world's best Hair Vitamins. Our 12 essential hair health ingredients (Vitamins, Protein &amp; Minerals) + 7 exclusive Hair Superfoods help maximize Hair Growth, Strength, and Thickness from the inside out. <\/p>\n<p>The Tru Bloom Hair Growth Vitamins are also 100% Drug-Free and Allergen Free. This means that they free of all 8 allergens for Nutritional Supplements, which are wheat, soy, peanuts, dairy, tree nuts, crustaceans, fish, and eggs!<\/p>\n<p>What’s more is that they come with our exclusive 100 DAY MONEY BACK GUARANTEE: Simply take our 60 Day Hair Challenge, and get Longer, Stronger Hair in 60 days flat, or your money back - where will we give you a full refund if you’re not delighted with your results. It's the Ultimate daily Hair Vitamin for extraordinary results, and we’ve made it a no-brainer by including our Ultimate Money-Back Guarantee, ensuring your total satisfaction.<\/p>","faqs__expand":"false"}}},"block_order":["2e06c499-a457-4906-b1c9-fddb9df7d32a","09c49273-7a9a-4545-a258-4f4a4c25812f","4d218776-5284-4632-a294-2021ce771024","706f19cc-7006-4f49-9e6d-b3e0a89bcfcf","866ce29e-1dcf-4e1f-9e48-7ec34198df58","a7143a91-7e81-4caf-93bb-9b82669fd895","31ba5d6d-c4d4-485f-bac2-87955f469d02","5d361d99-3167-4fea-8253-7d93f4d4636b","9b1f0941-e638-4e70-ac3b-552da1a59693","57d13043-91b2-4fa6-bbe1-c142edb96446","abb79dc8-85e7-4147-974b-731365f0788c","e0525fa4-eda4-4d7b-b16b-ecb2e0753f87","2b17f548-d618-48ca-97b4-61437bb4d8cc"],"settings":{"affiliate_code":"diabetes","specialized__faqs_title":"DIABETES FAQ","show__spe__review":true,"specialized__review_title":"Still in the process","specialized__review_name":"Helen D","specialized__review_img":"shopify:\/\/shop_images\/Helen_D.png","specialized__review_content":"I honestly like that it does not mess with my stomach or makes me breakout. However, I have been using it for over 60 days and now on the second bottle and have seen results. Not saying that it can't work. We all are different and it can take time. I am diabetic and it could be the medications I take which is slowing the process.","width":"wide","padding_top":60,"padding_bottom":20,"padding_left":0,"padding_right":0,"review__side":"order-0","animation":"none","css_class":"","css_id":"review2","custom_css":".trubloom_review_bg{\n    background-image: url(https:\/\/cdn.shopify.com\/s\/files\/1\/0818\/8965\/t\/96\/assets\/trubloom_review_bg_1.png?v=1648728108);\n    background-size: cover;\n}\n.trubloom_review_bg .purchase-details__buttons .action_button.action_button--secondary {\n    border: 1px solid #ff9ac6;\n    color: #ffffff;\n    background: #ff9ac6;\n}"}},"1649999616b8362c52":{"type":"custom-liquid","settings":{"custom_liquid":"<div id=\"stamped-main-widget\" class=\"mx-0 mb-0\" data-keyword=\"diabetic\"><\/div>\n<a href=\"\/products\/st-tropica-hair-vitamins-hair-challenge-2-month-supply\" class=\"button mx-auto\">Order Now<\/a>\n<style>\ndiv.stamped-container[data-widget-style], div[data-widget-style] div.stamped-container {\n    margin: 0px auto!important;\n}\n<\/style>"}}},"order":["164872987662732b2c","16486356205a406201","1655961790a571e76d","1648640448df60772a","164864287453c7f8d9","164864161709cc9c7d","1649999616b8362c52"]}