{"sections":{"164872987662732b2c":{"type":"specialized__page_header","settings":{"spl_text":"Widely regarded as the Best hair growth vitamins for GASTRIC SLEEVE SURGERY Related Hair Loss","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"animation":"none","css_class":"","custom_css":".special-head{\n    background-image: url({{ 'trubloom_review_bg.png' | asset_url }});\n    background-size: cover;\n}\n.home-slide-content p {\n    color: #727272;\n    font-size: 18px;\n}\n.home-slide-content h2 {\n    color: #ff9ac6;\n    font-size: 26px;\n}"}},"16486356205a406201":{"type":"specialized__page_top","settings":{"specialized__title":"GASTRIC SLEEVE SURGERY AND HAIR LOSS","specialized__top_content":"<p>We've been honored to hear from thousands of real customers that our Hair Vitamins have helped them through their hair loss struggles.<\/p><p>People from around the world who've suffered from Gastric Sleeve Surgery in particular, have been kind enough to submit reviews and results highlighting their positive experiences with ST. TROPICA. And we want to pay it forward by sharing with anyone & everyone who also may be dealing with Gastric Sleeve Surgery.<\/p><p>Many of us may not know what Gastric Sleeve Surgery is, and may have concerns over being undiagnosed; or just excited to find a resource focused specifically on Gastric Sleeve Surgery and hair loss. So let's dive into it.<\/p>","show__spe__review":true,"specialized__review_title":"I highly recommend this product!","specialized__review_name":"Shannon A","specialized__review_img":"shopify:\/\/shop_images\/Shannon_A.png","specialized__review_content":"In 2005, I had gastric bypass surgery, and one of the side effects was hair loss and thinning. Nothing I have tried in the past worked, so I thought I was just going to have to live with it the rest of my life, until I saw an ad on Facebook for this product and thought I didn't have anything to lose. My hair has grown 1 1\/2 inches in the 60 days, and I have all these new hairs growing all over my scalp (all gray LOL but that's okay)! You can clearly see how my hair part has filled in. I already ordered another 60-day supply a couple of weeks ago because I wanted to keep my regime up. I highly recommend this product!","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"review__side":"order-0","animation":"none","css_class":"","custom_css":""}},"16559618270c9d0661":{"type":"specialized__survey_section","settings":{"affiliate_code":"gastric","width":"wide","padding_top":70,"padding_bottom":20,"padding_left":0,"padding_right":0,"review__side":"order-0","animation":"none","css_class":"","custom_css":""}},"1648640448df60772a":{"type":"specialized__what_is","settings":{"specialized__what_icon1":"shopify:\/\/shop_images\/Gastric1.png","specialized__what_title":"WHAT IS A GASTRIC SLEEVE SURGERY?","specialized__what_content":"<p>Gastric Sleeve Surgery (also known as Vertical Sleeve Gastrectomy) is a medical procedure known as a bariatric surgery that removes 75-80% of the stomach. It is a weight-loss surgery that typically results in an initial weight loss of 50 to 90 lbs.<\/p><p>The primary reason Gastric Sleeve Surgery is for weight loss and to reduce a persons risk of life-threatening conditions causes by weight. These conditions include heart disease, high blood pressure, high cholesterol, type 2 diabetes, stroke, and more.<\/p><p>This is a laparoscopic surgery which means the incisions made in order to preform the surgery are very small. Surgeons use small instruments to make small incisions in the abdomen and to remove part of the stomach. The final result of the Gastric Sleeve Surgery is to have a smaller tube-like shaped stomach.<\/p>","show__sym":false,"specialized__sym_title":"","specialized__sym_content":"","specialized__how_title":"HOW CAN ST. TROPICA HAIR VITAMINS HELP?","specialized__how_content":"<p>We are excited to share that we are constantly receiving incredibly positive feedback, in the form of 5 star photo reviews, from many of our valued customers who are struggling with Gastric Sleeve Surgery related hair loss; and who are experiencing tremendous results by using our one-of-a-kind Tru Bloom Hair Vitamins. All of the photos and reviews seen here are 100% genuine and authentic, and they are unedited, and unsolicited. In short, they are the real deal.<\/p><p>Tru Bloom Hair Growth Vitamins by ST. TROPICA are a different kind of Hair Vitamin. They include 100% or more of the DV (Daily Value) of all the essential hair nutrients, PLUS our Proprietary, highly researched, plant & fruit based HAIR SUPERFOOD formula. We have hand-selected only the best ingredients to create the world's best Hair Vitamins. Our 12 essential hair health ingredients (Vitamins, Protein & Minerals) + 7 exclusive Hair Superfoods help maximize Hair Growth, Strength and Thickness from the inside-out. They are also 100% Drug Free, and Allergen Free.<\/p><p>What’s more is that they come with an exclusive 100 DAY MONEY BACK GUARANTEE: Simply take our 60 Day Hair Challenge, and get Longer, Stronger Hair in 60 days flat, or your money back - where will we give you a full refund if you’re not delighted with your results. It's the Ultimate daily Hair Vitamin for extraordinary results, and we’ve made it a no-brainer by including our Ultimate Money-Back Guarantee, ensuring your total satisfaction.<\/p>","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"animation":"none","css_class":"","custom_css":""}},"1648645038b9435b55":{"type":"specialized__review_slide","blocks":{"c38ea7b4-de94-4466-91c3-a943b63e84cf":{"type":"60day-challenge","settings":{"review__Count1":"false","title":"","heading":"","ch_review_content":"","review__Count2":"false","title2":"","heading2":"","ch_review_content2":"","review__Count3":"true","ch_review_img3":"shopify:\/\/shop_images\/Shannon.png","title3":"RESULTS AFTER 120 DAYS","heading3":"Shannon","ch_review_content3":"I'll let the photos speak for themselves. I had Gastric Bypass Surgery in 2005 and as a result had thinning hair where my scalp was visible. I learned how to style my hair so it wasn't super noticeable but basically resigned myself to never having the full head of hair I used to have. Hey, I lost 140 lbs overall and was fine with the trade-off! I started taking St. Tropica in March and since then I had quite a bit of new hair growth seen at my part, and my overall length over the 4 months was 4\" - being that my hair typically grows less than 1\/2\" a month that is more than double! Very satisfied with this product :)","review__Count4":"true","ch_review_img4":"shopify:\/\/shop_images\/Sherry_Beckwith.png","title4":"THE GROWTH WAS SO FAST!","heading4":"Sherry B","ch_review_content4":"I had thinning hair after Gastric Sleeve Surgery. I tried collagen and biotin supplements with unnoticeable results. I purchased my first 60 days and the day I started got hair extensions. My hairdresser actually had to take them out early because the growth was so fast! I feel like regrowth has thickened areas I had lost. My photos are before and after (taken without any extensions) the last photos are of growth with extension in. You can see how long on measuring tape! This was nine weeks after starting!! I am ecstatic! Thank you St Tropica!"}},"2aac819e-77c5-4603-b09d-2199fd49ef8f":{"type":"60day-challenge","settings":{"review__Count1":"true","ch_review_img":"shopify:\/\/shop_images\/Jennifer_M_1.png","title":"I would recommend this product","heading":"Jennifer M","ch_review_content":"This is the ONLY product that has helped grow my hair back after bariatric surgery. My hair had gotten so thin. I have tons of new hair growth now. I would recommend this product to anyone who has thinning hair.","review__Count2":"false","title2":"","heading2":"","ch_review_content2":"","review__Count3":"true","ch_review_img3":"shopify:\/\/shop_images\/Emily_C.png","title3":"here are my results!!","heading3":"Emily C","ch_review_content3":"actually on my 3rd bottle and kept forgetting to do a before and after shot of my hair. Initially I was skeptical about them! I found this product through an Instagram influencer, Kindketomomma and my girlfriend and I both bought it at the sane time. Let me tell you, I love love love! These vitamins. Why? Well, about 2 years ago I had the gastric sleeve surgery. I was completely loosing chunks of my hair, due to lack of vitamins! Tried them and they have worked great for me! As mentioned earlier, I’m literally on my 3rd bottle! Sadly I didn’t submit prior photos! But here are my results!!","review__Count4":"true","ch_review_img4":"shopify:\/\/shop_images\/Krstyna_H.png","title4":"helped me to improve my hair","heading4":"Krstyna H","ch_review_content4":"I lost 70% of my hair after bariatric surgery. Whatever left was very thin and looked horrible. Those vitamins helped me to improve my hair"}}},"block_order":["c38ea7b4-de94-4466-91c3-a943b63e84cf","2aac819e-77c5-4603-b09d-2199fd49ef8f"],"settings":{"specialized__review_title":"REAL PEOPLE WITH REAL RESULTS","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"animation":"none","css_class":"","css_id":"","custom_css":""}},"164864287453c7f8d9":{"type":"index__featured-product","blocks":{"164864287420959887-0":{"type":"title","settings":{}},"164864287420959887-1":{"type":"price","settings":{"display_savings":true}},"164864287420959887-3":{"type":"form","settings":{"show_payment_button":true}}},"block_order":["164864287420959887-0","164864287420959887-1","164864287420959887-3"],"settings":{"affiliate_code":"gastric","featured_product":"st-tropica-hair-vitamins-hair-challenge-2-month-supply","product_images_position":"left","set_product_height":false,"product_height":500,"video_looping":false,"gallery_arrows":true,"enable_zoom":true,"enable_product_lightbox":true,"slideshow_speed":0,"slideshow_transition":"slide","display_thumbnails":true,"thumbnail_position":"left-thumbnails","enable_thumbnail_slider":true,"width":"wide","padding_top":60,"padding_bottom":0,"animation":"none","css_class":"","custom_css":".product-gallery__main, .product-gallery__thumbnails.is-slide-nav--true {\n    opacity: 1;\n}"}},"164864161709cc9c7d":{"type":"specialized__page_faqs","blocks":{"39707db5-9ba9-453a-9e70-4729a4e04efc":{"type":"specialized__faqs","settings":{"heading":"WHAT IS A BARIATRIC PROCEDURE?","specialized__faqs_ans":"<p>A bariatric procedure is any operation that makes changes to the digestive system with the goal of weight loss.<\/p>\n<p>A few types of bariatric surgeries include:<\/p>\n<ul class=\"ul-disc\"> <li>Gastric Bypass<\/li> <li>Gastric Band<\/li> <li>Gastric Sleeve Surgery (this is the most common weight loss surgery in the United States)<\/li>\n<\/ul>","faqs__expand":"true"}},"448ba734-3102-48e0-bfcc-7b4025334451":{"type":"specialized__faqs","settings":{"heading":"WHAT ARE THE BENEFITS OF BARIATRIC SURGERY?","specialized__faqs_ans":"<p>Bariatric surgeries like Gastric Bypass, Gastric Band, and Gastric sleeve help with weight loss and can often improve many of the health concerns caused or related to obesity. Here are a few health concerns that could be positively impacted by bariatric surgery:<\/p>\n<ul class=\"ul-disc\"> <li>Type 2 Diabetes<\/li> <li>Heart disease<\/li> <li>High blood pressure<\/li> <li>Cholesterol levels<\/li> <li>Knee, hip, and back pain or soreness<\/li> <li>Sleep apnea<\/li>\n<\/ul>\n<p>Following bariatric surgeries and recovery, patients often find they are able to be more physically active and maintain a healthier lifestyle.<\/p>","faqs__expand":"false"}},"bb8b48ed-1719-4ff1-8160-e99c83314852":{"type":"specialized__faqs","settings":{"heading":"ARE THERE RISKS ASSOCIATED TO GASTRIC SLEEVE SURGERY?","specialized__faqs_ans":"<p>Yes there are some risks associated with the Gastric Sleeve Surgery, they include:<\/p>\n<p><b>DURING SURGERY:<\/b><\/p>\n<ul class=\"ul-disc\">\n\t<li>Reactions to anesthesia<\/li>\n\t<li>Blood clots<\/li>\n\t<li>Breathing issues<\/li>\n\t<li>Leaks from exposed sections of the stomach<\/li>\n<\/ul>\n<p><b>LONGER TERM ISSUES YOU COULD EXPERIENCE WITH GASTRIC SLEEVE SURGERY INCLUDE:<\/b><\/p>\n<ul class=\"ul-disc\">\n\t<li>GI Tract Obstructions<\/li>\n\t<li>Malnutrition<\/li>\n\t<li>Vomiting<\/li>\n\t<li>Hernias<\/li>\n\t<li>Hypoglycaemia<\/li>\n<\/ul>\n<p><b>AFTER SURGERY YOU MAY EXPERIENCE:<\/b><\/p>\n<p>The short term discomforts you may experience following your Gastric Sleeve Surgery include:<\/p>\n<ul class=\"ul-disc\"> <li>Body aches and pains<\/li> <li>Feeling tired and\/or lethargic<\/li> <li>Feeling cold<\/li> <li>Dry skin<\/li> <li>Hair thinning and hair loss<\/li>\n<\/ul>","faqs__expand":"false"}},"3881885b-31ef-4949-8062-6e59e17ac92c":{"type":"specialized__faqs","settings":{"heading":"HOW LONG DOES HAIR LOSS LAST AFTER GASTRIC SLEEVE SURGERY?","specialized__faqs_ans":"<p>Hair loss is one of the more common initial symptoms following Gastric Sleeve Surgery. However, it should not be a long-term issue.<\/p>\n<p>Most often, people experience hair loss about 3-6 months following their surgery. After surgery, your body may take time adjusting to changes and hair loss can occur, however hair growth should resume its normal rate as your body begins to regulate.<\/p>\n<p>During this time though, it is important to address any nutritional deficiencies and ensure you're consuming protein regularly. Nutritional deficiencies can cause hair loss and slow hair growth.<\/p>","faqs__expand":"false"}},"7e6c4406-57f2-47fd-b85e-f7db7223268c":{"type":"specialized__faqs","settings":{"heading":"CAN VITAMINS HELP WITH GASTRIC SLEEVE SURGERY HAIR LOSS?","specialized__faqs_ans":"<p>Yes! Supplementing with the right Vitamins can absolutely help.<\/p>\n<p>Our celebrated <a href=\"https:\/\/www.sttropica.com\/collections\/st-tropica-collection\/products\/st-tropica-hair-vitamins-hair-challenge-2-month-supply\" target=\"_blank\" title=\"Tru Bloom Hair Growth Vitamins\" rel=\"noopener noreferrer\">ST. TROPICA Hair Vitamins<\/a> have already helped many people suffering from Gastric Sleeve Surgery related hair loss. Once again, all of the photos and reviews seen here are from our very own customers. They are 100% genuine and authentic, unedited, and unsolicited. They are from REAL people, with REAL results.<\/p>\n<p><a href=\"https:\/\/www.sttropica.com\/collections\/st-tropica-collection\/products\/st-tropica-hair-vitamins-hair-challenge-2-month-supply\" target=\"_blank\" title=\"Tru Bloom Hair Growth Vitamins\" rel=\"noopener noreferrer\">ST. TROPICA Hair Growth Vitamins<\/a> are a different kind of Hair Vitamin. They include 100% or more of the DV (Daily Value) of all the essential hair nutrients, PLUS our Proprietary, highly researched, plant &amp; fruit based HAIR SUPERFOOD formula. We have hand-selected only the best ingredients to create the world's best Hair Vitamins. Our 12 essential hair health ingredients (Vitamins, Protein &amp; Minerals) + 7 exclusive Hair Superfoods help maximize Hair Growth, Strength, and Thickness from the inside out. <\/p>\n<p>The Tru Bloom Hair Growth Vitamins are also 100% Drug-Free and Allergen Free. This means that they free of all 8 allergens for Nutritional Supplements, which are wheat, soy, peanuts, dairy, tree nuts, crustaceans, fish, and eggs!<\/p>\n<p>What’s more is that they come with our exclusive 100 DAY MONEY BACK GUARANTEE: Simply take our 60 Day Hair Challenge, and get Longer, Stronger Hair in 60 days flat, or your money back - where will we give you a full refund if you’re not delighted with your results. It's the Ultimate daily Hair Vitamin for extraordinary results, and we’ve made it a no-brainer by including our Ultimate Money-Back Guarantee, ensuring your total satisfaction.<\/p>","faqs__expand":"false"}}},"block_order":["39707db5-9ba9-453a-9e70-4729a4e04efc","448ba734-3102-48e0-bfcc-7b4025334451","bb8b48ed-1719-4ff1-8160-e99c83314852","3881885b-31ef-4949-8062-6e59e17ac92c","7e6c4406-57f2-47fd-b85e-f7db7223268c"],"settings":{"affiliate_code":"gastric","specialized__faqs_title":"GASTRIC SLEEVE SURGERY FAQ","show__spe__review":true,"specialized__review_title":"I NOTICED A HUGE DIFFERENCE","specialized__review_name":"Jennifer Z","specialized__review_img":"shopify:\/\/shop_images\/Jennifer_Z.png","specialized__review_content":"Hello, I would just like to say that I love this product. I ordered the 2 month supply of the hair vitamins and I noticed a huge difference. I had gastric bypass surgery so hair loss was a side effect and it was causing me depression because I was getting bald spots, but these vitamins are the real deal. I will attach some before and afters.","width":"wide","padding_top":60,"padding_bottom":20,"padding_left":0,"padding_right":0,"review__side":"order-0","animation":"none","css_class":"","css_id":"review2","custom_css":".trubloom_review_bg{\n    background-image: url(https:\/\/cdn.shopify.com\/s\/files\/1\/0818\/8965\/t\/96\/assets\/trubloom_review_bg_1.png?v=1648728108);\n    background-size: cover;\n}\n.trubloom_review_bg .purchase-details__buttons .action_button.action_button--secondary {\n    border: 1px solid #ff9ac6;\n    color: #ffffff;\n    background: #ff9ac6;\n}"}},"164999976082129f28":{"type":"custom-liquid","settings":{"custom_liquid":"<div id=\"stamped-main-widget\" class=\"mx-0 mb-0\" data-keyword=\"gastric\"><\/div>\n<a href=\"\/products\/st-tropica-hair-vitamins-hair-challenge-2-month-supply\" class=\"button mx-auto\">Order Now<\/a>\n<style>\ndiv.stamped-container[data-widget-style], div[data-widget-style] div.stamped-container {\n    margin: 0px auto!important;\n}\n<\/style>"}}},"order":["164872987662732b2c","16486356205a406201","16559618270c9d0661","1648640448df60772a","1648645038b9435b55","164864287453c7f8d9","164864161709cc9c7d","164999976082129f28"]}