{"sections":{"164872987662732b2c":{"type":"specialized__page_header","settings":{"spl_text":"Widely regarded as the Best hair growth vitamins for Depression Related Hair Loss","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"animation":"none","css_class":"","custom_css":".special-head{\n    background-image: url({{ 'trubloom_review_bg.png' | asset_url }});\n    background-size: cover;\n}\n.home-slide-content p {\n    color: #727272;\n    font-size: 18px;\n}\n.home-slide-content h2 {\n    color: #ff9ac6;\n    font-size: 26px;\n}"}},"16486356205a406201":{"type":"specialized__page_top","settings":{"specialized__title":"Depression and Hair Loss","specialized__top_content":"<p>We've been honored to hear from thousands of real customers that our Hair Vitamins have helped them through their hair loss struggles.<br\/><br\/>People from around the world who've suffered from Depression in particular, have been kind enough to submit reviews and results highlighting their positive experiences with ST. TROPICA. And we want to pay it forward by sharing with anyone & everyone who also may be dealing with Depression.<br\/><br\/>Many of us may not know how Depression can impact our health and hair, and may have concerns over being undiagnosed; or just happy to find a resource focused specifically on Depression and hair loss. So let's dive into it.<\/p>","show__spe__review":true,"specialized__review_title":"I love this product","specialized__review_name":"Jennifer Z","specialized__review_img":"shopify:\/\/shop_images\/Jennifer_Z_1d3b214d-2f0b-45d5-b121-a7bfb2dcde39.png","specialized__review_content":"Hello, I would just like to say that I love this product. I ordered the 2 month supply of the hair vitamins and I noticed a huge difference. I had gastric bypass surgery so hair loss was a side effect and it was causing me depression because I was getting bald spots, but these vitamins are the real deal. I will attach some before and afters.","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"review__side":"order-0","animation":"none","css_class":"","custom_css":""}},"1655961790a571e76d":{"type":"specialized__survey_section","settings":{"affiliate_code":"depression","width":"wide","padding_top":70,"padding_bottom":20,"padding_left":0,"padding_right":0,"review__side":"order-0","animation":"none","css_class":"","custom_css":""}},"1648640448df60772a":{"type":"specialized__what_is","settings":{"specialized__what_icon1":"shopify:\/\/shop_images\/Diabetes1.png","specialized__what_title":"Can Depression cause hair loss?","specialized__what_content":"<p>Depression affects millions of people around the world. While it may not always directly result in hair loss, the effects of depression can be far reaching and unique to each individual. Depression often goes hand in hand with stress, and stress is known to cause hair loss. This type of hair loss is known as Telogen Effluvium. <a href=\"https:\/\/www.sttropica.com\/pages\/telogen-effluvium-hair-loss\" target=\"_blank\" title=\"Telogen Effluvium Hair Loss \">Telogen Effluvium <\/a>is a temporary form of hair loss that typically occurs after a traumatic or stressful event has taken place. It often corrects itself within approximately 6 months.Depression may also trigger stress-related hair loss habits and disorders such as Trichotillomania. Also, stress can cause inflammation in the body and may onset hair loss symptoms for illnesses such as<a href=\"https:\/\/www.sttropica.com\/pages\/alopecia-hair-loss\" target=\"_blank\" title=\"Alopecia Hair Loss\"> Alopecia Areata<\/a>.<\/p>","show__sym":false,"specialized__sym_title":"","specialized__sym_content":"","specialized__how_title":"HOW CAN ST. TROPICA HAIR VITAMINS HELP?","specialized__how_content":"<p>We are excited to share that we are constantly receiving incredibly positive feedback, in the form of 5 star photo reviews, from many of our valued customers who are struggling with Depression-related hair loss; and who are experiencing tremendous results by using our one-of-a-kind Tru Bloom Hair Vitamins. All of the photos and reviews seen here are 100% genuine and authentic, and they are unedited, and unsolicited. In short, they are the real deal.<\/p><p>Tru Bloom Hair Growth Vitamins by ST. TROPICA are a different kind of Hair Vitamin. They include 100% or more of the DV (Daily Value) of all the essential hair nutrients, PLUS our Proprietary, highly researched, plant & fruit based HAIR SUPERFOOD formula. We have hand-selected only the best ingredients to create the world's best Hair Vitamins. Our 12 essential hair health ingredients (Vitamins, Protein & Minerals) + 7 exclusive Hair Superfoods help maximize Hair Growth, Strength and Thickness from the inside-out. They are also 100% Drug Free, and Allergen Free.<\/p><p>What’s more is that they come with an exclusive 100 DAY MONEY BACK GUARANTEE: Simply take our 60 Day Hair Challenge, and get Longer, Stronger Hair in 60 days flat, or your money back - where will we give you a full refund if you’re not delighted with your results. It's the Ultimate daily Hair Vitamin for extraordinary results, and we’ve made it a no-brainer by including our Ultimate Money-Back Guarantee, ensuring your total satisfaction.<\/p>","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"animation":"none","css_class":"","custom_css":""}},"16641959557afda940":{"type":"specialized__review_slide","blocks":{"834c40c6-e8b8-4a03-bec8-82df3f67b542":{"type":"60day-challenge","settings":{"review__Count1":"true","ch_review_img":"shopify:\/\/shop_images\/Monica_P.png","title":"Pictures Cannot Capture The Truth","heading":"Monica P","ch_review_content":"Let's face it, I have very little hair. My hair started falling out when I started going through puberty at age 12. I'm now 44. I've tried many many different products that \"guarantee\" that I'd grow my hair, but sadly none worked. \nWhen I came across a Facebook ad for St. Tropica with pictures of those with hypothyroidism. (At that point, I hadn't even thought about my hypothyroidism being part of the problem.) I was looking into semi permanent wigs. I had just completely given up on my hair. I felt it was useless, but decided to give the challenge a try. \nI'm so glad I did!! Pictures really cannot capture the improvement because of how little hair I have. I have gotten new growth often however it always stops at a certain point & in just the same random spots. Usually falling out. Now with St. Tropica in about 2 weeks, I had new growth ALL OVER my scalp!! Not just in the same spots. It is even longer than it ever has been. The biggest surprise is that the front of my hair hasn't had new growth in... well I have no idea!! That part was always so smooth & I thought the follicles were completely dead. IT'S NOT!! \nMy curls are so much more prominent. My hair has grown about 1 inch, if not more. My hair stopped falling after about a week. Rhe new growth was noticeable about 2 weeks kgo taking the vitamins. \nI know that you cannot see the difference in the pictures, YET! I have hypothyroidism, fibromyalgia, an absorption issue, plus more health problems. Also just for full disclosure \n(& not sympathy or pity), I am also dealing with great grief from the passing of my bonus daughter. Grief affects our body in SO MANY ways! It's like depression, anxiety, & stress on steroids times 10 on our bodies. Since I started St.Tropica vitamins, I have seen & felt improvement with my hair & skin. St. Tropica vitamins WORKS! ***Don't go by photos, but this testimony of the vitamins. ***\n\nP.S. Pictures were taken with 2 different cameras. Also in the after pictures, I didn't know how greasy it is. My hair looks so much better than it shows. My apologies.","review__Count2":"true","ch_review_img2":"shopify:\/\/shop_images\/Jennifer_Z_95809d39-89fa-4891-a715-6af60a8e877b.png","title2":"My hair “looked” softer, smoother.","heading2":"Carla S","ch_review_content2":"I found St. Tropica in one of the lowest points of my life. My body was thrown into Cushing’s Disease after several rounds of steroid injections. Mentally and physically the hardest thing I had ever experienced, and of the symptoms was hair loss. I tried 2 other brands of hair vitamins and several brands of hair growth shampoos, with nothing gained other than deeper into my depression, Then, St Tropica, popped up and I thought, here I go again. Within 3 days, my husband thought I was crazy, but my hair felt softer. I took before pics only for myself, but then I finally got a much needed hair color and trim. My hair dresser could not believe the difference in my hair, and she cut a little more than 2 inches. When I had finished my bottle I took another picture just for myself, even still, with the hair trim, I could see a difference. My hair was right about back to the same length as when I started, and the texture was a huge difference, it even “looked” softer, smoother. So, my hope is that my review can help another person find a solution, I wish I had found you sooner. Thank you so much for all you do, Carla","review__Count3":"false","title3":"","heading3":"","ch_review_content3":"","review__Count4":"false","title4":"","heading4":"","ch_review_content4":""}}},"block_order":["834c40c6-e8b8-4a03-bec8-82df3f67b542"],"settings":{"specialized__review_title":"","width":"standard","padding_top":20,"padding_bottom":20,"padding_left":0,"padding_right":0,"animation":"none","css_class":"","css_id":"","custom_css":""}},"164864287453c7f8d9":{"type":"index__featured-product","blocks":{"164864287420959887-0":{"type":"title","settings":{}},"164864287420959887-1":{"type":"price","settings":{"display_savings":true}},"164864287420959887-3":{"type":"form","settings":{"show_payment_button":true}}},"block_order":["164864287420959887-0","164864287420959887-1","164864287420959887-3"],"settings":{"affiliate_code":"depression","featured_product":"st-tropica-hair-vitamins-hair-challenge-2-month-supply","product_images_position":"left","set_product_height":false,"product_height":500,"video_looping":false,"gallery_arrows":true,"enable_zoom":true,"enable_product_lightbox":true,"slideshow_speed":0,"slideshow_transition":"slide","display_thumbnails":true,"thumbnail_position":"left-thumbnails","enable_thumbnail_slider":true,"width":"wide","padding_top":60,"padding_bottom":0,"animation":"none","css_class":"","custom_css":".product-gallery__main, .product-gallery__thumbnails.is-slide-nav--true {\n    opacity: 1;\n}"}},"164864161709cc9c7d":{"type":"specialized__page_faqs","blocks":{"2e06c499-a457-4906-b1c9-fddb9df7d32a":{"type":"specialized__faqs","settings":{"heading":"What symptoms can be caused by Depression?","specialized__faqs_ans":"<p>While symptoms of depression vary from person to person there are a few symptoms that are most often experienced and these include:<\/p>\n<ul class=\"ul-disc\">\n<li>An ongoing and persistent feeling of sadness, hopelessness, or emptiness<\/li>\n<li>Irritability and\/or anger<\/li>\n<li>A loss of interest in hobbies, friends, social gatherings, or other normal activities<\/li>\n<li>Sleeplessness or insomnia<\/li>\n<li>Reduced or increased appetite<\/li>\n<li>Anxiety<\/li>\n<li>Tiredness<\/li>\n<li>Difficulty concentrating<\/li>\n<\/ul>","faqs__expand":"true"}},"09c49273-7a9a-4545-a258-4f4a4c25812f":{"type":"specialized__faqs","settings":{"heading":"Are there treatment options for Depression?","specialized__faqs_ans":"<p>Yes, there are treatment options available. We recommend speaking to your doctor to set up a plan to address your depression, as medication may be recommended for your treatment plan. They may also want to test you for health imbalances that are known to cause depression, such as <a href=\"https:\/\/www.sttropica.com\/pages\/thyroid-disease-hair-loss-1\" target=\"_blank\" title=\"thyroid disease\" rel=\"noopener noreferrer\">thyroid disease<\/a>. Your doctor may also recommend that you speak to a counselor, therapist, psychologist, or other mental healthcare professional to best address your depression.  <\/p>","faqs__expand":"false"}},"4d218776-5284-4632-a294-2021ce771024":{"type":"specialized__faqs","settings":{"heading":"Are there treatment options for hair loss caused by Depression?","specialized__faqs_ans":"<p>While we first recommend that you speak to your doctor, there are a few best practices related to hair care that you can implement to support your hair and hair regrowth journey:<\/p>\n\n<p>Best hair care practices:<\/p>\n<ul class=\"ul-disc\">\n<li>Use gentle hair care and avoid harsh ingredients such as <a href=\"https:\/\/www.sttropica.com\/blogs\/st-tropica\/why-using-paraben-free-hair-products-is-so-important\" target=\"_blank\" title=\"why you should use paraben free products\" rel=\"noopener noreferrer\">parabens<\/a>, <a href=\"https:\/\/www.sttropica.com\/blogs\/st-tropica\/why-using-phthalate-free-products-is-so-important\" target=\"_blank\" title=\"why you should avoid using phthalates\" rel=\"noopener noreferrer\">phthalates<\/a>, <a href=\"https:\/\/www.sttropica.com\/blogs\/st-tropica\/why-going-sulfate-free-is-the-best-thing-for-your-hair\" target=\"_blank\" title=\"why you need to avoid sulfates in hair care\" rel=\"noopener noreferrer\">sulfates<\/a>, and artificial fragrances.<\/li>\n<li>Support your hair health and growth with <a href=\"https:\/\/www.sttropica.com\/collections\/st-tropica-collection\/products\/st-tropica-hair-vitamins-hair-challenge-2-month-supply\" target=\"_blank\" title=\"Tru Bloom Hair Growth Vitamins \" rel=\"noopener noreferrer\">Tru Bloom Vitamins<\/a>. Our Tru Bloom Hair Vitamins have received thousands of positive reviews from real customers, many of whom have shared their hair and health journeys with us. Visit our <a href=\"https:\/\/www.sttropica.com\/pages\/60-day-hair-challenge-results\" target=\"_blank\" title=\"60 Day Hair Challenge\" rel=\"noopener noreferrer\">60-Day Challenge<\/a> to see thousands of reviews and before\/after photos.<\/li>\n<li>Swap your cotton pillowcase for a satin one instead. Cotton can pull at your hair as you sleep, causing more breakage and damage to your hair. A satin pillowcase will allow your hair to move more freely and without damage. Side note: Satin pillowcases, unlike silk pillowcases, are a great vegan option.<\/li>\n<li>Apply scalp treatments weekly. The <a href=\"https:\/\/www.sttropica.com\/collections\/st-tropica-collection\/products\/st-tropica-beach-goddess-hot-oil-hair-mask\" target=\"_blank\" title=\"Beach Goddess Hot Oil Hair Mask\" rel=\"noopener noreferrer\">Beach Goddess Hot Oil Hair Mask<\/a> is a natural hair treatment to help deeply nourish your scalp and hair to support your best hair growth. This incredible Hot Oil Hair Mask contains proven Hair Superfoods, which can fully penetrate the human hair shaft - to repair &amp; revitalize hair from the inside-out.<\/li>\n<li>Reduce heat styling practices. Instead of using heat tools on your hair try to embrace your natural hair texture or use heatless hair styling methods. Heat tools can cause damage to your hair and may result in hair breakage.<\/li>\n<\/ul>","faqs__expand":"false"}},"abb79dc8-85e7-4147-974b-731365f0788c":{"type":"specialized__faqs","settings":{"heading":"Can vitamins help support my hair growth?","specialized__faqs_ans":"<p>Yes! Supplementing with the right Vitamins can absolutely help.<\/p>\n<p>Our celebrated <a href=\"https:\/\/www.sttropica.com\/collections\/st-tropica-collection\/products\/st-tropica-hair-vitamins-hair-challenge-2-month-supply\" target=\"_blank\" title=\"Tru Bloom Hair Growth Vitamins\" rel=\"noopener noreferrer\">ST. TROPICA Hair Vitamins<\/a> have already helped many people suffering from Depression-related hair loss. Once again, all of the photos and reviews seen here are from our very own customers. They are 100% genuine and authentic, unedited, and unsolicited. They are from REAL people, with REAL results.<\/p>\n<p><a href=\"https:\/\/www.sttropica.com\/collections\/st-tropica-collection\/products\/st-tropica-hair-vitamins-hair-challenge-2-month-supply\" target=\"_blank\" title=\"Tru Bloom Hair Growth Vitamins\" rel=\"noopener noreferrer\">ST. TROPICA Hair Growth Vitamins<\/a> are a different kind of Hair Vitamin. They include 100% or more of the DV (Daily Value) of all the essential hair nutrients, PLUS our Proprietary, highly researched, plant &amp; fruit based HAIR SUPERFOOD formula. We have hand-selected only the best ingredients to create the world's best Hair Vitamins. Our 12 essential hair health ingredients (Vitamins, Protein &amp; Minerals) + 7 exclusive Hair Superfoods help maximize Hair Growth, Strength, and Thickness from the inside out. <\/p>\n<p>The Tru Bloom Hair Growth Vitamins are also 100% Drug-Free and Allergen Free. This means that they free of all 8 allergens for Nutritional Supplements, which are wheat, soy, peanuts, dairy, tree nuts, crustaceans, fish, and eggs!<\/p>\n<p>What’s more is that they come with our exclusive 100 DAY MONEY BACK GUARANTEE: Simply take our 60 Day Hair Challenge, and get Longer, Stronger Hair in 60 days flat, or your money back - where will we give you a full refund if you’re not delighted with your results. It's the Ultimate daily Hair Vitamin for extraordinary results, and we’ve made it a no-brainer by including our Ultimate Money-Back Guarantee, ensuring your total satisfaction.<\/p>","faqs__expand":"false"}}},"block_order":["2e06c499-a457-4906-b1c9-fddb9df7d32a","09c49273-7a9a-4545-a258-4f4a4c25812f","4d218776-5284-4632-a294-2021ce771024","abb79dc8-85e7-4147-974b-731365f0788c"],"settings":{"affiliate_code":"depression","specialized__faqs_title":"Depression FAQ","show__spe__review":true,"specialized__review_title":"Amazing Results","specialized__review_name":"Denise A","specialized__review_img":"shopify:\/\/shop_images\/Denise_A_4b9038cb-9639-4ff1-bf61-6601b8d993ff.png","specialized__review_content":"I’m so thankful for this product my hair came out really bad due me having hyperthyroidism and Graves’ disease which cause me to start experiencing depression. This is one of the best products ever made.","width":"wide","padding_top":60,"padding_bottom":20,"padding_left":0,"padding_right":0,"review__side":"order-0","animation":"none","css_class":"","css_id":"review2","custom_css":".trubloom_review_bg{\n    background-image: url(https:\/\/cdn.shopify.com\/s\/files\/1\/0818\/8965\/t\/96\/assets\/trubloom_review_bg_1.png?v=1648728108);\n    background-size: cover;\n}\n.trubloom_review_bg .purchase-details__buttons .action_button.action_button--secondary {\n    border: 1px solid #ff9ac6;\n    color: #ffffff;\n    background: #ff9ac6;\n}"}},"1649999616b8362c52":{"type":"custom-liquid","settings":{"custom_liquid":"<div id=\"stamped-main-widget\" class=\"mx-0 mb-0\" data-keyword=\"depression\"><\/div>\n<a href=\"\/products\/st-tropica-hair-vitamins-hair-challenge-2-month-supply?ref=depression\" class=\"button mx-auto\">Order Now<\/a>\n<style>\ndiv.stamped-container[data-widget-style], div[data-widget-style] div.stamped-container {\n    margin: 0px auto!important;\n}\n<\/style>"}}},"order":["164872987662732b2c","16486356205a406201","1655961790a571e76d","1648640448df60772a","16641959557afda940","164864287453c7f8d9","164864161709cc9c7d","1649999616b8362c52"]}