{"sections":{"164872987662732b2c":{"type":"specialized__page_header","settings":{"spl_text":"Widely regarded as the Best hair growth vitamins for thyroid Disease Related Hair Loss","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"animation":"none","css_class":"","custom_css":".special-head{\n    background-image: url({{ 'trubloom_review_bg.png' | asset_url }});\n    background-size: cover;\n}\n.home-slide-content p {\n    color: #727272;\n    font-size: 18px;\n}\n.home-slide-content h2 {\n    color: #ff9ac6;\n    font-size: 26px;\n}"}},"16486356205a406201":{"type":"specialized__page_top","settings":{"specialized__title":"THYROID DISEASE AND HAIR LOSS","specialized__top_content":"<p><strong>Hyperthyroidism, Hypothyroidism and Hashimoto's Disease<\/strong><\/p><p>We've been honored to hear from thousands of real customers that our Hair Vitamins have helped them through their hair loss struggles.<\/p><p>People from around the world who've suffered from Thyroid conditions in particular, have been kind enough to submit reviews and results highlighting their positive experiences with ST. TROPICA. And we want to pay it forward by sharing with anyone & everyone who also may be dealing with Thyroid disorders.<\/p><p>Many of us may not know what Thyroid disease is, and may have concerns over being undiagnosed; or just excited to find a resource focused specifically on Thyroid and hair loss. So let's dive into it.<\/p>","show__spe__review":true,"specialized__review_title":"Now you can see hair filling in","specialized__review_name":"Tricia B","specialized__review_img":"shopify:\/\/shop_images\/13_Tricia_B.png","specialized__review_content":"I wish I could have done a before and after length picture as well because I know there's a difference. I suffer from hypothyroidism and am on the Keto diet. Both have been known to cause hair loss. After a shower I used to have clumps of hair falling. Now you can see hair filling in and I lose less hair in the morning that I'm not so scared to used comb! So exciting!!","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"review__side":"order-0","animation":"none","css_class":"","custom_css":""}},"16559634391f183c28":{"type":"specialized__survey_section","settings":{"affiliate_code":"thyroid","width":"wide","padding_top":70,"padding_bottom":20,"padding_left":0,"padding_right":0,"review__side":"order-0","animation":"none","css_class":"","custom_css":""}},"1648640448df60772a":{"type":"specialized__what_is","settings":{"specialized__what_icon1":"shopify:\/\/shop_images\/thyroid1.png","specialized__what_title":"What is Thyroid Disease?","specialized__what_content":"<p>Thyroid disease is when your Thyroid gland either produces too much or too little Thyroid hormone.<\/p><p>Your Thyroid gland is responsible for regulating major functions in your body like brain development, metabolism, and much more.<\/p><p>Thyroid disease is often broken down into three unique conditions: Hyperthyroidism, Hypothyroidism, and Hashimoto's disease.<\/p>","show__sym":false,"specialized__sym_title":"","specialized__sym_content":"","specialized__how_title":"HOW CAN ST. TROPICA HAIR VITAMINS HELP?","specialized__how_content":"<p>We are excited to share that we are constantly receiving incredibly positive feedback, in the form of 5 star photo reviews, from many of our valued customers who are struggling hair loss due to different Thyroid conditions; and who are experiencing tremendous results by using our one-of-a-kind Tru Bloom Hair Vitamins. All of the photos and reviews seen here are 100% genuine and authentic, and they are unedited, and unsolicited. In short, they are the real deal.<\/p><p>Tru Bloom Hair Growth Vitamins by ST. TROPICA are a different kind of Hair Vitamin. They include 100% or more of the DV (Daily Value) of all the essential hair nutrients, PLUS our Proprietary, highly researched, plant & fruit based HAIR SUPERFOOD formula. We have hand-selected only the best ingredients to create the world's best Hair Vitamins. Our 12 essential hair health ingredients (Vitamins, Protein & Minerals) + 7 exclusive Hair Superfoods help maximize Hair Growth, Strength and Thickness from the inside-out. They are also 100% Drug Free, and Allergen Free.<\/p><p>What’s more is that they come with an exclusive 100 DAY MONEY BACK GUARANTEE: Simply take our 60 Day Hair Challenge, and get Longer, Stronger Hair in 60 days flat, or your money back - where will we give you a full refund if you’re not delighted with your results. It's the Ultimate daily Hair Vitamin for extraordinary results, and we’ve made it a no-brainer by including our Ultimate Money-Back Guarantee, ensuring your total satisfaction.<\/p>","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"animation":"none","css_class":"","custom_css":""}},"1648645038b9435b55":{"type":"specialized__review_slide","blocks":{"98e5cefa-fb47-4d05-92b5-3c9f2c7c75ec":{"type":"60day-challenge","settings":{"review__Count1":"true","ch_review_img":"shopify:\/\/shop_images\/5_Deanna_T.png","title":"Thank you St.Tropica 😊","heading":"Deanna T","ch_review_content":"I've been struggling with hair loss\/thinning for years because of my thyroid. I've tried so many other things and spent so much money and NOTHING ever worked. I've given up on even trying anymore, until I came across St.Tropica!!!! I was very skeptical to try but I decided to give it a try. And I can't believe my results. This hair vitamin is the only thing I've tried that actually seems to be working for me. Also the most affordable thing I've tried. Its given me my confidence back and I don't have to be embarrassed anymore. Thank you St.Tropica 😊","review__Count2":"true","ch_review_img2":"shopify:\/\/shop_images\/15_Gail_K.png","title2":"Great product!","heading2":"Gail K","ch_review_content2":"I have thyroid issues, and my hair just periodically falls out in patches. This is the only product that has actually allowed the hair to grow back. While I will probably never have a full head of hair again, when my thyroid is out of sorts and I do have issues, I know the hair will grow right back! Great product!","review__Count3":"true","ch_review_img3":"shopify:\/\/shop_images\/12_Nicole_D.png","title3":"AMAZING RESULTS IN JUST 60 DAYS!!!","heading3":"Nicole D","ch_review_content3":"I purchased St. Tropica to help my hair grow and get some more volume as my hypothyroidism has really thinned it out. WOW WHAT AMAZING RESULTS IN JUST 60 DAYS!!! I am on my second bottle and will continue to keep taking them every day so I can see amazing growth and volume and the one thing I wasn't expecting...shine! Thank you St. Tropica! You've got yourself a lifer!","review__Count4":"true","ch_review_img4":"shopify:\/\/shop_images\/14_JP.png","title4":"its fuller shiny and getting long","heading4":"JP","ch_review_content4":"I cannot live without these vitamins! My hair had become broken and brittle and fell out by the fistful due to hashimotos and suffering back to back traumas that have left me with PTSD. I saw these read the reviews and decided to give them a try. I did not want to shave my head or cut my hair short so I decided to keep what was left take these and if they worked when my hair got long enough I'd even it out. I am blown away by the difference in 8 months. My hair was disintegrating and had big holes missing, now its fuller shiny and getting long. I will never go without these supplements. Thank you so much for creating a product that actually works"}},"2c5bcd27-a255-41e8-9a5f-c058821a28db":{"type":"60day-challenge","settings":{"review__Count1":"true","ch_review_img":"shopify:\/\/shop_images\/Alina_Richardson.png","title":"it's growing so much faster","heading":"Alina R","ch_review_content":"I have tried everything I feel like under the sun I really notice a real difference with this hair vitamins the coconut oil and the hair masks I love them I currently have about 10 that I stocked up from alter beauty I have Thyroid problems and anemia so this with my medicine that I take I feel like makes a real difference my hair feels so smooth and soft and his pills so healthy it's getting thicker and it's growing so much faster than I would've without these I'm so grateful I found these a must try I'm on my third bottle!","review__Count2":"true","ch_review_img2":"shopify:\/\/shop_images\/Crystal_Slone.png","title2":"Absolutely Amazing Stuff!","heading2":"Crystal S","ch_review_content2":"After my thyroidectomy due to Thyroid cancer my hair started to fall out by the hand fulls. It felt so dry and was broken off so badly. It just seemed to stop growing. It was an awful mess! I felt awful about my self my confidence was way down. After trying this wonderful smelling miracle in a bottle my hair felt as soft as a cloud. The scent is the most heavenly thing I think I've ever smelt. My hair feels stronger it's growing and repairing itself. The breakage has stopped it's actually growing in better and stronger then before! I use to pick out handfuls of hair out of my hair brush now it stays clean. I love this product and hope to use it as Long as they make it!","review__Count3":"true","ch_review_img3":"shopify:\/\/shop_images\/Tara_Munro.png","title3":"WOW! Love, love it","heading3":"Tara M","ch_review_content3":"I have had short hair for many years due to Hashimoto's this is the first product I have found that actually made my hair grow and quickly! Started on Jan 17th, the 60 days is right after a hair cut. You can really see the quality in my hair, the growth and thickness. I am getting so many compliments on my hair Especially when its curly and natural. Love, love it.","review__Count4":"true","ch_review_img4":"shopify:\/\/shop_images\/17_Jacki.png","title4":"My hair has grown in nicely","heading4":"Jacki S","ch_review_content4":"My overall experience with this product was amazing! My hair has grown in nicely after a bad haircut and significant hair loss due to thyroid problems. Since starting this vitamin back in August, I have noticed much less shedding than I was experiencing before taking these vitamins. I would highly recommend this product to anyone who has hair loss or thinning."}},"3cfb9bfa-b7e0-481c-9bc1-4d08c8bf955c":{"type":"60day-challenge","settings":{"review__Count1":"false","title":"","heading":"","ch_review_content":"","review__Count2":"false","title2":"","heading2":"","ch_review_content2":"","review__Count3":"false","title3":"","heading3":"","ch_review_content3":"","review__Count4":"true","ch_review_img4":"shopify:\/\/shop_images\/April_Miller.png","title4":"MY HAIR HAS GROWN ABOUT 2 INCHES","heading4":"April M","ch_review_content4":"I have tried everything and with my Thyroid problems it was tough. My hair has grown about 2 inches overall and still have a lot more to go so I will definitely be buying more."}},"2aac819e-77c5-4603-b09d-2199fd49ef8f":{"type":"60day-challenge","settings":{"review__Count1":"true","ch_review_img":"shopify:\/\/shop_images\/1_Jamie_C.png","title":"My hair felt so much healthier!!","heading":"Jamie C","ch_review_content":"I have a thyroid condition and over the last two years have lost 100 lbs. When I changed my diet, lost weight and started a new thyroid medication my hair started shedding so bad. I would estimate I lost 50% of my hair. I took biotin, added collagen to my daily diet nothing helped! I saw a review for St Tropica hair grow vitamins on Facebook and thought can’t hurt! My hair after the first 2 month supply stopped shedding and looked and felt so much healthier!! I love this product!!","review__Count2":"true","ch_review_img2":"shopify:\/\/shop_images\/2_Nellie_B.png","title2":"A journey worth taking","heading2":"Nellie B","ch_review_content2":"I love these pills!! I only took pictures of my growth, which was almost two inches!!! Patches of hair was falling out due to thyroid issues. However, these pills have made it look as though my hair has never fallen out! I mean I still do get some fall out, but it isn't nearly as bad as it was! Definitely a blessing in disguise!! A journey worth taking.","review__Count3":"true","ch_review_img3":"shopify:\/\/shop_images\/3_Marie_H.png","title3":"made me feel more confident","heading3":"Marie H","ch_review_content3":"I have Graves and have never found anything that has stopped hair fall and helps with growth. I’ll continue to take this wonderful product that has made me feel more confident about my hair!!","review__Count4":"true","ch_review_img4":"shopify:\/\/shop_images\/4_Iris_R.png","title4":"I’m loving my hair again.","heading4":"Iris R","ch_review_content4":"So, I had my hair done today and I asked my friend to take a before and after photos for her portfolio and when she showed me how my hair looked on the back I was blown away by how much it has actually grown with St. Tropica ‼️ See my first post from January 2021 and the most recent update from April 1st. My trouble\/slow growing-right side has been growing and it’s finally catching up with the left side! ( I have a thyroid deficiency and on medication for 5 years now. I’m loving my hair again. It was time to celebrate by doing something nice to it."}},"cbcbed37-1a0b-49ad-be9d-812edc7135af":{"type":"60day-challenge","settings":{"review__Count1":"false","title":"","heading":"","ch_review_content":"","review__Count2":"true","ch_review_img2":"shopify:\/\/shop_images\/6_Joann_M.png","title2":"I highly recommend it","heading2":"Joann M","ch_review_content2":"I have hypothyroidism and I've been losing hair a lot. This vitamins help me a lot and will be ordering again . I highly recommend it .","review__Count3":"true","ch_review_img3":"shopify:\/\/shop_images\/7_Angelina_C.png","title3":"I noticed results after 3 weeks","heading3":"Angelina C","ch_review_content3":"I lived this product. I've struggled with thin hair for years due to hypothyroidism. I noticed results after 3 weeks and now have three friends that have ordered it and love it too.","review__Count4":"true","ch_review_img4":"shopify:\/\/shop_images\/8_Jenene_M.png","title4":"My hair grew back in no time","heading4":"Jenene M","ch_review_content4":"I am very well pleased about the fact these Vitamins don't break me out like other brands would! My hair feels very soft and it's more manageable. My hair grew back in no time after a trim 2 months ago. My edges are full and my curls are more defined when my hair is wet ( Those will be the next pictures I'll submit in 2 more mths. These are the only hair Vitamins I will ever use!"}},"c33c6ce9-7f8f-4573-89a2-94f733ca42a4":{"type":"60day-challenge","settings":{"review__Count1":"true","ch_review_img":"shopify:\/\/shop_images\/9_Katrina_C.png","title":"I can see hairs coming in","heading":"Katrina C","ch_review_content":"I just finished my 60 days. I noticed a difference pretty quickly but wasn't as much of a change I was hoping for. About a year ago my hair started thinning really bad especially on the sides of my head. I have always had long thick hair so not sure what it is from. It could be my thyroid since I do have hypothyroidism, but was diagnosed at 19 and never had issues before (I am about to turn 40 in a few months). It could just be age. It could be stress. Really I just don't know. I have tried so many things and they all seem to work at first then they stop working. I am hoping that doesn't happen with this product as I have seen the best results from these vitamins. I have already ordered and received another 60 day supply. I wanted to make sure I am consistent with taking them. I am hoping that my hair fully fills in soon! There is still a bald spot but it is much smaller and I can see hairs coming in. My right side is the worse side that I why the pictures are all of my right side. As far as length my hair has always grown fast so not sure this made it grow any faster or not. I would think it did but I didn't take pictures of the length as that wasn't the reason I was taking them.","review__Count2":"true","ch_review_img2":"shopify:\/\/shop_images\/10_Poala_D.png","title2":"thank you so much for the inventor","heading2":"Poala D","ch_review_content2":"I love the product is really work believe me I having used for 5 months amd I will keep buying finally my hair is growing faster as I suffer for hyperthyroidism my hair was so thing break so much and stop grown I used to many product and nothing works I don’t know what is going on with this product that make a big difference I love thank you so much for the inventor please keep having great products and help to many woman’s that suffer for hair loss 🙏🙏🙏🙏I’m so happy to find you guys","review__Count3":"true","ch_review_img3":"shopify:\/\/shop_images\/11_Veronica_H.png","title3":"After two weeks I saw results","heading3":"Veronica H","ch_review_content3":"I have hyperthyroidism and my hair was so dry, brittle and was breaking off bad. After two weeks of taking this vitamin, I saw results. Thank you very much","review__Count4":"false","title4":"","heading4":"","ch_review_content4":""}},"d2c6f300-4953-40a5-90b4-e89bfbffe8b3":{"type":"60day-challenge","settings":{"review__Count1":"true","ch_review_img":"shopify:\/\/shop_images\/Yadira_Pages_77d6acf2-45b2-4fec-94ed-9a13edfff970.png","title":"I’m going to keep buying for sure!!","heading":"Yadira P","ch_review_content":"I’m very happy with my results. My hair was already long but I have a Thyroid condition so my hair is always falling out so I needed something for that problem. In the before and after results I can see more shine and volume in my hair and also the shedding is decreasing so I’m going to keep buying for sure!! Thanks 😊","review__Count2":"true","ch_review_img2":"shopify:\/\/shop_images\/Tania_Machin.png","title2":"I glad I tried this product!!","heading2":"Tania M","ch_review_content2":"I'm super impressed with this product! As I am suffering from Hypothyroidism, my fine hair has started to thin a little, which is driving me nuts. My doctor suggested getting a vitamin with biotin in it. As I was looking at all of different vitamins to choose from, the hair growth ones started popping up. I researched everything and I choose this one because they use natural ingredients and it had positive reviews. The price was also very affordable. Man am I glad I tried this product!! I've been taking it for 2 months and I can definitely tell a difference. The biggest thing I have seen is that it's growing like crazy. This is a definite must have for your hair health.","review__Count3":"false","title3":"","heading3":"","ch_review_content3":"","review__Count4":"true","ch_review_img4":"shopify:\/\/shop_images\/16_Paola.png","title4":"even my nails growing","heading4":"Paola","ch_review_content4":"It is a miracle I can’t believe it. Didn’t try this product before I having try everything and nothing works since I got hyperthyroidism my hair was breaking and stop Growing not even my nails growing with this product I’m so happy thank you for created a product that really works ams give us confidence and hope to the ones suffer for thyroids thank you 🙏🙏🙏"}},"25b76a01-0812-4ac1-b506-2e8e2a9bef33":{"type":"60day-challenge","settings":{"review__Count1":"true","ch_review_img":"shopify:\/\/shop_images\/18_Maricarmen.png","title":"I had amazing results","heading":"Maricarmen R","ch_review_content":"I just ordered my second bottle. I have tried other products but never had results. I have rheumatoid arthritis and thyroid. People have noticed that my hair has grown and i have more volume and it is thicker. Look at the pictures. Can you see the results? I am so happy I found your product.","review__Count2":"true","ch_review_img2":"shopify:\/\/shop_images\/19_Amy.png","title2":"They grew & were thicker","heading2":"Amy D","ch_review_content2":"I have thyroid disease, so my hair is very thin & grows really slowly. I could tell within 2 weeks a big difference in my nails! They grew & were thicker. After 60 days I feel like my hair has grown in length some & you can’t see my scalp as much as before. I definitely will continue taking them to see if it will help even more.","review__Count3":"true","ch_review_img3":"shopify:\/\/shop_images\/20_Jessica.png","title3":"best thing ever!","heading3":"Jessica Q","ch_review_content3":"So, I have a thyroid condition and my hair falls out if I even look at it! Since I started taking these vitamins, my hair has not only grown faster but I would say like 90% less of my hair is falling out!! That alone is the best thing ever!","review__Count4":"true","ch_review_img4":"shopify:\/\/shop_images\/21_Deyanira.png","title4":"give these vitamins a try","heading4":"Deyanira R","ch_review_content4":"After massive hair loss due to thyroid meds, I started taking this vitamin and have noticed fuller hair... I’m so pleased that I’m not losing so much hair when I take a shower... please do yourself a favor and give these vitamins a try..."}},"87726454-a752-44af-84ac-8fe884eaa0b0":{"type":"60day-challenge","settings":{"review__Count1":"true","ch_review_img":"shopify:\/\/shop_images\/22_Laurie.png","title":"I have noticed a difference","heading":"Laurie K","ch_review_content":"I was loosing my hair due to thyroid issues I was told to try this product by a friend. I have noticed a difference after 60 days but you need to be patient. Your hair didn't fall out all at once its not gonna grow back all at once.","review__Count2":"true","ch_review_img2":"shopify:\/\/shop_images\/23_Adrienne.png","title2":"stronger and healthier","heading2":"Adrienne C","ch_review_content2":"After 90 days I’m extremely happy with the results. I have a thyroid issues and have had problems with thinning brittle hair. The difference between my first in second photo is I cut my hair to remove all the unhealthy growth but in the third photo my hair is back to its original length but stronger and healthier. More then worth the money.","review__Count3":"true","ch_review_img3":"shopify:\/\/shop_images\/24_Sheila.png","title3":"feels thicker and is growing","heading3":"Sheila B","ch_review_content3":"I have always had very long hair, and medium thickness. But I have a Thyroid problems, over the years my hair has become very thin and hard to keep long. So I gave this a try. I'm very happy my hair is super soft, feels thicker and is growing. I went ahead and bought another 2 month supply before I ran out","review__Count4":"true","ch_review_img4":"shopify:\/\/shop_images\/25_Arhonda_Simmons.png","title4":"My hair is much fuller & growing","heading4":"Arhonda S","ch_review_content4":"I have been using St Tropica for almost 60 days and notice great results. My hair was thinning due to thyroid issues and the hard water where I live. My hair is much fuller and growing very quickly! I am about to purchase my next bottle now."}},"750a2cb4-9558-4a95-be4a-a228dcbb2637":{"type":"60day-challenge","settings":{"review__Count1":"true","ch_review_img":"shopify:\/\/shop_images\/26_Rosanna_Marchiano.png","title":"My nails are also growing faster","heading":"Rosanna M","ch_review_content":"I did not believe it at first because of my thyroid and going through perimenopause but after a month I started to see my hair fill in on my temple. I was amazed . My nails are also growing faster. I already purchased another bottle. I can't wait . Thank you ST. Tropica.","review__Count2":"true","ch_review_img2":"shopify:\/\/shop_images\/27_Gena_Abong.png","title2":"this product works wonder","heading2":"Gena A","ch_review_content2":"Love the St. Tropica hair growth vitamins. I have hypothyroidism and have lost a lot of my hair. I have tried everything but this product works wonder. You can see the difference in my photo and it affordable.","review__Count3":"true","ch_review_img3":"shopify:\/\/shop_images\/28_Giuseppina_C.png","title3":"I see the difference 🥰🤩","heading3":"Giuseppina C","ch_review_content3":"I’m so in love with this product , my hair hasn’t been growing for the past 3 years so to Thyroid, and finally in a month I see the difference 🥰🤩","review__Count4":"true","ch_review_img4":"shopify:\/\/shop_images\/29_Sylvia_Padua.png","title4":"quickly my hair has grown","heading4":"Sylvia P","ch_review_content4":"Overall experience was amazing, My hair felt thicker, stronger and shiner. People at work have notice how quickly my hair has grown. I bought one bottle but this my go to hair vitamins for life. I suffer from hypothyroid and my hair loss is much less, but I did notice once I stopped the vitamins some( not a lot) of hair loss. Reordering ASAP!!"}},"d21349b3-1a4d-45c8-89a0-3ae97d53db9d":{"type":"60day-challenge","settings":{"review__Count1":"true","ch_review_img":"shopify:\/\/shop_images\/30_Nona_Gomez.png","title":"overall my experience was good","heading":"Nona G","ch_review_content":"I bought extra hair masks and did one every week during the 60 day hair trial. My hair was at 18 1\/2 inch root to end in the back and after 60 days its 19 1\/2 inch. the sides were 17 1\/2 inch root to end and after 60 days its 18 inch. My bangs root to end were 8 inc and after the 60 days they are 9 1\/2. I got about an inch overall with hair growth, I was hoping for more like 2 inch hair growth but I also just found out that I Have Hypothyroidism and so that could be playing a part in the slow growth. nothing bad to report here though, I did read other reviews before I purchased and did make sure to eat before taking. The hair mas was okay, No complaints but I didn't feel as though it made my hair super soft like it did some other people who reviewed. I'd try it again and am looking forward to the free month supply and maybe try again once my medication is handled for my Thyroid. Thank you","review__Count2":"true","ch_review_img2":"shopify:\/\/shop_images\/31_Loriann_Sanchez.png","title2":"Yes I will be ordering more","heading2":"Loriann S","ch_review_content2":"I have Hypothyroidism and have been struggling with hair fall. When I tell you I have tried everything, I have tried everything. I chose to do the 60-day challenge on the incentive that if it didn't work I was losing nothing and if it did work, I was gaining a supplement to be a long-time customer with. After 5 days of taking once a day, I noticed significantly less hair shedding in my comb, brush, and shower. Since it's natural to shed everyday, I didn't take the shedding I had going on still as a fail of this product. Rather, I see it as this supplement has given me back \"normal\" hair. I have very little hair shed; I call healthy shedding. My hair is stronger, shinier, and certainly has grown in the 60 days. Yes I will be ordering more. It's a little expensive; $25\/month but I have spent more than that in the same window of time on products that claimed to work and didn't. Thank you, St. Tropica for giving me a boost of confidence I can feel 1 day at a time, 1 capsule at a time.","review__Count3":"true","ch_review_img3":"shopify:\/\/shop_images\/31_Taryn_E.png","title3":"Very pleased!","heading3":"Taryn E","ch_review_content3":"I doubled my normal hair growth and it's coming in healthier and stronger, even with Hashimoto's Thyroiditis. Very pleased!","review__Count4":"true","ch_review_img4":"shopify:\/\/shop_images\/33_Jacey_Gloege.png","title4":"I'll forever be a customer!","heading4":"Jacey G","ch_review_content4":"If you're wondering If you should buy these: DO IT! The dark color is my before- during my 2 month bottle, I color removed my hair AND got at least 2 inches cut off and this is my hair now (natural red)! Absolutely amazing product. I haven't had such healthy hair in forever since I liked to do crazy colors to my hair! I recently had my baby and diagnosed with Hashimoto's which resulted in a ton of hair loss and found a great review about these and bought them. I'll never go back now! I have recommend it to so many people! I'll forever be a customer!"}}},"block_order":["98e5cefa-fb47-4d05-92b5-3c9f2c7c75ec","2c5bcd27-a255-41e8-9a5f-c058821a28db","3cfb9bfa-b7e0-481c-9bc1-4d08c8bf955c","2aac819e-77c5-4603-b09d-2199fd49ef8f","cbcbed37-1a0b-49ad-be9d-812edc7135af","c33c6ce9-7f8f-4573-89a2-94f733ca42a4","d2c6f300-4953-40a5-90b4-e89bfbffe8b3","25b76a01-0812-4ac1-b506-2e8e2a9bef33","87726454-a752-44af-84ac-8fe884eaa0b0","750a2cb4-9558-4a95-be4a-a228dcbb2637","d21349b3-1a4d-45c8-89a0-3ae97d53db9d"],"settings":{"specialized__review_title":"REAL PEOPLE WITH REAL RESULTS","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"animation":"none","css_class":"","css_id":"","custom_css":""}},"164864287453c7f8d9":{"type":"index__featured-product","blocks":{"164864287420959887-0":{"type":"title","settings":{}},"164864287420959887-1":{"type":"price","settings":{"display_savings":true}},"164864287420959887-3":{"type":"form","settings":{"show_payment_button":true}}},"block_order":["164864287420959887-0","164864287420959887-1","164864287420959887-3"],"settings":{"affiliate_code":"thyroid","featured_product":"st-tropica-hair-vitamins-hair-challenge-2-month-supply","product_images_position":"left","set_product_height":false,"product_height":500,"video_looping":false,"gallery_arrows":true,"enable_zoom":true,"enable_product_lightbox":true,"slideshow_speed":0,"slideshow_transition":"slide","display_thumbnails":true,"thumbnail_position":"left-thumbnails","enable_thumbnail_slider":true,"width":"wide","padding_top":60,"padding_bottom":0,"animation":"none","css_class":"","custom_css":".product-gallery__main, .product-gallery__thumbnails.is-slide-nav--true {\n    opacity: 1;\n}"}},"164864161709cc9c7d":{"type":"specialized__page_faqs","blocks":{"c25528fc-ef0c-46be-93ca-cc88186e0cf2":{"type":"specialized__faqs","settings":{"heading":"Why and How Does Thyroid Disease Cause Hair Loss?","specialized__faqs_ans":"<p>Those dealing with any form of Thyroid Disease  (Hyperthyroidism, Hypothyroidism, and Hashimoto's Disease) may experience hair loss. While not all those diagnosed with these conditions will experience hair loss, it still is a prominent symptom across the board.<\/p>\n<p>The reason hair loss often reported is because when T3 and T4 hormone production is effected, it often impacts other main functions of the body. This includes regulating your metabolism, heart rate, and new hair growth.<\/p>\n            <p>What actually occurs when you notice your hair loss is actually not that you are necessarily losing more hair than you normally would without a Thyroid condition. Instead, because the hormone is disrupted, it's new growth that is mostly effected.<\/p>\n            <p>We all lose hair, but typically our hair loss is replaced by new growth. When the natural hair fall is not replaced with new growth, that's when we see hair thinning. This can happen on the scalp as well as the eyebrows.<\/p>","faqs__expand":"true"}},"213400b1-b750-43e9-9644-ed9810401e1e":{"type":"specialized__faqs","settings":{"heading":"What is a thyroid gland and where is it located?","specialized__faqs_ans":"Your thyroid gland is a small butterfly-shaped organ located at the bottom of your neck.","faqs__expand":"false"}},"07a0f612-f5a9-461d-895a-bea633965a42":{"type":"specialized__faqs","settings":{"heading":"What is the thyroid gland responsible for?","specialized__faqs_ans":"The thyroid gland is a hormone gland that is a part of your endocrine system. It helps regulate vital functions such as metabolism, growth, and body development and can also affect heart rate, temperature, digestive function, brain development, and more.","faqs__expand":"false"}},"c3b16d44-bbe2-49dd-a0e0-7df2b4dcb38f":{"type":"specialized__faqs","settings":{"heading":"What is Hyperthyroidism?","specialized__faqs_ans":"<p>Hyperthyroidism is a condition that occurs when your thyroid gland produces too much of the Thyroid hormone, thyroxine. This impacts your heart (palpitations), metabolism, and can make you feel anxious or nervous.<\/p>\n              <p>Hyperthyroidism causes include Graves' disease, Plummer's disease and Thyroiditis. It can be serious if left untreated and it is important to consult a physician if you suspect you have Hyperthyroidism.<\/p>","faqs__expand":"false"}},"edff7e3f-e9f5-42c8-b661-1821893d2997":{"type":"specialized__faqs","settings":{"heading":"What Are Hyperthyroidism Symptoms?","specialized__faqs_ans":"<ul class=\"ul-disc\">\n<li>nervousness, jitteriness, anxiety and irritability<\/li>\n<li>difficulty sleeping<\/li>\n<li>persistent tiredness and weakness<\/li>\n<li>sensitivity to heat<\/li>\n<li>a goitre (Thyroid gland becomes large and swollen. It is often noted as a large swelling that is visible on your neck)<\/li>\n<li>heart rate (palpitations)<\/li>\n<li>twitching or trembling<\/li>\n<li>weight loss<\/li>\n<\/ul>","faqs__expand":"false"}},"b2476ade-ef6b-4144-9656-75db3d77707b":{"type":"specialized__faqs","settings":{"heading":"What is Hypothyroidism?","specialized__faqs_ans":"<p>Hypothyroidism is a medical condition that occurs when your Thyroid gland does not produce enough Thyroid hormone. It is also known as a underactive Thyroid. Your Thyroid gland is responsible for regulating your body's metabolic rate which controls your heart, muscle, digestive functions, and brain development.<\/p>\n              <p>In its early stages, Hypothyroidism can be very difficult to diagnose as the symptoms vary from person to person and can initially be very subtle. However there are a few hypothyroid signs you can look out for:<\/p>","faqs__expand":"false"}},"7fd40c57-e704-4472-bc9a-630dafacb8c6":{"type":"specialized__faqs","settings":{"heading":"What Are Hypothyroid Symptoms?","specialized__faqs_ans":"<ul class=\"ul-disc\">\n<li>tiredness<\/li>\n<li>sensitivity to cold<\/li>\n<li>weight gain<\/li>\n<li>constipation<\/li>\n<li>depression<\/li>\n<li>loss of train of thought (brain fog)<\/li>\n<li>muscle aches, cramps, and weakness<\/li>\n<li>dry skin<\/li>\n<li>brittle hair \/ hair loss<\/li>\n<li>brittle and\/or peeling nails<\/li>\n<li>irregular periods or heavy periods (in women)<\/li>\n<\/ul>","faqs__expand":"false"}},"01ac6fd6-77fb-4163-9e9d-e6ad2126566b":{"type":"specialized__faqs","settings":{"heading":"What is Hashimoto's Disease?","specialized__faqs_ans":"<p>Hashimoto's Disease (also known as Hashimoto's Thyroiditis) is an autoimmune disease. It occurs when the immune system creates antibodies that attack the thyroid gland and causes the thyroid to produce too little thyroid hormone. It is the most common cause of Hypothyroidism.<\/p>","faqs__expand":"false"}},"ba5fe550-5bcc-4ba3-b175-2b01f2d4ac05":{"type":"specialized__faqs","settings":{"heading":"What Are Hashimoto's Symptoms?","specialized__faqs_ans":"<ul class=\"ul-disc\">\n<li>fatigue<\/li>\n<li>sensitivity to cold<\/li>\n<li>constipation<\/li>\n<li>dry skin<\/li>\n<li>brittle nails<\/li>\n<li>hair loss<\/li>\n<li>weight gain<\/li>\n<li>muscle aches and pains<\/li>\n<li>brain fog<\/li>\n<\/ul>","faqs__expand":"false"}},"5d8e4acc-00d1-4bc3-aa76-a37da00efcd0":{"type":"specialized__faqs","settings":{"heading":"What is Graves Disease?","specialized__faqs_ans":"Graves Disease is an autoimmune disease that causes the thyroid gland to produce too much thyroid hormone, resulting in Hyperthyroidism.","faqs__expand":"false"}},"f56f8510-9376-4fb4-ad07-d2ba9c99c8c7":{"type":"specialized__faqs","settings":{"heading":"Can Vitamins Help with Thyroid Hair Loss?","specialized__faqs_ans":"<p>Yes! Supplementing with the right Vitamins can absolutely help.<\/p>\n<p>Our celebrated <a href=\"https:\/\/www.sttropica.com\/collections\/st-tropica-collection\/products\/st-tropica-hair-vitamins-hair-challenge-2-month-supply\" target=\"_blank\" title=\"Tru Bloom Hair Growth Vitamins\" rel=\"noopener noreferrer\">ST. TROPICA Hair Vitamins<\/a> have already helped many people suffering from Thyroid related hair loss. Once again, all of the photos and reviews seen here are from our very own customers. They are 100% genuine and authentic, unedited, and unsolicited. They are from REAL people, with REAL results.<\/p>\n<p><a href=\"https:\/\/www.sttropica.com\/collections\/st-tropica-collection\/products\/st-tropica-hair-vitamins-hair-challenge-2-month-supply\" target=\"_blank\" title=\"Tru Bloom Hair Growth Vitamins\" rel=\"noopener noreferrer\">ST. TROPICA Hair Growth Vitamins<\/a> are a different kind of Hair Vitamin. They include 100% or more of the DV (Daily Value) of all the essential hair nutrients, PLUS our Proprietary, highly researched, plant &amp; fruit based HAIR SUPERFOOD formula. We have hand-selected only the best ingredients to create the world's best Hair Vitamins. Our 12 essential hair health ingredients (Vitamins, Protein &amp; Minerals) + 7 exclusive Hair Superfoods help maximize Hair Growth, Strength, and Thickness from the inside out. <\/p>\n<p>The Tru Bloom Hair Growth Vitamins are also 100% Drug-Free and Allergen Free. This means that they free of all 8 allergens for Nutritional Supplements, which are wheat, soy, peanuts, dairy, tree nuts, crustaceans, fish, and eggs!<\/p>\n<p>What’s more is that they come with our exclusive 100 DAY MONEY BACK GUARANTEE: Simply take our 60 Day Hair Challenge, and get Longer, Stronger Hair in 60 days flat, or your money back - where will we give you a full refund if you’re not delighted with your results. It's the Ultimate daily Hair Vitamin for extraordinary results, and we’ve made it a no-brainer by including our Ultimate Money-Back Guarantee, ensuring your total satisfaction.<\/p>","faqs__expand":"false"}}},"block_order":["c25528fc-ef0c-46be-93ca-cc88186e0cf2","213400b1-b750-43e9-9644-ed9810401e1e","07a0f612-f5a9-461d-895a-bea633965a42","c3b16d44-bbe2-49dd-a0e0-7df2b4dcb38f","edff7e3f-e9f5-42c8-b661-1821893d2997","b2476ade-ef6b-4144-9656-75db3d77707b","7fd40c57-e704-4472-bc9a-630dafacb8c6","01ac6fd6-77fb-4163-9e9d-e6ad2126566b","ba5fe550-5bcc-4ba3-b175-2b01f2d4ac05","5d8e4acc-00d1-4bc3-aa76-a37da00efcd0","f56f8510-9376-4fb4-ad07-d2ba9c99c8c7"],"settings":{"affiliate_code":"KINDKETOMAMA","specialized__faqs_title":"THYROID FAQ","show__spe__review":true,"specialized__review_title":"Awesome results!! 🙌","specialized__review_name":"Joanne M","specialized__review_img":"shopify:\/\/shop_images\/Joanne_M.png","specialized__review_content":"This is going to be my holy grail hair vitamins!! I have been struggling with CCCA and have Hypothyroidism. I took the St tropica vitamin 2 month challenge and had awesome results. My bald spot is filling in and I had about an inch and a half of growth, and the best thing... no side effects, how good is that?? Will definitely continue to purchase, loved it.💕","width":"wide","padding_top":60,"padding_bottom":20,"padding_left":0,"padding_right":0,"review__side":"order-0","animation":"none","css_class":"","css_id":"review2","custom_css":".trubloom_review_bg{\n    background-image: url(https:\/\/cdn.shopify.com\/s\/files\/1\/0818\/8965\/t\/96\/assets\/trubloom_review_bg_1.png?v=1648728108);\n    background-size: cover;\n}\n.trubloom_review_bg .purchase-details__buttons .action_button.action_button--secondary {\n    border: 1px solid #ff9ac6;\n    color: #ffffff;\n    background: #ff9ac6;\n}"}},"1650000826a2cca1cf":{"type":"custom-liquid","settings":{"custom_liquid":"<div id=\"stamped-main-widget\" class=\"mx-0 mb-0\" data-keyword=\"thyroid\"><\/div>\n<a href=\"\/products\/st-tropica-hair-vitamins-hair-challenge-2-month-supply?ref=thyroid\" class=\"button mx-auto\">Order Now<\/a>\n<style>\ndiv.stamped-container[data-widget-style], div[data-widget-style] div.stamped-container {\n    margin: 0px auto!important;\n}\n<\/style>"}}},"order":["164872987662732b2c","16486356205a406201","16559634391f183c28","1648640448df60772a","1648645038b9435b55","164864287453c7f8d9","164864161709cc9c7d","1650000826a2cca1cf"]}