{"sections":{"164872987662732b2c":{"type":"specialized__page_header","settings":{"spl_text":"Widely regarded as the Best hair growth vitamins for postpartum hair loss","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"animation":"none","css_class":"","custom_css":".special-head{\n    background-image: url({{ 'trubloom_review_bg.png' | asset_url }});\n    background-size: cover;\n}\n.home-slide-content p {\n    color: #727272;\n    font-size: 18px;\n}\n.home-slide-content h2 {\n    color: #ff9ac6;\n    font-size: 26px;\n}"}},"16486356205a406201":{"type":"specialized__page_top","settings":{"specialized__title":"POSTPARTUM DEPRESSION AND POSTPARTUM HAIR LOSS","specialized__top_content":"<p>We've been honored to hear from thousands of real customers that our Hair Vitamins have helped them through their hair loss struggles.<\/p><p>People from around the world who've suffered from Postpartum in particular, have been kind enough to submit reviews and results highlighting their positive experiences with ST. TROPICA. And we want to pay it forward by sharing with anyone & everyone who also may be dealing with Postpartum.<\/p><p>Many of us may not know what Postpartum is, and may have concerns over being undiagnosed; or just excited to find a resource focused specifically on Postpartum and hair loss. So let's dive into it.<\/p>","show__spe__review":true,"specialized__review_title":"My hair has grown almost 3 full inches","specialized__review_name":"Susie H","specialized__review_img":"shopify:\/\/shop_images\/Susie_Hardy_1.png","specialized__review_content":"I'm in my 3rd month of taking the biotin & superfoods blend from @sttropica and the regrowth at my hairline has been amazing. This isn’t my first experience with post-partum hair loss, after my first son was born I lost a lot of my hair especially at my hair line & it didn’t start to grow back until I was at least a year post partum. This time I’m 7 months post partum & my hair is growing like crazy. (side note) I got a haircut a few weeks ago so you can't really see the progress in my length, but my hair has grown almost 3 full inches and is curlier, shinier, & healthier looking than ever. My goal this year is to grow my hair as long as possible & I'm doing a few things to keep my hair strong enough so that I can go longer in between trims. I'm using the same products that I've always used & I am still avoiding heat styling but now I'm also deep conditioning my hair once per week & taking a daily vitamin.","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"review__side":"order-0","animation":"none","css_class":"","custom_css":""}},"165596325950489666":{"type":"specialized__survey_section","settings":{"affiliate_code":"postpartum","width":"wide","padding_top":70,"padding_bottom":20,"padding_left":0,"padding_right":0,"review__side":"order-0","animation":"none","css_class":"","custom_css":""}},"1648640448df60772a":{"type":"specialized__what_is","settings":{"specialized__what_icon1":"shopify:\/\/shop_images\/Postpartum1.png","specialized__what_title":"What is Postpartum Depression?","specialized__what_content":"<p>Many new moms experience Postpartum after childbirth. In the first few days and weeks after childbirth it is not uncommon to experience mood swings, anxiety, restlessness when trying to sleep, and bouts of crying. <\/p><p>While some women recover within a few weeks from their Postpartum, others experience Postpartum depression which is is long lasting and requires medical attention.<\/p>","show__sym":false,"specialized__sym_title":"","specialized__sym_content":"","specialized__how_title":"HOW CAN ST. TROPICA HAIR VITAMINS HELP?","specialized__how_content":"<p>We are excited to share that we are constantly receiving incredibly positive feedback, in the form of 5 star photo reviews, from many of our valued customers who are struggling with Postpartum hair loss; and who are experiencing tremendous results by using our one-of-a-kind Tru Bloom Hair Vitamins. All of the photos and reviews seen here are 100% genuine and authentic, and they are unedited, and unsolicited. In short, they are the real deal.<\/p><p>Tru Bloom Hair Growth Vitamins by ST. TROPICA are a different kind of Hair Vitamin. They include 100% or more of the DV (Daily Value) of all the essential hair nutrients, PLUS our Proprietary, highly researched, plant & fruit based HAIR SUPERFOOD formula. We have hand-selected only the best ingredients to create the world's best Hair Vitamins. Our 12 essential hair health ingredients (Vitamins, Protein & Minerals) + 7 exclusive Hair Superfoods help maximize Hair Growth, Strength and Thickness from the inside-out. They are also 100% Drug Free, and Allergen Free.<\/p><p>What’s more is that they come with an exclusive 100 DAY MONEY BACK GUARANTEE: Simply take our 60 Day Hair Challenge, and get Longer, Stronger Hair in 60 days flat, or your money back - where will we give you a full refund if you’re not delighted with your results. It's the Ultimate daily Hair Vitamin for extraordinary results, and we’ve made it a no-brainer by including our Ultimate Money-Back Guarantee, ensuring your total satisfaction.<\/p>","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"animation":"none","css_class":"","custom_css":""}},"1648645038b9435b55":{"type":"specialized__review_slide","blocks":{"cf526795-f148-4d3c-a0ab-f16401c24823":{"type":"60day-challenge","settings":{"review__Count1":"true","ch_review_img":"shopify:\/\/shop_images\/Monica_M.png","title":"a new love ❤️","heading":"Monica M","ch_review_content":"Postpartum hair loss and damage is no joke and ST. TROPICA came to the rescue! Shedding has only slowed down a bit but I have so much new growth and my hair is so much softer. Definitely recommend these specially to all my postpartum mommas!!","review__Count2":"true","ch_review_img2":"shopify:\/\/shop_images\/Krithika_R.png","title2":"Postpartum hair loss","heading2":"Krithika R","ch_review_content2":"I had read good reviews for these vitamins for postpartum hair loss and decided to give it a try. I didn’t see any visible growth of hair during the 60 days but I did see reduced shedding after a hair wash.","review__Count3":"true","ch_review_img3":"shopify:\/\/shop_images\/WhitAz.png","title3":"Amazing for regrowth!","heading3":"WhitAz","ch_review_content3":"Loves the results I got. My postpartum regrowth was thin and sparse, and by using these vitamins it’s gotten much fuller much quicker! Would highly recommend!","review__Count4":"true","ch_review_img4":"shopify:\/\/shop_images\/TaQavia_A_e3533018-8f08-4c3d-b82b-4892a9943ccf.png","title4":"I love it thank you!","heading4":"TaQavia A","ch_review_content4":"I finally got my edges back! After I had my son last year postpartum really took my hair out. After taking these vitamins and wearing a protective style my hair has recovered nicely. I love it thank you!"}},"9507dd60-85f8-43b2-9cad-c6d10a6a90aa":{"type":"60day-challenge","settings":{"review__Count1":"false","title":"","heading":"","ch_review_content":"","review__Count2":"false","title2":"","heading2":"","ch_review_content2":"","review__Count3":"true","ch_review_img3":"shopify:\/\/shop_images\/Laila_Rodriguez.png","title3":"My hair feels healthy and thick","heading3":"Laila R","ch_review_content3":"I was skeptical but hopeful as my Postpartum hair was very sad. I noticed a lot of thinning around the temples and it was slow to grow. Plus the condition of the hair itself was damaged. Now it feels healthy and thick and it is filling in at the temples! Thank you so much!","review__Count4":"true","ch_review_img4":"shopify:\/\/shop_images\/Risa_47a1a6f9-cc58-479e-ba96-74a93c056bef.png","title4":"This product is great","heading4":"Risa M","ch_review_content4":"After going through Postpartum hair loss and loosing hand fulls of hair each day I made the decision to cut off my hair and try St trópica vitamins. The results where amazing I wasn’t loosing my hair anymore and not only that but My hair grew 2.5 inches in 2 months. My hair is growing back stronger than EVER! This product is great and will definitely buy more and will recommend to family and friends."}},"f1907240-3e5c-4b5b-a21a-8b3b2140a861":{"type":"60day-challenge","settings":{"review__Count1":"true","ch_review_img":"shopify:\/\/shop_images\/Ana_M.png","title":"I can see regrowth","heading":"Ana M","ch_review_content":"I experienced bad hair loss in the front of my head post partum and my hair would easily fall out especially when brushing my hair, my brush would be covered with hair. After 30 days of using this, Ive noticed my hairline no longer receding and I can see regrowth. My hair also doesn't feel dry like it used to. I used to have really dry ends and breakage but not anymore!","review__Count2":"true","ch_review_img2":"shopify:\/\/shop_images\/Jessica_H.png","title2":"I will be purchasing again!","heading2":"Jessica H","ch_review_content2":"After having my last child, a lot of my hair was falling out and it seemed like nothing was working. I decided to give this a go and I have definitely noticed a difference. It might not be amazing long results, but my hair is most definitely stronger, fuller and barley falls out in the shower or with brushing. I will be purchasing again!","review__Count3":"true","ch_review_img3":"shopify:\/\/shop_images\/Cecilia.png","title3":"I have loved inches of growth","heading3":"Cecilia","ch_review_content3":"Would I have loved inches of growth, sure, but I purchased St. Tropica vitamins to bring my hair back from the lifeless state that it was in. After 6 pregnancies, my hair had become oily, thin, and after every brushing, I was losing handfulls of hair. After 30 days of taking the vitamins my hair felt thicker, it styled better and I barely lost a strand while brushing. I can't wait to see what another month will do.","review__Count4":"true","ch_review_img4":"shopify:\/\/shop_images\/Amy_V.png","title4":"It’s been a life saver","heading4":"Amy V","ch_review_content4":"I had been suffering from super thin hair and bald spots to due to post partum hormonal changes and stress. I began to see results by the second month that I am really happy with. I have continued to use the product and often recommend it to my family and friends. I truly cannot recommend St Tropica enough. I thought I was literally going bald forever. It’s been a life saver for my hair and self confidence."}},"724a4f58-8a6c-4b59-bd25-06e40e1fa768":{"type":"60day-challenge","settings":{"review__Count1":"true","ch_review_img":"shopify:\/\/shop_images\/Krithka_R.png","title":"I had read good reviews","heading":"Krithka R","ch_review_content":"I had read good reviews for these vitamins for postpartum hair loss and decided to give it a try. I didn’t see any visible growth of hair during the 60 days but I did see reduced shedding after a hair wash.","review__Count2":"true","ch_review_img2":"shopify:\/\/shop_images\/Alisha_S.png","title2":"I will be taking this product forever","heading2":"Alisha S","ch_review_content2":"I had major post partum hair loss and was so depressed because of it. I decided to try this product because of all of the positive reviews and I am so glad I did. I noticed a change in just 1 week and my hair stylist was so amazed by the results. Not only were my bald spots fill in but my hair stopped falling out and grew longer. I will be taking this product forever.","review__Count3":"true","ch_review_img3":"shopify:\/\/shop_images\/TaQavia_A.png","title3":"I love it thank you!","heading3":"TaQavia A","ch_review_content3":"I finally got my edges back! After I had my son last year postpartum really took my hair out. After taking these vitamins and wearing a protective style my hair has recovered nicely. I love it thank you!","review__Count4":"true","ch_review_img4":"shopify:\/\/shop_images\/Haley.png","title4":"So impressed by the results","heading4":"Haley","ch_review_content4":"Not only did thinning parts have more growth but I have had terrible hair loss since giving birth to my daughter and since taking St. Tropica this has significantly decreased. Highly recommend!"}},"a0d8e41c-f33a-4597-92a9-c21d11597728":{"type":"60day-challenge","settings":{"review__Count1":"true","ch_review_img":"shopify:\/\/shop_images\/Luisa_L.png","title":"Will definitely recommend!","heading":"Luisa L","ch_review_content":"Amazing product, with postpartum and nursing... ive lost tons of hair, but now after 60 days taking this vitamins, its back, its looking fuller, healthier and longer. Will definitely recommend!","review__Count2":"true","ch_review_img2":"shopify:\/\/shop_images\/Catalina_C1.png","title2":"Highly recommend❤️","heading2":"Catalina C","ch_review_content2":"I lost a lot of hair after my baby girl was born. I searched on different products being very selective. And I came across ST. Tropical and fell in love with the ingredients. I did a before & after pic- results don’t lie!!!!! Highly recommend❤️","review__Count3":"true","ch_review_img3":"shopify:\/\/shop_images\/Charlotte_M.png","title3":"It’s really an amazing product","heading3":"Charlotte M","ch_review_content3":"I have long hair but after having a baby it caused a lot of hair loss. I decided to try this product after reading so many positive reviews and I am so happy I did. My hair grew longer and I notice that my hair is thickening up and feels so soft. It’s really an amazing product and I will continue to use forever.","review__Count4":"true","ch_review_img4":"shopify:\/\/shop_images\/Stephanie_L.png","title4":"Already placed my second order!","heading4":"Stephanie L","ch_review_content4":"I had a lot of postpartum hair loss so I was desperate to get some of my hair thickness back. I was diligent in taking my St Tropica everyday and the baby hairs do not lie. All my hair growth is along the front and sides of my hair line but it’s a process. New hair means it’s growing back! Already placed my second order! I can’t wait until all this baby hair catches up to my normal hair length!"}},"e2dbf882-16f8-4565-af4d-9be7bb686c9c":{"type":"60day-challenge","settings":{"review__Count1":"true","ch_review_img":"shopify:\/\/shop_images\/Cindy_Rodriguez.png","title":"I am very happy with this product","heading":"Cindy R","ch_review_content":"After I had my children I started losing my hair. I started to find bald spots near my hairline. I had beautiful hair before and during my pregnancies. Postpartum not so much. I'd take showers and clumps of hair would come out. I've been taking this product for 4months and my hair grew and I saw new growth where I was balding. My hair was shiny and felt thicker. I am very happy with this product and will be subscribing to receive monthly!! Thank you St Tropica and Beauty101byLisa!!!","review__Count2":"true","ch_review_img2":"shopify:\/\/shop_images\/Emel_O.png","title2":"60 day results are amazing!","heading2":"Emel O","ch_review_content2":"Been dealing with postpartum hair loss for a year now, and nothing worked finally gave St. Tropica a try and I must say the 60 day results are amazing!","review__Count3":"true","ch_review_img3":"shopify:\/\/shop_images\/Melinda.png","title3":"My hair is growing longer, & thicker","heading3":"Melinda","ch_review_content3":"I have dealt with thinning hair. I have 5 children, and postpartum hair loss has always hit me hard. I have tried many products, with little to no success. The St. Tropica vitamin is a miracle worker. My hair is growing longer, and thicker. It just feels healthy.. I can't wait to see what the next 60 days bring.","review__Count4":"true","ch_review_img4":"shopify:\/\/shop_images\/Alexa_Hilleary_9a8d1c53-5f81-40b2-bd4f-7245c9feafc1.png","title4":"I love love this product","heading4":"Alexa H","ch_review_content4":"I've been using it 2 months now it has made my hair longer and help my hair grow back from Postpartum hair loss I am very pleased with the results and will be continuing buying this product I also still breastfeed and had the doctor look over it she said it's okay to take so that was good to hear"}},"33145bf0-d917-41e1-9142-509bd25cd1f8":{"type":"60day-challenge","settings":{"review__Count1":"true","ch_review_img":"shopify:\/\/shop_images\/Gabriella_Fletcher_bf2d006e-b3e8-405b-849d-0c632155287c.png","title":"My hair feels sooo much better!","heading":"Gabriella F","ch_review_content":"It feels fuller and like it has more life to it. Also my \"Postpartum hair spots\" are beginning to fill in! Hoping it continues to only get better!","review__Count2":"true","ch_review_img2":"shopify:\/\/shop_images\/TaQavia_Almond.png","title2":"I'm very happy with my results","heading2":"TaQavia A","ch_review_content2":"After going through Postpartum I was losing my hair by the hand full. I wanted to try something new and more natural and I came across St.Tropica. In 60 days my hair grew 2.5 inches more and it stop shedding. Now that my hair is stronger, longer and thicker, I cant wait to see to see what happens next. I will continue to incorporate this vitamins into my daily routine. Thanks St. Tropica!","review__Count3":"true","ch_review_img3":"shopify:\/\/shop_images\/Saige_Clawson.png","title3":"My hair is thicker and softer","heading3":"Saige C","ch_review_content3":"I've had so may baby hairs growing in since taking these! Postpartum made my hair fall out in clumps and this saved my life! My hair is thicker and softer ( it’s not longer because I had it cut)","review__Count4":"true","ch_review_img4":"shopify:\/\/shop_images\/Araceli_R.png","title4":"my hair has gotten longer too!","heading4":"Araceli R","ch_review_content4":"Let me just say that I’m always skeptical about some of the products I come across. I kept saying I would try these vitamins, but kept putting them off. My hair was falling off in chunks, literally chunks! Until I got to a point where I had to do something about it. I was 4 months Postpartum and still taking prenatals and a hair vitamin, but I kept loosing a lot of hair. About 2 weeks after starting to take them, I noticed I wasn’t having as much hair loss. I still have some hair fall but it is nothing like before, I have so much new hair growth and my hair has gotten longer too! I finished my 2 month supply today, and I’m so happy with my results! I wish I would of ordered them sooner!"}}},"block_order":["cf526795-f148-4d3c-a0ab-f16401c24823","9507dd60-85f8-43b2-9cad-c6d10a6a90aa","f1907240-3e5c-4b5b-a21a-8b3b2140a861","724a4f58-8a6c-4b59-bd25-06e40e1fa768","a0d8e41c-f33a-4597-92a9-c21d11597728","e2dbf882-16f8-4565-af4d-9be7bb686c9c","33145bf0-d917-41e1-9142-509bd25cd1f8"],"settings":{"specialized__review_title":"REAL PEOPLE WITH REAL RESULTS","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"animation":"none","css_class":"","css_id":"","custom_css":""}},"164864287453c7f8d9":{"type":"index__featured-product","blocks":{"164864287420959887-0":{"type":"title","settings":{}},"164864287420959887-1":{"type":"price","settings":{"display_savings":true}},"164864287420959887-3":{"type":"form","settings":{"show_payment_button":true}}},"block_order":["164864287420959887-0","164864287420959887-1","164864287420959887-3"],"settings":{"affiliate_code":"postpartum","featured_product":"st-tropica-hair-vitamins-hair-challenge-2-month-supply","product_images_position":"left","set_product_height":false,"product_height":500,"video_looping":false,"gallery_arrows":true,"enable_zoom":true,"enable_product_lightbox":true,"slideshow_speed":0,"slideshow_transition":"slide","display_thumbnails":true,"thumbnail_position":"left-thumbnails","enable_thumbnail_slider":true,"width":"wide","padding_top":60,"padding_bottom":0,"animation":"none","css_class":"","custom_css":".product-gallery__main, .product-gallery__thumbnails.is-slide-nav--true {\n    opacity: 1;\n}"}},"164864161709cc9c7d":{"type":"specialized__page_faqs","blocks":{"14ce59e5-7424-4c34-a3d8-48c062739269":{"type":"specialized__faqs","settings":{"heading":"What are the Symptoms of Postpartum Depression?","specialized__faqs_ans":"<ul class=\"ul-disc\">\n    <li>Feelings of sadness and depression<\/li>\n    <li>Mood swings<\/li>\n    <li>Excessive crying<\/li>\n    <li>Difficulty bonding with your newborn<\/li>\n    <li>Feeling withdrawn<\/li>\n    <li>A extreme loss or gain of appetite<\/li>\n    <li>Insomnia<\/li>\n    <li>Hopelessness<\/li>\n    <li>Feelings of worthlessness<\/li>\n    <li>Restlessness<\/li>\n    <li>Fatigue<\/li>\n    <li>Increased irritability<\/li>\n    <li>Severe anxiety<\/li>\n    <li>Panic attacks<\/li>\n    <li>Thoughts of harming yourself or your baby<\/li>\n    <li>Thoughts of death or suicide<\/li>\n<\/ul>","faqs__expand":"true"}},"76fbbe06-531c-4dad-9828-4067cf6faec3":{"type":"specialized__faqs","settings":{"heading":"What Should You Do If You Suspect You have Postpartum Depression?","specialized__faqs_ans":"<p>If you are experiencing any of the symptoms noted above, or know someone who is experiencing these symptoms, immediately seek medical assistance.<\/p>","faqs__expand":"false"}},"bee42407-8a7b-46ba-a7e5-7ac312a74875":{"type":"specialized__faqs","settings":{"heading":"Postpartum Hair Loss: What Causes Postpartum Hair Loss?","specialized__faqs_ans":"<p data-uw-styling-context=\"true\">While Postpartum hair loss is completely normal, we understand that it can be scary to notice hair loss and hair thinning.<\/p>\n<p data-uw-styling-context=\"true\">The reason Postpartum hair loss occurs following your pregnancy is because during your pregnancy your hormones keep your hair from falling out as they regularly would.<\/p>\n<p data-uw-styling-context=\"true\">Each day, the average person loses around 100 hairs but during pregnancy your hormones prevent this from happening. This means that during your pregnancy you'll find that your hair is fuller than before.<\/p>\n<p data-uw-styling-context=\"true\">Once you've given birth, and the hormones in your body begin to regulate, you'll find that your hair will shed as it tries to go back to it's normal thickness and this is what is known as Postpartum hair loss.<\/p>\n<p data-uw-styling-context=\"true\">Postpartum hair loss and new growth can be a jarring experience as you're both experiencing hair loss as well as new growth which means you'll find your hair is both thinning while also seeing an influx of new baby hairs coming in.<\/p>","faqs__expand":"false"}},"0f55ec73-6435-4b71-ac34-e68b178f96d5":{"type":"specialized__faqs","settings":{"heading":"When Does Postpartum Hair Loss Start?","specialized__faqs_ans":"<p class=\"\" data-uw-styling-context=\"true\">Postpartum hair loss begin the day that you give birth. However, it typically takes about 4 months to notice Postpartum hair loss and your hair can continue shedding for a full year.<\/p>","faqs__expand":"false"}},"56e1724b-d3f3-40e0-bb77-e707653ec8f6":{"type":"specialized__faqs","settings":{"heading":"When will Postpartum Hair Loss Regrowth Begin?","specialized__faqs_ans":"<p class=\"\" data-uw-styling-context=\"true\">Typically around the 6-12 month you'll begin to notice new hair growth. These are often referred to as baby hairs or \"baby bangs\".<\/p>","faqs__expand":"false"}},"77c0510a-079a-48b0-83cf-d02330ec842c":{"type":"specialized__faqs","settings":{"heading":"How to Limit Postpartum Hair Loss?","specialized__faqs_ans":"<p>There are many ways to limit and treat Postpartum hair loss. While the first\n    step is to always address any health concerns you're having with your physician, there are also a few other ways you\n    can care for your hair and prevent further hair loss or damage, these include:<\/p>\n<p><b>Tips for Caring for Postpartum Hair:<\/b><\/p>\n<ul class=\"ul-disc\">\n    <li>Consult your physician about implementing a hair growth vitamin into your diet.\n    <\/li>\n    <li>Refrain from using heat tools on your hair to avoid damage. Instead try heatless\n        hairstyling methods or styles (like our <a href=\"\/blogs\/st-tropica\/hair-treatment-classic-braid-bun-tutorial\">classic braided bun<\/a>) to style your\n        hair.<\/li>\n    <li>Swap out your elastic bands for softer scrunchies to avoid pulling on the roots\n        of your hair and causing more damage to the shaft and ends of your hair.<\/li>\n    <li>Use hot oil hair masks regularly to strengthen your hair and provide your scalp\n        with a nutrient rich treatment.<\/li>\n    <li>Use a satin pillow case to prevent unnecessary scalp irritation or damage to the\n        hair. Rough cotton pillow cases can be damaging to your hair and scalp.<\/li>\n<\/ul>","faqs__expand":"false"}},"18b541e2-f940-46fd-83f2-52f338c2243f":{"type":"specialized__faqs","settings":{"heading":"Can Vitamins Help with Postpartum Hair Loss?","specialized__faqs_ans":"<p>Yes! Supplementing with the right Vitamins can absolutely help.<\/p>\n<p>Our celebrated <a href=\"https:\/\/www.sttropica.com\/collections\/st-tropica-collection\/products\/st-tropica-hair-vitamins-hair-challenge-2-month-supply\" target=\"_blank\" title=\"Tru Bloom Hair Growth Vitamins\" rel=\"noopener noreferrer\">ST. TROPICA Hair Vitamins<\/a> have already helped many people suffering from Postpartum related hair loss. Once again, all of the photos and reviews seen here are from our very own customers. They are 100% genuine and authentic, unedited, and unsolicited. They are from REAL people, with REAL results.<\/p>\n<p><a href=\"https:\/\/www.sttropica.com\/collections\/st-tropica-collection\/products\/st-tropica-hair-vitamins-hair-challenge-2-month-supply\" target=\"_blank\" title=\"Tru Bloom Hair Growth Vitamins\" rel=\"noopener noreferrer\">ST. TROPICA Hair Growth Vitamins<\/a> are a different kind of Hair Vitamin. They include 100% or more of the DV (Daily Value) of all the essential hair nutrients, PLUS our Proprietary, highly researched, plant &amp; fruit based HAIR SUPERFOOD formula. We have hand-selected only the best ingredients to create the world's best Hair Vitamins. Our 12 essential hair health ingredients (Vitamins, Protein &amp; Minerals) + 7 exclusive Hair Superfoods help maximize Hair Growth, Strength, and Thickness from the inside out. <\/p>\n<p>The Tru Bloom Hair Growth Vitamins are also 100% Drug-Free and Allergen Free. This means that they free of all 8 allergens for Nutritional Supplements, which are wheat, soy, peanuts, dairy, tree nuts, crustaceans, fish, and eggs!<\/p>\n<p>What’s more is that they come with our exclusive 100 DAY MONEY BACK GUARANTEE: Simply take our 60 Day Hair Challenge, and get Longer, Stronger Hair in 60 days flat, or your money back - where will we give you a full refund if you’re not delighted with your results. It's the Ultimate daily Hair Vitamin for extraordinary results, and we’ve made it a no-brainer by including our Ultimate Money-Back Guarantee, ensuring your total satisfaction.<\/p>","faqs__expand":"false"}}},"block_order":["14ce59e5-7424-4c34-a3d8-48c062739269","76fbbe06-531c-4dad-9828-4067cf6faec3","bee42407-8a7b-46ba-a7e5-7ac312a74875","0f55ec73-6435-4b71-ac34-e68b178f96d5","56e1724b-d3f3-40e0-bb77-e707653ec8f6","77c0510a-079a-48b0-83cf-d02330ec842c","18b541e2-f940-46fd-83f2-52f338c2243f"],"settings":{"affiliate_code":"postpartum","specialized__faqs_title":"POSTPARTUM FAQ","show__spe__review":true,"specialized__review_title":"I am in love!","specialized__review_name":"Ernessie L","specialized__review_img":"shopify:\/\/shop_images\/Ernessie_Ladouceur.png","specialized__review_content":"After trying St. Tropica for 60 days, I am in love! I recently cut my hair due to a bad relaxer. My edges were thin and bald in some areas due to Postpartum hair loss. I was taking other supplements but they were not working with my thin hairline. In three weeks time, I noticed a significant difference in my hairline and definitely fullness all around. While taking these supplements, I didn't have any reaction with my skin or digestion. In the past, I would burp the supplements but I didn't have this issue at all. With the great results I have had, I ordered a second bottle. When my shipment arrived, it only came with a hair mask. I contacted their customer service and they sent me my bottle through next day shipping. I am so happy I gave this a try!","width":"wide","padding_top":60,"padding_bottom":20,"padding_left":0,"padding_right":0,"review__side":"order-0","animation":"none","css_class":"","css_id":"review2","custom_css":".trubloom_review_bg{\n    background-image: url(https:\/\/cdn.shopify.com\/s\/files\/1\/0818\/8965\/t\/96\/assets\/trubloom_review_bg_1.png?v=1648728108);\n    background-size: cover;\n}\n.trubloom_review_bg .purchase-details__buttons .action_button.action_button--secondary {\n    border: 1px solid #ff9ac6;\n    color: #ffffff;\n    background: #ff9ac6;\n}"}},"1650000112141fd19d":{"type":"custom-liquid","settings":{"custom_liquid":"<div id=\"stamped-main-widget\" class=\"mx-0 mb-0\" data-keyword=\"postpartum\"><\/div>\n<a href=\"\/products\/st-tropica-hair-vitamins-hair-challenge-2-month-supply\" class=\"button mx-auto\">Order Now<\/a>\n<style>\ndiv.stamped-container[data-widget-style], div[data-widget-style] div.stamped-container {\n    margin: 0px auto!important;\n}\n<\/style>"}}},"order":["164872987662732b2c","16486356205a406201","165596325950489666","1648640448df60772a","1648645038b9435b55","164864287453c7f8d9","164864161709cc9c7d","1650000112141fd19d"]}