{"sections":{"164872987662732b2c":{"type":"specialized__page_header","settings":{"spl_text":"WIDELY REGARDED AS THE BEST HAIR GROWTH VITAMINS FOR Autoimmune Disease related Hair Loss","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"animation":"none","css_class":"","custom_css":".special-head{\n    background-image: url({{ 'trubloom_review_bg.png' | asset_url }});\n    background-size: cover;\n}\n.home-slide-content p {\n    color: #727272;\n    font-size: 18px;\n}\n.home-slide-content h2 {\n    color: #ff9ac6;\n    font-size: 26px;\n}"}},"16486356205a406201":{"type":"specialized__page_top","settings":{"specialized__title":"AUTOIMMUNE DISEASES AND <br> HAIR LOSS","specialized__top_content":"<p>We've been honored to hear from thousands of real customers that our Hair Vitamins have helped them through their hair loss struggles.<br\/><br\/>People from around the world who've suffered from Autoimmune Diseases in particular, have been kind enough to submit reviews and results highlighting their positive experiences with ST. TROPICA. And we want to pay it forward by sharing with anyone & everyone who also may be dealing with Autoimmune Diseases.<br\/><br\/>Many of us may not know what Autoimmune Diseases is, and may have concerns over being undiagnosed; or just excited to find a resource focused specifically on Autoimmune Diseases and hair loss. So let's dive into it.<\/p>","show__spe__review":true,"specialized__review_title":"I am so grateful","specialized__review_name":"Ruth B","specialized__review_img":"shopify:\/\/shop_images\/Ruth_B.png","specialized__review_content":"I had experienced an extreme and sudden hair loss episode back in February due to a surgical procedure. I had already been suffering thinning of my hair due to an auto immune disorder, but my body literally dumped about 50% of the hair from my scalp over a course of 2 weeks...I was devastated. I had to purchase a wig in order to return to work. I found ST Tropica through IG, and after reading the reviews, and even making contact with another customer, I immediately ordered the pills. They have saved my hair and my confidence...my hair has grown back faster and thicker than before. I honestly didn't think there was a product out there that could do this for me, because NOTHING else had helped to restore my hair. I don't think I can never stop taking these pills...my results have been amazing and I am so grateful.","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"review__side":"order-0","animation":"none","css_class":"","custom_css":""}},"165595998361ecd6f2":{"type":"specialized__survey_section","settings":{"affiliate_code":"autoimmune","width":"wide","padding_top":70,"padding_bottom":20,"padding_left":0,"padding_right":0,"review__side":"order-0","animation":"none","css_class":"","custom_css":""}},"1648640448df60772a":{"type":"specialized__what_is","settings":{"specialized__what_icon1":"shopify:\/\/shop_images\/Autoimmune1.png","specialized__what_title":"WHAT IS AN AUTOIMMUNE DISEASE?","specialized__what_content":"<p>An autoimmune disease is a type of condition that occurs when the body's immune system mistakenly attacks healthy body tissues.<br\/><br\/>An example of an autoimmune disease is <a href=\"https:\/\/www.sttropica.com\/pages\/Thyroid-disease-hair-loss-1#Hashimoto\">Hashimoto's Disease<\/a>. Hashimoto's Disease is an autoimmune disease that occurs when the immune system attacks the thyroid gland and it typically results in <a href=\"https:\/\/www.sttropica.com\/pages\/Thyroid-disease-hair-loss-1#Hypothyroidism\">Hypothyroidism<\/a>. This is just one example is an autoimmune disease. Currently, there are over 80 known Autoimmune Diseases.<\/p>","show__sym":false,"specialized__sym_title":"","specialized__sym_content":"","specialized__how_title":"HOW CAN ST. TROPICA HAIR VITAMINS HELP?","specialized__how_content":"<p>We are excited to share that we are constantly receiving incredibly positive feedback, in the form of 5 star photo reviews, from many of our valued customers who are struggling with Autoimmune Disease related hair loss; and who are experiencing tremendous results by using our one-of-a-kind Tru Bloom Hair Vitamins. All of the photos and reviews seen here are 100% genuine and authentic, and they are unedited, and unsolicited. In short, they are the real deal.<br\/><br\/>Tru Bloom Hair Growth Vitamins by ST. TROPICA are a different kind of Hair Vitamin. They include 100% or more of the DV (Daily Value) of all the essential hair nutrients, PLUS our Proprietary, highly researched, plant & fruit based HAIR SUPERFOOD formula. We have hand-selected only the best ingredients to create the world's best Hair Vitamins. Our 12 essential hair health ingredients (Vitamins, Protein & Minerals) + 7 exclusive Hair Superfoods help maximize Hair Growth, Strength and Thickness from the inside-out.<br\/><br\/>What’s more is that they come with an exclusive 100 DAY MONEY BACK GUARANTEE: Simply take our 60 Day Hair Challenge, and get Longer, Stronger Hair in 60 days flat, or your money back - where will we give you a full refund if you’re not delighted with your results. It's the Ultimate daily Hair Vitamin for extraordinary results, and we’ve made it a no-brainer by including our Ultimate Money-Back Guarantee, ensuring your total satisfaction.<\/p>","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"animation":"none","css_class":"","custom_css":""}},"1648645038b9435b55":{"type":"specialized__review_slide","blocks":{"cfaefd5d-4ca5-4607-9b80-982e63500dd0":{"type":"60day-challenge","settings":{"review__Count1":"true","ch_review_img":"shopify:\/\/shop_images\/Brittany_F.png","title":"My hair feels like it’s getting thicker","heading":"Brittany F","ch_review_content":"My overall experience is a thumbs up for this product. I was desperate. I’ve tried Biotin gummies and have taken them for months prior but ever since being diagnosed with an auto immune disease and then the side effects involving hair. My entire life I’ve had a ton of hair (super thick) that grew super fast always. After a couple weeks to a month on the medicine, I noticed thinning (ton of hair fall out after showering, after brushing, just combing my hand through my hair and just after a nights sleep waking up to strands all over my pillow) was beyond alarming. I have to say that after 1 month I noticed an improvement. I don’t notice length wise in a picture a difference between day 1 and day 60 so thickness is only shown but I notice a couple inches of hair growth since a haircut in September. I did not when starting this vitamin. All of a sudden I double took to the mirror noticing that my hair grew. Not major no but a slight difference in my shedding. After 2 months I noticed a difference in the overall health. My hair feels like it’s getting thicker and the shedding is still slightly less. I will continue taking these vitamins. I feel like it takes time for results and that’s what I will give it. This hair vitamin is working fighting against a side effect which I think says something. Praying for more results","review__Count2":"true","ch_review_img2":"shopify:\/\/shop_images\/Teagan_Tilson.png","title2":"My hair was my pride and joy","heading2":"Teagan T","ch_review_content2":"I fell ill with an Auto immune disease, and I started to shed and lose all of my hair. I lost about 5” in length and it started to thin out and shed daily. My hair was my pride and joy, and I was absolutely devastated. I have been looking for a vitamin to help jumpstart my growth, and I was unsuccessful until I started to use your product. I was so thrilled, I told my sister and she started to use it as well! I’m in love with the results, and I can’t wait to see more growth. My hair looks healthier and strong. Thank you for everything!!!!","review__Count3":"true","ch_review_img3":"shopify:\/\/shop_images\/Janice_E.png","title3":"I will continue to use vitamins","heading3":"Janice E","ch_review_content3":"For me this is amazing product because I have an auto immune disease and must be careful what I use and need to make sure it doesn’t interfere with my other meds and infusions. Mentioned illness cause my dr approved it also. I don’t get nauseous after taking them. I will continue to use vitamins. I’m going to try the coconut chocolate one next. I will use hair mask tonight and will keep posted the results also. Thank you for a clean wonderful product which goes well with my shampoos also. I use WEN hair products and this makes it work better.","review__Count4":"true","ch_review_img4":"shopify:\/\/shop_images\/Kristi_Luffman.png","title4":"my hair is growing finally","heading4":"Kristi L","ch_review_content4":"Outstanding!! I lost my hair due to an autoimmune disease. I have always had this hair anyway. After just 60 days my hair is growing finally. And it is thicker. I will continue to purchase. The vitamins do what they say and totally work. I’m slowly regaining my self confidence. I can not express how happy I am to have found this product. The photo is Day 1, 30, and 60. You will not regret trying it."}},"2aac819e-77c5-4603-b09d-2199fd49ef8f":{"type":"60day-challenge","settings":{"review__Count1":"false","title":"","heading":"","ch_review_content":"","review__Count2":"false","title2":"","heading2":"","ch_review_content2":"","review__Count3":"false","title3":"","heading3":"","ch_review_content3":"","review__Count4":"true","ch_review_img4":"shopify:\/\/shop_images\/Tracy_Krueger.png","title4":"60 days in, feeling optimistic","heading4":"Tracy K","ch_review_content4":"I feel like I do see differences in the fullness of my hair and there is definitely some new growth happening. As someone with an autoimmune disorder, no thyroid, and hormonal imbalances anything that helps is a miracle, I never expect my results to be as fast as others but I am definitely optimistic and I’ll be continuing to try these for a few more months."}}},"block_order":["cfaefd5d-4ca5-4607-9b80-982e63500dd0","2aac819e-77c5-4603-b09d-2199fd49ef8f"],"settings":{"specialized__review_title":"REAL PEOPLE WITH REAL RESULTS","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"animation":"none","css_class":"","css_id":"","custom_css":""}},"164864287453c7f8d9":{"type":"index__featured-product","blocks":{"164864287420959887-0":{"type":"title","settings":{}},"164864287420959887-1":{"type":"price","settings":{"display_savings":true}},"164864287420959887-3":{"type":"form","settings":{"show_payment_button":true}}},"block_order":["164864287420959887-0","164864287420959887-1","164864287420959887-3"],"settings":{"affiliate_code":"autoimmune","featured_product":"st-tropica-hair-vitamins-hair-challenge-2-month-supply","product_images_position":"left","set_product_height":false,"product_height":500,"video_looping":false,"gallery_arrows":true,"enable_zoom":true,"enable_product_lightbox":true,"slideshow_speed":0,"slideshow_transition":"slide","display_thumbnails":true,"thumbnail_position":"left-thumbnails","enable_thumbnail_slider":true,"width":"wide","padding_top":60,"padding_bottom":0,"animation":"none","css_class":"","custom_css":".product-gallery__main, .product-gallery__thumbnails.is-slide-nav--true {\n    opacity: 1;\n}"}},"164864161709cc9c7d":{"type":"specialized__page_faqs","blocks":{"ca66ed0c-3d8b-4355-82b4-9bd8bff308ba":{"type":"specialized__faqs","settings":{"heading":"WHAT CAUSES AUTOIMMUNE DISEASES?","specialized__faqs_ans":"<p>The exact cause of Autoimmune Diseases is currently unknown though there are a few theories regarding a possible over-reaction from the immune system after an illness, infection, or injury. This hyperactive immune system response begins by correctly attacking the illness, infection, or injury however once the body recovers, the immune system continues to attack healthy cells.<\/p> \n<p>While we do not yet know the exact cause of Autoimmune Diseases, we do know that there are a number of factors that can make a person have a predisposition to developing an autoimmune disease, such as:<\/p>\n<ul class=\"ul-disc\"> <li>Genetics<\/li> <li>Weight<\/li> <li>Smoking<\/li> <li>Medications<\/li>\n<\/ul>","faqs__expand":"true"}},"8d9289dc-ca69-45c0-9093-d3d10c91cb4f":{"type":"specialized__faqs","settings":{"heading":"WHAT ARE SOME OF THE MOST COMMON AUTOIMMUNE DISEASES?","specialized__faqs_ans":"<p>As of today, there are over 80 unique Autoimmune Diseases known to medical professionals. These are the top 10 most common Autoimmune Diseases:<\/p> <ul class=\"ul-disc\"> <li>Type 1 Diabetes<\/li> <li>Rheumatoid Arthritis (RA)<\/li> <li>Psoriasis\/Psoriatic arthritis<\/li> <li>Multiple Sclerosis<\/li> <li>Systemic Lupus Erythematosus (SLE)<\/li> <li>Inflammatory Bowel Disease (Ulcerative colitis and Crohns Disease)<\/li> <li>Addison's Disease<\/li> <li>Graves' Disease<\/li> <li>Hashimoto’s Thyroiditis<\/li> <li>Celiac Disease<\/li>\n<\/ul>","faqs__expand":"false"}},"4f98e26d-5ce7-4fa1-b0e0-e0a497e7b1fb":{"type":"specialized__faqs","settings":{"heading":"COMMON AUTOIMMUNE DISEASE SYMPTOMS","specialized__faqs_ans":"<p>While there are a number of unique Autoimmune Diseases, having them correctly diagnosed can be a challenge due to the similarity of their symptoms.<\/p> <p>Many Autoimmune Diseases share symptoms such as fatigue, achy muscles, low-grade fever, brain fog, hair loss, skin rashes, skin dryness and numbness\/tingling in the hands and feet.<\/p> <p>For this reason, it is important to document all of your symptoms over a period of time so that your doctor can assess those symptoms and begin testing.<\/p>","faqs__expand":"false"}},"15894c6b-04ed-462d-8ca3-6a4b38a00e4c":{"type":"specialized__faqs","settings":{"heading":"WHY DO AUTOIMMUNE DISEASE'S CAUSE HAIR LOSS?","specialized__faqs_ans":"<p>Some Autoimmune Diseases (such as <a href=\"\/pages\/alopecia\" data-uw-rm-brl=\"false\">Alopecia Areata<\/a> and some forms of <a href=\"\/pages\/lupus\" data-uw-rm-brl=\"false\">Lupus<\/a>) target the hair follicle or scalp resulting in thinning hair and hair loss.<\/p> <p>However, not all hair loss caused by Autoimmune Diseases is due to the damage of the hair follicle. Some of the hair loss experienced may also be due to nutritional deficiencies and\/or stress (also known as <a href=\"\/pages\/telogen-effluvium\" data-uw-rm-brl=\"false\">Telogen Effluvium<\/a>) caused by the autoimmune disease. In addition, some medications may also impact hair growth.<\/p>","faqs__expand":"false"}},"dd2bc885-d173-423b-ac98-5d74f156c393":{"type":"specialized__faqs","settings":{"heading":"WHICH AUTOIMMUNE DISEASE CAUSE HAIR LOSS?","specialized__faqs_ans":"<p>There are a number of Autoimmune Disease that can cause hair loss and hair thinning, a few of the most common to report hair loss include:<\/p>\n<ul class=\"ul-disc\"> <li><a href=\"\/pages\/alopecia\" data-uw-rm-brl=\"false\">Alopecia Areata<\/a><\/li> <li><a href=\"\/pages\/hashimotos-disease-and-hair-loss\" data-uw-rm-brl=\"false\">Hashimoto's Thyroiditis &amp; Hypothyroidism<\/a><\/li> <li><a href=\"\/pages\/graves-disease-and-hair-loss\" data-uw-rm-brl=\"false\">Graves Disease &amp; Hyperthyroidism<\/a><\/li> <li><a href=\"\/pages\/lupus\" data-uw-rm-brl=\"false\">Lupus<\/a><\/li>\n<\/ul>","faqs__expand":"false"}},"61d153a6-ac72-4b84-bfdd-ba374fd25e21":{"type":"specialized__faqs","settings":{"heading":"HOW CAN I TREAT HAIR LOSS CAUSED BY AN AUTOIMMUNE DISEASE?","specialized__faqs_ans":"<p>There are a number of ways to prevent and treat hair loss caused by Autoimmune Diseases. First and foremost though, you must be diagnosed and treated by a doctor to ensure your Autoimmune Disease does not progress.<\/p>\n<p>However, a few lifestyle changes you could make include:<\/p>\n\n<p><b>USING A SATIN PILLOWCASE<\/b><\/p>\n<p>Cotton pillowcases can cause some damage to your hair. As you toss and turn in your sleep, your hair will snag and get caught on the rougher fibres of a cotton pillowcase. Overtime, this can cause damage and lead to hair breakage.<\/p>\n<p>Instead of using a cotton pillowcase, we recommend using a satin one. Satin pillowcases are softer, smoother, and provide more slip for the hair. This will prevent the hair from snagging, becoming tangled, and will prevent future breakage.<\/p>\n\n<p><b>USING HOT OIL HAIR AND SCALP TREATMENTS REGULARLY<\/b><\/p>\n<p>To best care for your hair and scalp, we recommend using a hot oil hair treatment either once a week or once every two weeks. Hot oil treatments are excellent for nourishing the scalp and hair. By caring for the scalp, you are encouraging faster and healthier hair growth as caring for the hair helps reduce breakage.<\/p>\n\n<p><b>ASSESSING DIETARY AND NUTRITIONAL NEEDS<\/b><\/p>\n<p>Hair growth can be dramatically impacted by nutritional deficiencies which is why it is so important to have your overall health assessed by a medical professional. If you do have any nutritional deficiencies it is important to implement supplements to correct them.<\/p>\n\n<p><b>MAINTAINING A SLEEP ROUTINE<\/b><\/p>\n<p>Sleep deprivation can have a very negative affect on the body. Initially may will find that your cognitive and energy levels are impacted but overtime sleeplessness can also effect other bodily functions.<\/p>\n<p>Hair loss can occur when sleepless results in a decrease of melatonin levels as they help regulate the hair growth cycle. In addition, sleeplessness can cause stress and extreme stress can cause hair loss. Hair loss resulting from stress is known as <a href=\"\/pages\/telogen-effluvium\" data-uw-rm-brl=\"false\">Telogen Effluvium<\/a>.<\/p>\n\n<p><b>TAKING A HAIR GROWTH SUPPLEMENT<\/b><\/p>\n<p>A hair growth supplement can play an important role in improving hair growth and preventing hair loss. Hair supplements often contain important vitamins, minerals, and antioxidants which encourage and support hair growth.<\/p>","faqs__expand":"false"}},"cb66c7ba-3215-40ac-a709-70d484d4e6cf":{"type":"specialized__faqs","settings":{"heading":"CAN VITAMINS HELP WITH HAIR LOSS FROM AUTOIMMUNE DISEASE?","specialized__faqs_ans":"<p>Yes! Supplementing with the right Vitamins can absolutely help.<\/p>\n<p>Our celebrated <a href=\"https:\/\/www.sttropica.com\/collections\/st-tropica-collection\/products\/st-tropica-hair-vitamins-hair-challenge-2-month-supply\" target=\"_blank\" title=\"Tru Bloom Hair Growth Vitamins\" rel=\"noopener noreferrer\">ST. TROPICA Hair Vitamins<\/a> have already helped many people suffering from Autoimmune Diseases related hair loss. Once again, all of the photos and reviews seen here are from our very own customers. They are 100% genuine and authentic, unedited, and unsolicited. They are from REAL people, with REAL results.<\/p>\n<p><a href=\"https:\/\/www.sttropica.com\/collections\/st-tropica-collection\/products\/st-tropica-hair-vitamins-hair-challenge-2-month-supply\" target=\"_blank\" title=\"Tru Bloom Hair Growth Vitamins\" rel=\"noopener noreferrer\">ST. TROPICA Hair Growth Vitamins<\/a> are a different kind of Hair Vitamin. They include 100% or more of the DV (Daily Value) of all the essential hair nutrients, PLUS our Proprietary, highly researched, plant &amp; fruit based HAIR SUPERFOOD formula. We have hand-selected only the best ingredients to create the world's best Hair Vitamins. Our 12 essential hair health ingredients (Vitamins, Protein &amp; Minerals) + 7 exclusive Hair Superfoods help maximize Hair Growth, Strength, and Thickness from the inside out. <\/p>\n<p>The Tru Bloom Hair Growth Vitamins are also 100% Drug-Free and Allergen Free. This means that they free of all 8 allergens for Nutritional Supplements, which are wheat, soy, peanuts, dairy, tree nuts, crustaceans, fish, and eggs!<\/p>\n<p>What’s more is that they come with our exclusive 100 DAY MONEY BACK GUARANTEE: Simply take our 60 Day Hair Challenge, and get Longer, Stronger Hair in 60 days flat, or your money back - where will we give you a full refund if you’re not delighted with your results. It's the Ultimate daily Hair Vitamin for extraordinary results, and we’ve made it a no-brainer by including our Ultimate Money-Back Guarantee, ensuring your total satisfaction.<\/p>","faqs__expand":"false"}}},"block_order":["ca66ed0c-3d8b-4355-82b4-9bd8bff308ba","8d9289dc-ca69-45c0-9093-d3d10c91cb4f","4f98e26d-5ce7-4fa1-b0e0-e0a497e7b1fb","15894c6b-04ed-462d-8ca3-6a4b38a00e4c","dd2bc885-d173-423b-ac98-5d74f156c393","61d153a6-ac72-4b84-bfdd-ba374fd25e21","cb66c7ba-3215-40ac-a709-70d484d4e6cf"],"settings":{"affiliate_code":"autoimmune","specialized__faqs_title":"AUTOIMMUNE FAQ","show__spe__review":true,"specialized__review_title":"My hair is so much healthier","specialized__review_name":"Amanda W","specialized__review_img":"shopify:\/\/shop_images\/Amanda_W.png","specialized__review_content":"St. Tropica has created a wonderful formula for hair growth. I was skeptical in the beginning, I am now a believer. I saw incredible results within two weeks. My hair is so much healthier, and longer and fuller. These vitamins are truly wonderful, I have multiple autoimmune diseases and my hair was thinning, I am so grateful I found these vitamins. My hair is my crown and now I can straighten it and wear it with pride. Thanks St. Tropica","width":"wide","padding_top":60,"padding_bottom":20,"padding_left":0,"padding_right":0,"review__side":"order-0","animation":"none","css_class":"","css_id":"review2","custom_css":".trubloom_review_bg{\n    background-image: url(https:\/\/cdn.shopify.com\/s\/files\/1\/0818\/8965\/t\/96\/assets\/trubloom_review_bg_1.png?v=1648728108);\n    background-size: cover;\n}\n.trubloom_review_bg .purchase-details__buttons .action_button.action_button--secondary {\n    border: 1px solid #ff9ac6;\n    color: #ffffff;\n    background: #ff9ac6;\n}"}},"164999907600870e42":{"type":"custom-liquid","settings":{"custom_liquid":"<div id=\"stamped-main-widget\" class=\"mx-0 mb-0\" data-keyword=\"autoimmune\"><\/div>\n<a href=\"\/products\/st-tropica-hair-vitamins-hair-challenge-2-month-supply\" class=\"button mx-auto\">Order Now<\/a>\n<style>\ndiv.stamped-container[data-widget-style], div[data-widget-style] div.stamped-container {\n    margin: 0px auto!important;\n}\n<\/style>"}}},"order":["164872987662732b2c","16486356205a406201","165595998361ecd6f2","1648640448df60772a","1648645038b9435b55","164864287453c7f8d9","164864161709cc9c7d","164999907600870e42"]}