{"sections":{"164872987662732b2c":{"type":"specialized__page_header","settings":{"spl_text":"Widely regarded as the Best hair growth vitamins for POLYCYSTIC OVARY SYNDROME (PCOS) Related Hair Loss","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"animation":"none","css_class":"","custom_css":".special-head{\n    background-image: url({{ 'trubloom_review_bg.png' | asset_url }});\n    background-size: cover;\n}\n.home-slide-content p {\n    color: #727272;\n    font-size: 18px;\n}\n.home-slide-content h2 {\n    color: #ff9ac6;\n    font-size: 26px;\n}"}},"16486356205a406201":{"type":"specialized__page_top","settings":{"specialized__title":"POLYCYSTIC OVARY SYNDROME (PCOS) & HAIR LOSS","specialized__top_content":"<p>We've been honored to hear from thousands of real customers that our Hair Vitamins have helped them through their hair loss struggles.<\/p><p>People from around the world who've suffered from PCOS in particular, have been kind enough to submit reviews and results highlighting their positive experiences with ST. TROPICA. And we want to pay it forward by sharing with anyone & everyone who also may be dealing with PCOS.<\/p><p>Many of us may not know what PCOS is, and may have concerns over being undiagnosed; or just excited to find a resource focused specifically on PCOS and hair loss. So let's dive into it.<\/p>","show__spe__review":true,"specialized__review_title":"this is has done a miracle","specialized__review_name":"Yuliana C","specialized__review_img":"shopify:\/\/shop_images\/Yuliana_Cervantes.png","specialized__review_content":"Im 27 years old i have sufferd hair loss due to pcos. Have been on meds and no improvment. Have tried other hair growth vitmains in the market and had minimal results. Now this is has done a miracle really see the Pictures for yourself.","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"review__side":"order-0","animation":"none","css_class":"","custom_css":""}},"1655963000fde054ed":{"type":"specialized__survey_section","settings":{"affiliate_code":"pcos","width":"wide","padding_top":70,"padding_bottom":20,"padding_left":0,"padding_right":0,"review__side":"order-0","animation":"none","css_class":"","custom_css":""}},"1648640448df60772a":{"type":"specialized__what_is","settings":{"specialized__what_icon1":"shopify:\/\/shop_images\/pcos1.png","specialized__what_title":"WHAT IS POLYCYSTIC OVARY SYNDROME (PCOS)?","specialized__what_content":"<p>Polycystic Ovary Syndrome (PCOS) is a hormonal and endocrinological disorder that can occur any time after puberty. However is it most frequently diagnosed between the ages of 20-30 years old.<\/p>","show__sym":false,"specialized__sym_title":"","specialized__sym_content":"","specialized__how_title":"HOW CAN ST. TROPICA HAIR VITAMINS HELP?","specialized__how_content":"<p>We are excited to share that we are constantly receiving incredibly positive feedback, in the form of 5 star photo reviews, from many of our valued customers who are struggling with PCOS related hair loss; and who are experiencing tremendous results by using our one-of-a-kind Tru Bloom Hair Vitamins. All of the photos and reviews seen here are 100% genuine and authentic, and they are unedited, and unsolicited. In short, they are the real deal.<\/p><p>Tru Bloom Hair Growth Vitamins by ST. TROPICA are a different kind of Hair Vitamin. They include 100% or more of the DV (Daily Value) of all the essential hair nutrients, PLUS our Proprietary, highly researched, plant & fruit based HAIR SUPERFOOD formula. We have hand-selected only the best ingredients to create the world's best Hair Vitamins. Our 12 essential hair health ingredients (Vitamins, Protein & Minerals) + 7 exclusive Hair Superfoods help maximize Hair Growth, Strength and Thickness from the inside-out. They are also 100% Drug Free, and Allergen Free.<\/p><p>What’s more is that they come with an exclusive 100 DAY MONEY BACK GUARANTEE: Simply take our 60 Day Hair Challenge, and get Longer, Stronger Hair in 60 days flat, or your money back - where will we give you a full refund if you’re not delighted with your results. It's the Ultimate daily Hair Vitamin for extraordinary results, and we’ve made it a no-brainer by including our Ultimate Money-Back Guarantee, ensuring your total satisfaction.<\/p>","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"animation":"none","css_class":"","custom_css":""}},"1648645038b9435b55":{"type":"specialized__review_slide","blocks":{"0467cdc2-8cb2-4f41-840c-45ffc40feeb2":{"type":"60day-challenge","settings":{"review__Count1":"true","ch_review_img":"shopify:\/\/shop_images\/Emily.png","title":"I highly recommend these!","heading":"Emily S","ch_review_content":"I have PCOS and recently started experiencing extreme hair loss (at the age of 24). I have always had very thick hair and was heartbroken when I started shedding and losing so much hair to the point where I could see bald spots. Within 30 days of taking these pills, I notices less shedding and baby hair growth all over my hairline. I highly recommend these!","review__Count2":"true","ch_review_img2":"shopify:\/\/shop_images\/Rebecca.png","title2":"Definitely getting more of this!","heading2":"Rebecca","ch_review_content2":"This was my first bottle and I definitely plan on getting more. I have PCOS and have suffered hair thinning and loss because of it. While I didn’t have a huge difference in this first bottle you can tell my hair looks healthier and is growing. Definitely getting more of this!","review__Count3":"true","ch_review_img3":"shopify:\/\/shop_images\/Mojgan_B.png","title3":"Graves' disease then to Hashimoto","heading3":"Mojgan B","ch_review_content3":"Early in 2021 I was diagnosed with Graves' Disease.  Then in the summer I had to under go through Radioactive Iodine Therapy to address my Grave’s Disease.  Then shortly after my Radioactive Iodine Therapy, my TSH shot way up.  Needless to say, both underactive and overactive thyroid issues causes hairloss. And for folks with Graves’ Disease we are not able to take most hair supplements out there, as they have certain ingredients that we need to stay away from, ie: seaweed and kelp.  So, I did some research online and I stumbled upon St. Tropica. I cannot say enough great things about St. Tropica supplements.  I have been taking these supplements since March, 2021 and I can tell you it has helped me tremendously with hair growth during my ongoing thyroid issues. For me I am no so much interested in how fast my hair can grow, but rather prevent any balding as a result of my thyroid issues and treatments. There is no doubt in my mind that I would have had increasing thinning hair and possivle bald spots if it were not St. Tropica hair supplements.  In recent days I even bought a bottle for my daughter-in-law who has PCOS and has been losing hair as a result.  She has been taking the supplements for about 1 month now and we all have noticed baby hairs coming in. THANK YOU THANK YOU THANK YOU for an amazing product and having it at such an affordable price compared to what is out there.  Just need you guys to start making shampoos and conditioners.","review__Count4":"true","ch_review_img4":"shopify:\/\/shop_images\/Brenda_Vega.png","title4":"this is a hair miracle!!!","heading4":"Brenda V","ch_review_content4":"I was nervous to try the 2 month challenge because so many products had let me down in the past but I desperately needed to find something that would help my thinning hair! I had thick hair as a child but it began to fall out on clumps due to my eatting disorder as a teenager, I did not think much because i assumed it would grow back once I got better from that illness. It did not. In college my doctor diagnosed me with PCOS. I have several symptoms which includes thinning at the crown of my head and it then progressed to thinning at the middle of my hair as well. I WISH that I had know about these pills sooner because since taking them my hair barely falls out and my hair stylists told me that she can actually feel stubble of new hair growing!! Not only that but my hair has not felt thick like this in years...!! I left the hair salon that day feeling like a goddess full of hope! Whatever doubts you have or how many other products you have tried. I am telling you this is a hair miracle!!!"}},"cbcbed37-1a0b-49ad-be9d-812edc7135af":{"type":"60day-challenge","settings":{"review__Count1":"false","title":"","heading":"","ch_review_content":"","review__Count2":"false","title2":"","heading2":"","ch_review_content2":"","review__Count3":"true","ch_review_img3":"shopify:\/\/shop_images\/Michelle_H.png","title3":"keep this hair growth going","heading3":"Michelle H","ch_review_content3":"I was pretty skeptical when I got these pills. My hair has been falling out in mass amounts over the course of 6 months. Since my hair is long and curly I didn’t really notice it was even an issue till it was too late and I saw a picture of myself one day a few months ago and realized my hair is so thin you can see straight through it and light on the other side shows through. I have always had super thick hair so after seeing that photo I went into panic mode. Ended up getting diagnosed with PCOS after other issues going on and realized hair loss is part of it. So I found this site and pills and thought “why not? Can’t hurt anything or possibly make it any worse so let’s give it a go.” I am so happy I did! I take a daily multivitamin anyway but the whatever specific ingredients this has in it really seems to be doing the trick. There are brand new baby hairs popping up everywhere!! Even though some are coming in grey I am celebrating every strand!! I realize new hair growth is a slow process so I’m not expecting my hair to be thick and lush ASAP. Seeing these baby hairs coming in and the little curls forming under my neck in the back of my head are such a relief. I have also noticed that when I wash my hair the little ball of hair loss isn’t nearly as much as before. I’m not sure if that’s because there’s not a whole lot of hair left to fall out or not but I’m going to also chalk that little win up to these magic pills. I will be purchasing a second bottle to keep this hair growth going. Thank you ST. Tropica!","review__Count4":"true","ch_review_img4":"shopify:\/\/shop_images\/Marie_Deyro.png","title4":"I noticed an increase in length","heading4":"Marie D","ch_review_content4":"I have experienced hair loss due to Polycystic Ovarian Syndrome (PCOS). My hair comes out in clumps, predominantly at the crown, similar to a male pattern hair loss, due to the nature of this hormonal issue. After taking the hair vitamins, I noticed an increase in length and some thickening. My hair still falls out in clumps, maybe there’s a small percentage decrease in hair loss? It’s hard to notice. I recommend that you take the vitamin with food. If not, you may feel nauseous and dizzy."}}},"block_order":["0467cdc2-8cb2-4f41-840c-45ffc40feeb2","cbcbed37-1a0b-49ad-be9d-812edc7135af"],"settings":{"specialized__review_title":"REAL PEOPLE WITH REAL RESULTS","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"animation":"none","css_class":"","css_id":"","custom_css":""}},"164864287453c7f8d9":{"type":"index__featured-product","blocks":{"164864287420959887-0":{"type":"title","settings":{}},"164864287420959887-1":{"type":"price","settings":{"display_savings":true}},"164864287420959887-3":{"type":"form","settings":{"show_payment_button":true}}},"block_order":["164864287420959887-0","164864287420959887-1","164864287420959887-3"],"settings":{"affiliate_code":"pcos","featured_product":"st-tropica-hair-vitamins-hair-challenge-2-month-supply","product_images_position":"left","set_product_height":false,"product_height":500,"video_looping":false,"gallery_arrows":true,"enable_zoom":true,"enable_product_lightbox":true,"slideshow_speed":0,"slideshow_transition":"slide","display_thumbnails":true,"thumbnail_position":"left-thumbnails","enable_thumbnail_slider":true,"width":"wide","padding_top":60,"padding_bottom":0,"animation":"none","css_class":"","custom_css":".product-gallery__main, .product-gallery__thumbnails.is-slide-nav--true {\n    opacity: 1;\n}"}},"164864161709cc9c7d":{"type":"specialized__page_faqs","blocks":{"79d32dd3-4ba6-4a52-ae8d-079325bb9204":{"type":"specialized__faqs","settings":{"heading":"WHAT ARE THE SYMPTOMS OF POLYCYSTIC OVARY SYNDROME?","specialized__faqs_ans":"<ul class=\"ul-disc\"> <li>Irregular periods or loss of cycle completely<\/li> <li>Difficulty getting pregnant (Due to irregular ovulation cycles)<\/li> <li>Weight Gain<\/li> <li>Thinning of hair<\/li> <li>Hair growth on face, chest, and back<\/li> <li>Having oily or acne prone skin<\/li>\n<\/ul>","faqs__expand":"true"}},"0f867232-9177-4a4a-90e2-a663c7ac9154":{"type":"specialized__faqs","settings":{"heading":"HOW CAN I ALLEVIATE SOME OF MY PCOS SYMPTOMS?","specialized__faqs_ans":"<p>Once you have been diagnosed by your physician with Polycystic Ovary Syndrome there are both medical and lifestyle options you can make to alleviate some of your symptoms. We recommend visiting your doctor to discuss the medical options available.<\/p>\n<p>As for lifestyle changes, are are a few that are known to help ease symptoms:<\/p>\n<ul class=\"ul-disc\"> <li>Maintaining a healthy weight through diet and exercise<\/li> <li>Reducing your intake of carbohydrates<\/li> <li>Limit sugar intake<\/li>\n<\/ul>","faqs__expand":"false"}},"2e597077-e1e7-4317-9f5b-8dc0e016b381":{"type":"specialized__faqs","settings":{"heading":"WHAT CAUSES PCOS?","specialized__faqs_ans":"<p>Currently, the cause of PCOS is unknown. However, it is thought that PCOS (Polycystic Ovary Syndrome) is caused by a high amount of androgens.<\/p>","faqs__expand":"false"}},"a6ff93f5-63ff-4d8c-a23b-7f511d3b8e6c":{"type":"specialized__faqs","settings":{"heading":"WHAT ARE ANDROGENS?","specialized__faqs_ans":"<p>Androgens are testosterone, androstenedione, dihydrotestosterone, dehydroepiandrosterone, and DHEA sulfate.<\/p>\n<p>They are often referred to as the \"male hormone\" because these hormones play an important role in the male reproductive system, however they are found in both men and women.<\/p>\n<p>In women, androgens typically convert into the female hormone known as estrogen. Androgens play an important role in puberty for women as well and are thought to be important to other major functions in the body.<\/p>\n<p>When androgen levels are too high in women though it can cause PCOS, and when they are too low it can cause Menopause or Perimenopause.<\/p>","faqs__expand":"false"}},"6c41f132-6520-4df3-9e37-0ec8743acc73":{"type":"specialized__faqs","settings":{"heading":"WHEN DO PEOPLE TYPICALLY GET DIAGNOSED WITH PCOS?","specialized__faqs_ans":"<p>PCOS most commonly is diagnosed between the ages of 20-30 years old, though is can occur any time after puberty. It is estimated that Polycystic Ovary Syndrome affects 6-10% of the female population.<\/p>","faqs__expand":"false"}},"061340b7-3b82-46d6-992c-6a89e8509e63":{"type":"specialized__faqs","settings":{"heading":"HOW DOES PCOS AFFECT HAIR LOSS AND HAIR GROWTH?","specialized__faqs_ans":"<p>One of the symptoms experienced by some of those diagnosed with Polycystic Ovary Syndrome is hair loss. This is because of the increased amount of androgens in the body and is often then diagnosed as androgenic alopecia.<\/p>","faqs__expand":"false"}},"5ff7199e-4dc5-47f7-9091-21be45367f2e":{"type":"specialized__faqs","settings":{"heading":"ARE THERE TREATMENTS AVAILABLE FOR POLYCYSTIC OVARY SYNDROME HAIR LOSS?","specialized__faqs_ans":"<p>There are treatments available to help treat hair loss in those who have PCOS. Often times these treatments need to address the cause which typically is androgens. These treatments must be discussed and implemented by a doctor.<\/p>\n<p>In addition to medical treatments, those struggling with hair loss can also use supplements to encourage faster hair growth.<\/p>","faqs__expand":"false"}},"1963c922-329c-4cf0-a0a0-0cca1a4499b8":{"type":"specialized__faqs","settings":{"heading":"Can Vitamins Help with PCOS Hair Loss?","specialized__faqs_ans":"<p>Yes! Supplementing with the right Vitamins can absolutely help.<\/p>\n<p>Our celebrated <a href=\"https:\/\/www.sttropica.com\/collections\/st-tropica-collection\/products\/st-tropica-hair-vitamins-hair-challenge-2-month-supply\" target=\"_blank\" title=\"Tru Bloom Hair Growth Vitamins\" rel=\"noopener noreferrer\">ST. TROPICA Hair Vitamins<\/a> have already helped many people suffering from PCOS related hair loss. Once again, all of the photos and reviews seen here are from our very own customers. They are 100% genuine and authentic, unedited, and unsolicited. They are from REAL people, with REAL results.<\/p>\n<p><a href=\"https:\/\/www.sttropica.com\/collections\/st-tropica-collection\/products\/st-tropica-hair-vitamins-hair-challenge-2-month-supply\" target=\"_blank\" title=\"Tru Bloom Hair Growth Vitamins\" rel=\"noopener noreferrer\">ST. TROPICA Hair Growth Vitamins<\/a> are a different kind of Hair Vitamin. They include 100% or more of the DV (Daily Value) of all the essential hair nutrients, PLUS our Proprietary, highly researched, plant &amp; fruit based HAIR SUPERFOOD formula. We have hand-selected only the best ingredients to create the world's best Hair Vitamins. Our 12 essential hair health ingredients (Vitamins, Protein &amp; Minerals) + 7 exclusive Hair Superfoods help maximize Hair Growth, Strength, and Thickness from the inside out. <\/p>\n<p>The Tru Bloom Hair Growth Vitamins are also 100% Drug-Free and Allergen Free. This means that they free of all 8 allergens for Nutritional Supplements, which are wheat, soy, peanuts, dairy, tree nuts, crustaceans, fish, and eggs!<\/p>\n<p>What’s more is that they come with our exclusive 100 DAY MONEY BACK GUARANTEE: Simply take our 60 Day Hair Challenge, and get Longer, Stronger Hair in 60 days flat, or your money back - where will we give you a full refund if you’re not delighted with your results. It's the Ultimate daily Hair Vitamin for extraordinary results, and we’ve made it a no-brainer by including our Ultimate Money-Back Guarantee, ensuring your total satisfaction.<\/p>","faqs__expand":"false"}}},"block_order":["79d32dd3-4ba6-4a52-ae8d-079325bb9204","0f867232-9177-4a4a-90e2-a663c7ac9154","2e597077-e1e7-4317-9f5b-8dc0e016b381","a6ff93f5-63ff-4d8c-a23b-7f511d3b8e6c","6c41f132-6520-4df3-9e37-0ec8743acc73","061340b7-3b82-46d6-992c-6a89e8509e63","5ff7199e-4dc5-47f7-9091-21be45367f2e","1963c922-329c-4cf0-a0a0-0cca1a4499b8"],"settings":{"affiliate_code":"pcos","specialized__faqs_title":"POLYCYSTIC OVARY SYNDROME (PCOS) FAQ","show__spe__review":true,"specialized__review_title":"So far I’m liking these vitamins","specialized__review_name":"Keisha R","specialized__review_img":"shopify:\/\/shop_images\/Keisha_Registe.png","specialized__review_content":"I was recently diagnosed with PCOS and started losing my hair as well thinning of my scalp.. I took these hair vitamins for 60 days and noticed my hair got longer, however I may need to take them for a few more months to see if my hair will get thicker. These vitamins will not disappoint you. Try them!","width":"wide","padding_top":60,"padding_bottom":20,"padding_left":0,"padding_right":0,"review__side":"order-0","animation":"none","css_class":"","css_id":"review2","custom_css":".trubloom_review_bg{\n    background-image: url(https:\/\/cdn.shopify.com\/s\/files\/1\/0818\/8965\/t\/96\/assets\/trubloom_review_bg_1.png?v=1648728108);\n    background-size: cover;\n}\n.trubloom_review_bg .purchase-details__buttons .action_button.action_button--secondary {\n    border: 1px solid #ff9ac6;\n    color: #ffffff;\n    background: #ff9ac6;\n}"}},"164999997067e9f8f9":{"type":"custom-liquid","settings":{"custom_liquid":"<div id=\"stamped-main-widget\" class=\"mx-0 mb-0\" data-keyword=\"pcos\"><\/div>\n<a href=\"\/products\/st-tropica-hair-vitamins-hair-challenge-2-month-supply\" class=\"button mx-auto\">Order Now<\/a>\n<style>\ndiv.stamped-container[data-widget-style], div[data-widget-style] div.stamped-container {\n    margin: 0px auto!important;\n}\n<\/style>"}}},"order":["164872987662732b2c","16486356205a406201","1655963000fde054ed","1648640448df60772a","1648645038b9435b55","164864287453c7f8d9","164864161709cc9c7d","164999997067e9f8f9"]}