{"sections":{"164872987662732b2c":{"type":"specialized__page_header","settings":{"spl_text":"Widely regarded as the Best hair growth vitamins for TELOGEN EFFLUVIUM","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"animation":"none","css_class":"","custom_css":".special-head{\n    background-image: url({{ 'trubloom_review_bg.png' | asset_url }});\n    background-size: cover;\n}\n.home-slide-content p {\n    color: #727272;\n    font-size: 18px;\n}\n.home-slide-content h2 {\n    color: #ff9ac6;\n    font-size: 26px;\n}"}},"16486356205a406201":{"type":"specialized__page_top","settings":{"specialized__title":"TELOGEN EFFLUVIUM & HAIR LOSS","specialized__top_content":"<p>We've been honored to hear from thousands of real customers that our Hair Vitamins have helped them through their hair loss struggles.<\/p><p>People from around the world who've suffered from Telogen Effluvium in particular, have been kind enough to submit reviews and results highlighting their positive experiences with ST. TROPICA. And we want to pay it forward by sharing with anyone & everyone who also may be dealing with Telogen Effluvium.<\/p><p>Many of us may not know what Telogen Effluvium is, and may have concerns over being undiagnosed; or just excited to find a resource focused specifically on Telogen Effluvium and hair loss. So let's dive into it.<\/p>","show__spe__review":true,"specialized__review_title":"my hair grows out","specialized__review_name":"Grac C","specialized__review_img":"shopify:\/\/shop_images\/Grac_C.png","specialized__review_content":"Hello! I've had 10 months of Telogen Effluvium from medication\/low ferretin. Had some huge bald spots on back of head and they are starting to fill in, believe St. Tropica has kickstarted some growth! I see baby hairs finally which I didn't before, can hopefully credit to this vitamin. No side effects- would just mix into a shake or take with water. Will be continuing to use until my hair grows out, thanks!","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"review__side":"order-0","animation":"none","css_class":"","custom_css":""}},"16559633224b4c04dc":{"type":"specialized__survey_section","settings":{"affiliate_code":"telogen","width":"wide","padding_top":70,"padding_bottom":20,"padding_left":0,"padding_right":0,"review__side":"order-0","animation":"none","css_class":"","custom_css":""}},"1648640448df60772a":{"type":"specialized__what_is","settings":{"specialized__what_icon1":"shopify:\/\/shop_images\/TELOGEN1.png","specialized__what_title":"WHAT IS TELOGEN EFFLUVIUM?","specialized__what_content":"<p>Telogen Effluvium is a temporary form of hair loss that typically occurs after a person has gone through a traumatic or stressful life event. Most often, it happens several months after the event has taken place. While Telogen Effluvium is mainly caused by stress, it can also be caused by poor diet, sudden weight loss, Menopause, and other underlying health conditions. It is considered to be the second most common cause of hair loss, second to Androgenetic Alopecia and it typically is reversible.<\/p>","show__sym":false,"specialized__sym_title":"","specialized__sym_content":"","specialized__how_title":"HOW CAN ST. TROPICA HAIR VITAMINS HELP?","specialized__how_content":"<p>We are excited to share that we are constantly receiving incredibly positive feedback, in the form of 5 star photo reviews, from many of our valued customers who are struggling with Telogen Effluvium symptoms; and who are experiencing tremendous results by using our one-of-a-kind Tru Bloom Hair Vitamins. All of the photos and reviews seen here are 100% genuine and authentic, and they are unedited, and unsolicited. In short, they are the real deal.<\/p><p>Tru Bloom Hair Growth Vitamins by ST. TROPICA are a different kind of Hair Vitamin. They include 100% or more of the DV (Daily Value) of all the essential hair nutrients, PLUS our Proprietary, highly researched, plant & fruit based HAIR SUPERFOOD formula. We have hand-selected only the best ingredients to create the world's best Hair Vitamins. Our 12 essential hair health ingredients (Vitamins, Protein & Minerals) + 7 exclusive Hair Superfoods help maximize Hair Growth, Strength and Thickness from the inside-out.<\/p><p>What’s more is that they come with an exclusive 100 DAY MONEY BACK GUARANTEE: Simply take our 60 Day Hair Challenge, and get Longer, Stronger Hair in 60 days flat, or your money back - where will we give you a full refund if you’re not delighted with your results. It's the Ultimate daily Hair Vitamin for extraordinary results, and we’ve made it a no-brainer by including our Ultimate Money-Back Guarantee, ensuring your total satisfaction.<\/p>","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"animation":"none","css_class":"","custom_css":""}},"1648645038b9435b55":{"type":"specialized__review_slide","blocks":{"ba895ec7-3287-4c57-b3c8-076ee0344b7f":{"type":"60day-challenge","settings":{"review__Count1":"false","title":"","heading":"","ch_review_content":"","review__Count2":"true","ch_review_img2":"shopify:\/\/shop_images\/Shayne_S.png","title2":"they're working","heading2":"Shayne S","ch_review_content2":"Listen to the reviews! I'm 32 who has blonde, fine (typically) thick hair. After abruptly coming off of hormonal birth control because I noticed receding and thinning hair, I continued to lose more. To remedy, I've tried so many different hair vitamins since October, 2020 and either didn't notice anything happening, or had adverse effects to the ingredients. From so much continual disappointment, I even began to doubt St. Tropica until I looked at my before photos and realized these have helped tremendously. I took a deeper look at the front forehead line of my hair (where I first lost hair from birth control) and I have soooo many more new hairs growing. I have been parting sections of hair around my crown too to apply another serum product for strengthening follicles where I've lost 75% of my density because of telogen effluvium, and I FINALLY see hair sprouting through there too! I have to believe it's because of these vitamins. And I'm not even done with my 60 days yet. Please listen to the reviews. If it ends up not working for you, you can get your money back and put that towards another product. I'm going to continue these vitamins because they're working and it shows in my confidence now. I even bought a bottle for my 60 year old mom who has very fine, thin, brittle hair (who'd been starting to see more of her scalp and had been feeling less confident), and she is almost done with her 60-days and told me all her friends have started complimenting how beautiful her hair looks (and she hasn't gotten compliments on her hair since she was much younger). So it's working for her too!","review__Count3":"true","ch_review_img3":"shopify:\/\/shop_images\/Gabriela_M.png","title3":"I will continue to use this product","heading3":"Gabriela M","ch_review_content3":"I want to start off by saying that this product works. I began to losing significant amount of hair due to pandemic and everyday stress as woman it was extremely disheartening to see the clumps of hair after showering or when combing my hair. My hair was thinning and this did not help with stress. I heard about St. Tropica products on social media and decided to give it a try. I had no side effects pill Is easy to swallow and let me tell you it works. Though I’m still not out of the woods with my TE it’s really exciting to see the regrowth and really has helped me with stressing less as I see a light at the end of the tunnel. This product works and I will continue to use this product and would recommend to others","review__Count4":"true","ch_review_img4":"shopify:\/\/shop_images\/Kayla_V.png","title4":"purchasing these vitamins EVERY MONTH! 🥰","heading4":"Kayla V","ch_review_content4":"These vitamins were a godsend! I was suffering from Telogen Effluvium from a surgery I had in October. My hair started falling out in handfuls in December. I started these as soon as I could get my hands on them! I had dyed my hair in November as a pick me up after surgery, not realizing my hair would soon be falling out. I started these vitamins in January. You can see from the photos my hair growth from November to January, then hair growth from January to now! Not even exaggerating, 1 WEEK after starting them, my hair fall slowed significantly! It has since stopped almost completely, and I’m in the process of growing out my natural brown color! So in love and will be purchasing these vitamins EVERY MONTH! 🥰"}},"cbcbed37-1a0b-49ad-be9d-812edc7135af":{"type":"60day-challenge","settings":{"review__Count1":"false","title":"","heading":"","ch_review_content":"","review__Count2":"true","ch_review_img2":"shopify:\/\/shop_images\/Joy_Pedrazzo.png","title2":"my hair was thicker, longer, & stronger","heading2":"Joy P","ch_review_content2":"I found St. Tropica in one of the lowest points of my life. After several rounds of steroid shots for pain I developed Cushing’s syndrome resulting in TE. Devastated as I was a hair model and completely stressed is an understatement. I stumbled upon St. Tropica on fb, read the reviews and did my research. I was willing to give it a try. After 60 days, my hair was thicker, longer and stronger. I love these vitamins. It didn’t cure my TE but helped restore and regrow the hair loss quickly. Ty so much!!!","review__Count3":"true","ch_review_img3":"shopify:\/\/shop_images\/Rita_Siminkas.png","title3":"Give these vitamins a try!","heading3":"Rita S","ch_review_content3":"I wanted to grow out a hair cut that I disliked. I have thin hair and am prone to Telogen Effluvium. These vitamins help speed up hair growth. I still had shedding but at least the hair that didn't shed grew quickly and I got my length back in record time ! Give these vitamins a try ! No side effects and easy to take !","review__Count4":"true","ch_review_img4":"shopify:\/\/shop_images\/Stephanie_Martinez.png","title4":"now it feels a bit healthier","heading4":"Stephanie M","ch_review_content4":"Back in March I noticed my hair falling out like crazy...literal clumps in the shower and even brushing after. I noticed really intense thinning at the very front of my middle part. I was already taking a hair vitamin but as time went on I noticed the thinning becoming much worse and all over rather than just in one spot. My blood work is normal so I’m thinking it’s some form of Telogen Effluvium (basically stress induced). About two months ago when my other hair vitamin ran out, I decided to try St Tropica because of all of the great reviews and PROOF of pics. I’m happy to say that I am starting to notice some of the thinning is filling in and I’m not losing quite as much in the shower. I’m stilling having hair fall which doesn’t help with the stress, but I’m hoping if I continue to take these vitamins I will have more improvement. I will say that the quality of my hair has drastically improved. Before these vitamins my hair was dry and damaged from bleaching, now it feels a bit healthier."}}},"block_order":["ba895ec7-3287-4c57-b3c8-076ee0344b7f","cbcbed37-1a0b-49ad-be9d-812edc7135af"],"settings":{"specialized__review_title":"REAL PEOPLE WITH REAL RESULTS","width":"wide","padding_top":60,"padding_bottom":0,"padding_left":0,"padding_right":0,"animation":"none","css_class":"","css_id":"","custom_css":""}},"164864287453c7f8d9":{"type":"index__featured-product","blocks":{"164864287420959887-0":{"type":"title","settings":{}},"164864287420959887-1":{"type":"price","settings":{"display_savings":true}},"164864287420959887-3":{"type":"form","settings":{"show_payment_button":true}}},"block_order":["164864287420959887-0","164864287420959887-1","164864287420959887-3"],"settings":{"affiliate_code":"telogen","featured_product":"st-tropica-hair-vitamins-hair-challenge-2-month-supply","product_images_position":"left","set_product_height":false,"product_height":500,"video_looping":false,"gallery_arrows":true,"enable_zoom":true,"enable_product_lightbox":true,"slideshow_speed":0,"slideshow_transition":"slide","display_thumbnails":true,"thumbnail_position":"left-thumbnails","enable_thumbnail_slider":true,"width":"wide","padding_top":60,"padding_bottom":0,"animation":"none","css_class":"","custom_css":".product-gallery__main, .product-gallery__thumbnails.is-slide-nav--true {\n    opacity: 1;\n}"}},"164864161709cc9c7d":{"type":"specialized__page_faqs","blocks":{"2196180a-fb49-4d68-93fa-c36e6716e102":{"type":"specialized__faqs","settings":{"heading":"WHAT IS THE DIFFERENCE BETWEEN TELOGEN EFFLUVIUM AND ANDROGENETIC ALOPECIA?","specialized__faqs_ans":"<p>In women, Androgenetic Alopecia is a form of chronic Telogen Effluvium.<\/p>\n                        <p>However, in men, Telogen Effluvium and Androgenetic Alopecia show different patterns of\n                            balding which differentiates themselves from one another. <\/p>\n                        <p>In men, Telogen Effluvium results in a thinning of hair all over the head. The hair loss is\n                            diffused all over the scalp, rather than being in a set pattern. Men that have Androgenetic\n                            Alopecia often lose their hair at the top of their head and their front hairline recedes in\n                            a \"M\" shape. <\/p>","faqs__expand":"true"}},"d0abd0c2-9847-405d-b176-5438c621d59c":{"type":"specialized__faqs","settings":{"heading":"WHAT ARE THE SYMPTOMS TELOGEN EFFLUVIUM?","specialized__faqs_ans":"<p>Hair loss is the main symptom of Telogen Effluvium. Some people notice more hair loss when\n                            they wash their hair or when they brush their hair. <\/p>\n                        <p>On average a person sheds 50 to 100 strands of hair per day. When you are experiencing\n                            Telogen Effluvium you will notice significantly more, closer to 300 strands per day. <\/p>","faqs__expand":"false"}},"e2beb7e5-edb0-4218-a80a-fade636e25ad":{"type":"specialized__faqs","settings":{"heading":"CAN YOU GO BALD FROM TELOGEN EFFLUVIUM?","specialized__faqs_ans":"<p>No, Telogen Effluvium does not cause baldness. While it does cause hair loss and hair thinning\n                        overall or in patches, it does not cause baldness all over the scalp. <\/p>","faqs__expand":"false"}},"b228b57b-352b-4e05-9652-187ab51a3faa":{"type":"specialized__faqs","settings":{"heading":"HOW DOES TELOGEN EFFLUVIUM GET DIAGNOSED?","specialized__faqs_ans":"<p>To diagnose Telogen Effluvium you must visit your doctor. They will review your medical history\n                        as well as your scalp and hair to diagnose the cause of your hair loss. <\/p>","faqs__expand":"false"}},"ead0151e-e63e-44cd-b7f1-08ea097e48a7":{"type":"specialized__faqs","settings":{"heading":"HOW LONG DOES TELOGEN EFFLUVIUM LAST?","specialized__faqs_ans":"<p>Without treatment, Telogen Effluvium will likely resolve itself within several months. The\n                        typical timeframe for Telogen Effluvium is approximately 3 to 6 months. Following that, a\n                        persons hair typically resumes their normal hair growth rate. <\/p>","faqs__expand":"false"}},"e751eb22-3cde-4d92-a980-e6fddf5494c7":{"type":"specialized__faqs","settings":{"heading":"ARE TREATMENTS AVAILABLE FOR TELOGEN EFFLUVIUM?","specialized__faqs_ans":"<p>Yes, there are treatments available, however first and foremost the cause must be addressed.\n                            Once the cause has been identified, then you can begin to implement diet and lifestyle\n                            changes.<\/p>\n                        <p>Your doctor may also offer hormone replacement therapy or suggest non-surgical hair\n                            replacement. It is also important to address any nutritional deficiencies you may have with\n                            your doctor and improve them using supplements.<\/p>\n                        <p>Supplements have also been shown to help those suffering from Telogen Effluvium hair loss as\n                            vitamins with Biotin, Iron, and Niacin have been shown to help support new hair growth. <\/p>","faqs__expand":"false"}},"7476c332-544b-47e9-8638-df7f3c8d041a":{"type":"specialized__faqs","settings":{"heading":"WHAT ELSE CAN YOU DO TO REVERSE tELOGEN EFFLUVIUM HAIR LOSS?","specialized__faqs_ans":"<p>Once you've spoken to your doctor and come up with a medical plan, you can implement these\n                            lifestyle changes:<\/p>\n                        <ul class=\"ul-disc\">\n                            <li>Use gentle hair care<\/li>\n                            <li>Avoid using heat tools and use heatless styling methods instead<\/li>\n                            <li>Avoid styling methods that tug or pull on the root of your hair<\/li>\n                            <li>Take vitamins that are specifically formulated for hair growth<\/li>\n                            <li>Incorporate exercises that will help manage your stress (yoga, pilates, and meditation\n                                are all great options)<\/li>\n                            <li>Eat a diet rich in protein as well as vitamin A, E, B7, C, D, Iron, and Zinc.<\/li>\n                        <\/ul>","faqs__expand":"false"}},"1e96ff53-84c7-4e4e-bb1c-5d12653a3ff7":{"type":"specialized__faqs","settings":{"heading":"CAN VITAMINS HELP WITH TELOGEN EFFLUVIUM HAIR LOSS?","specialized__faqs_ans":"<p>Yes! Supplementing with the right Vitamins can absolutely help.<\/p>\n<p>Our celebrated <a href=\"https:\/\/www.sttropica.com\/collections\/st-tropica-collection\/products\/st-tropica-hair-vitamins-hair-challenge-2-month-supply\" target=\"_blank\" title=\"Tru Bloom Hair Growth Vitamins\" rel=\"noopener noreferrer\">ST. TROPICA Hair Vitamins<\/a> have already helped many people suffering from Telogen Effluvium related hair loss. Once again, all of the photos and reviews seen here are from our very own customers. They are 100% genuine and authentic, unedited, and unsolicited. They are from REAL people, with REAL results.<\/p>\n<p><a href=\"https:\/\/www.sttropica.com\/collections\/st-tropica-collection\/products\/st-tropica-hair-vitamins-hair-challenge-2-month-supply\" target=\"_blank\" title=\"Tru Bloom Hair Growth Vitamins\" rel=\"noopener noreferrer\">ST. TROPICA Hair Growth Vitamins<\/a> are a different kind of Hair Vitamin. They include 100% or more of the DV (Daily Value) of all the essential hair nutrients, PLUS our Proprietary, highly researched, plant &amp; fruit based HAIR SUPERFOOD formula. We have hand-selected only the best ingredients to create the world's best Hair Vitamins. Our 12 essential hair health ingredients (Vitamins, Protein &amp; Minerals) + 7 exclusive Hair Superfoods help maximize Hair Growth, Strength, and Thickness from the inside out. <\/p>\n<p>The Tru Bloom Hair Growth Vitamins are also 100% Drug-Free and Allergen Free. This means that they free of all 8 allergens for Nutritional Supplements, which are wheat, soy, peanuts, dairy, tree nuts, crustaceans, fish, and eggs!<\/p>\n<p>What’s more is that they come with our exclusive 100 DAY MONEY BACK GUARANTEE: Simply take our 60 Day Hair Challenge, and get Longer, Stronger Hair in 60 days flat, or your money back - where will we give you a full refund if you’re not delighted with your results. It's the Ultimate daily Hair Vitamin for extraordinary results, and we’ve made it a no-brainer by including our Ultimate Money-Back Guarantee, ensuring your total satisfaction.<\/p>","faqs__expand":"false"}}},"block_order":["2196180a-fb49-4d68-93fa-c36e6716e102","d0abd0c2-9847-405d-b176-5438c621d59c","e2beb7e5-edb0-4218-a80a-fade636e25ad","b228b57b-352b-4e05-9652-187ab51a3faa","ead0151e-e63e-44cd-b7f1-08ea097e48a7","e751eb22-3cde-4d92-a980-e6fddf5494c7","7476c332-544b-47e9-8638-df7f3c8d041a","1e96ff53-84c7-4e4e-bb1c-5d12653a3ff7"],"settings":{"affiliate_code":"telogen","specialized__faqs_title":"TELOGEN EFFLUVIUM FAQ","show__spe__review":true,"specialized__review_title":"Finally some relief!","specialized__review_name":"Kelly","specialized__review_img":"shopify:\/\/shop_images\/Kelly.png","specialized__review_content":"I've taken sugar bear hair vitamins for years, but I noticed recently that it wasn't showing the same results as it usually did. I was diagnosed with telogen effluvium and was told my hair would be falling out for 3 to 6 months and then would take 2 years to grow back to the length it was before my condition started. I started taking these vitamins and after two months, my hair has stopped falling out and I've seen so much growth and so many baby hairs, the relief is amazing. I'll be continuing to take these and hopefully it won't take the full two years to get my hair back to how it was.","width":"wide","padding_top":60,"padding_bottom":20,"padding_left":0,"padding_right":0,"review__side":"order-0","animation":"none","css_class":"","css_id":"review2","custom_css":".trubloom_review_bg{\n    background-image: url(https:\/\/cdn.shopify.com\/s\/files\/1\/0818\/8965\/t\/96\/assets\/trubloom_review_bg_1.png?v=1648728108);\n    background-size: cover;\n}\n.trubloom_review_bg .purchase-details__buttons .action_button.action_button--secondary {\n    border: 1px solid #ff9ac6;\n    color: #ffffff;\n    background: #ff9ac6;\n}\nbutton.accordion-button {\n    text-transform: unset;\n}"}},"16500007636ef88f18":{"type":"custom-liquid","settings":{"custom_liquid":"<div id=\"stamped-main-widget\" class=\"mx-0 mb-0\" data-keyword=\"telogen\"><\/div>\n<a href=\"\/products\/st-tropica-hair-vitamins-hair-challenge-2-month-supply\" class=\"button mx-auto\">Order Now<\/a>\n<style>\ndiv.stamped-container[data-widget-style], div[data-widget-style] div.stamped-container {\n    margin: 0px auto!important;\n}\n<\/style>"}}},"order":["164872987662732b2c","16486356205a406201","16559633224b4c04dc","1648640448df60772a","1648645038b9435b55","164864287453c7f8d9","164864161709cc9c7d","16500007636ef88f18"]}